<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 5.1, http://www.gnu.org/software/texinfo/ -->
<head>
<title>Maxima Manual: Funktionen und Variablen der Ausgabe</title>

<meta name="description" content="Maxima Manual: Funktionen und Variablen der Ausgabe">
<meta name="keywords" content="Maxima Manual: Funktionen und Variablen der Ausgabe">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="maxima_toc.html#Top" rel="start" title="Top">
<link href="maxima_334.html#Index-der-Variablen-und-Funktionen" rel="index" title="Index der Variablen und Funktionen">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="Inhaltsverzeichnis">
<link href="maxima_7.html#Kommandozeile" rel="up" title="Kommandozeile">
<link href="maxima_11.html#Datentypen-und-Strukturen" rel="next" title="Datentypen und Strukturen">
<link href="maxima_9.html#Funktionen-und-Variablen-der-Eingabe" rel="previous" title="Funktionen und Variablen der Eingabe">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
blockquote.smallquotation {font-size: smaller}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
div.indentedblock {margin-left: 3.2em}
div.lisp {margin-left: 3.2em}
div.smalldisplay {margin-left: 3.2em}
div.smallexample {margin-left: 3.2em}
div.smallindentedblock {margin-left: 3.2em; font-size: smaller}
div.smalllisp {margin-left: 3.2em}
kbd {font-style:oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: inherit; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: inherit; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.nocodebreak {white-space:nowrap}
span.nolinebreak {white-space:nowrap}
span.roman {font-family:serif; font-weight:normal}
span.sansserif {font-family:sans-serif; font-weight:normal}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="../figures/favicon.ico">

</head>

<body lang="de" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">
<a name="Funktionen-und-Variablen-der-Ausgabe"></a>
<div class="header">
<p>
Previous: <a href="maxima_9.html#Funktionen-und-Variablen-der-Eingabe" accesskey="p" rel="previous">Funktionen und Variablen der Eingabe</a>, Nach oben: <a href="maxima_7.html#Kommandozeile" accesskey="u" rel="up">Kommandozeile</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Inhaltsverzeichnis" rel="contents">Inhalt</a>][<a href="maxima_334.html#Index-der-Variablen-und-Funktionen" title="Index" rel="index">Index</a>]</p>
</div>
<a name="Funktionen-und-Variablen-der-Ausgabe-1"></a>
<h3 class="section">4.3 Funktionen und Variablen der Ausgabe</h3>

<a name="g_t_0025edispflag"></a><a name="Item_003a-Command_002ede_002fdefvr_002f_0025edispflag"></a><dl>
<dt><a name="index-_0025edispflag"></a>Optionsvariable: <strong>%edispflag</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat <code>%edispflag</code> den Wert <code>true</code>, zeigt Maxima die Exponentiation von
<code><a href="maxima_18.html#g_t_0025e">%e</a></code> mit einem negativen Exponenten als Quotienten an.  Siehe auch die
Optionsvariable <code><a href="#exptdispflag">exptdispflag</a></code>.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) %e^-10;
                               - 10
(%o1)                        %e
(%i2) %edispflag:true$
(%i3) %e^-10;
                               1
(%o3)                         ----
                                10
                              %e
</pre></div>
</dd></dl>

<a name="absboxchar"></a><a name="Item_003a-Command_002ede_002fdefvr_002fabsboxchar"></a><dl>
<dt><a name="index-absboxchar"></a>Optionsvariable: <strong>absboxchar</strong></dt>
<dd><p>Standardwert: <code>!</code>
</p>
<p>Die Optionsvariable <code>absboxchar</code> enth&auml;lt das Zeichen, das von Maxima
benutzt wird, um den Betrag eines Ausdruckes anzuzeigen, der mehr als eine
Zeile ben&ouml;tigt.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) abs((x^3+1));
                            ! 3    !
(%o1)                       !x  + 1!
</pre></div>
</dd></dl>

<a name="disp"></a><a name="Item_003a-Command_002ede_002fdeffn_002fdisp"></a><dl>
<dt><a name="index-disp"></a>Funktion: <strong>disp</strong> <em>(<var>expr_1</var>, <var>expr_2</var>, &hellip;)</em></dt>
<dd>
<p>Ist &auml;hnlich wie die Funktion <code><a href="#display">display</a></code>.  Die Funktion <code>disp</code>
zeigt jedoch keine Gleichungen sondern nur die Ergebnisse der Ausdr&uuml;cke
<var>expr_1</var>, <var>expr_2</var>, &hellip; an.
</p>
<p>Siehe auch die Funktionen <code><a href="#ldisp">ldisp</a></code>, <code><a href="#display">display</a></code> und <code><a href="#print">print</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) b[1,2]:x-x^2$
(%i2) x:123$
(%i3) disp(x, b[1,2], sin(1.0));
                               123

                                  2
                             x - x

                        .8414709848078965

(%o3)                         done
</pre></div>
</dd></dl>

<a name="display"></a><a name="Item_003a-Command_002ede_002fdeffn_002fdisplay"></a><dl>
<dt><a name="index-display"></a>Funktion: <strong>display</strong> <em>(<var>expr_1</var>, <var>expr_2</var>, &hellip;)</em></dt>
<dd>
<p>Die Variablen oder Ausdr&uuml;cke <var>expr_i</var> werden als eine Gleichung 
ausgegeben.  Die linke Seite der Gleichung ist die Variable oder der Ausdruck 
<var>expr_i</var> und die rechte Seite der Wert der Variablen oder das Ergebnis des 
Ausdrucks.  Die Argumente k&ouml;nnen Variable, indizierte Variable oder Funktionen
sein.
</p>
<p>Siehe auch die Funktionen <code><a href="#ldisplay">ldisplay</a></code>, <code><a href="#disp">disp</a></code> und <code><a href="#ldisp">ldisp</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) b[1,2]:x-x^2$
(%i2) x:123$
(%i3) display(x, b[1,2], sin(1.0));
                             x = 123

                                      2
                         b     = x - x
                          1, 2

                  sin(1.0) = .8414709848078965

(%o3)                         done
</pre></div>
</dd></dl>

<a name="display2d"></a><a name="Item_003a-Command_002ede_002fdefvr_002fdisplay2d"></a><dl>
<dt><a name="index-display2d"></a>Optionsvariable: <strong>display2d</strong></dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat <code>display2d</code> den Wert <code>false</code>, werden Ausdr&uuml;cke auf der Konsole
linear und nicht zweidimensional angezeigt.
</p>
<p>Siehe auch die Optionsvariable <code><a href="#leftjust">leftjust</a></code>, um Formeln linksb&uuml;ndig
auszugeben.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) x/(x^2+1);
                               x
(%o1)                        ------
                              2
                             x  + 1
(%i2) display2d:false$
(%i3) x/(x^2+1);
(%o3) x/(x^2+1)
</pre></div>
</dd></dl>

<a name="display_005fformat_005finternal"></a><a name="Item_003a-Command_002ede_002fdefvr_002fdisplay_005fformat_005finternal"></a><dl>
<dt><a name="index-display_005fformat_005finternal"></a>Optionsvariable: <strong>display_format_internal</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat <code>display_format_internal</code> den Wert <code>true</code>, werden Ausdr&uuml;cke 
f&uuml;r die Anzeige nicht in die externe Darstellung transformiert.  Die Ausgabe 
erfolgt wie in der internen Darstellung.  Das entspricht der R&uuml;ckgabe der 
Funktion <code><a href="maxima_32.html#inpart">inpart</a></code>.
</p>
<p>Siehe die Funktion <code><a href="maxima_32.html#dispform">dispform</a></code> f&uuml;r Beispiele, die den Unterschied zwischen
der internen und der externen Darstellung zeigen.
</p></dd></dl>

<a name="dispterms"></a><a name="Item_003a-Command_002ede_002fdeffn_002fdispterms"></a><dl>
<dt><a name="index-dispterms"></a>Funktion: <strong>dispterms</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Der Ausdruck <var>expr</var> wird zeilenweise ausgegeben.  Auf der ersten Zeile wird
der Operator des Ausdrucks <var>expr</var> ausgegeben.  Dann werden die Argumente des
Operators zeilenweise ausgegeben.  Dies kann n&uuml;tzlich sein, wenn ein Ausdruck 
sehr lang ist.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) dispterms(2*a*sin(x)+%e^x);

+

2 a sin(x)

  x
%e

(%o1)                         done
</pre></div>
</dd></dl>

<a name="expt"></a><a name="ncexpt"></a><a name="Item_003a-Command_002ede_002fdefvr_002fexpt"></a><dl>
<dt><a name="index-expt"></a>Spezielles Symbol: <strong>expt</strong> <em>(<var>a</var>, <var>b</var>)</em></dt>
<dd><a name="Item_003a-Command_002ede_002fdefvr_002fncexpt"></a></dd><dt><a name="index-ncexpt"></a>Spezielles Symbol: <strong>ncexpt</strong> <em>(<var>a</var>, <var>b</var>)</em></dt>
<dd>
<p>Ist ein Exponentialausdruck zu lang, um ihn als <code><var>a</var>^<var>b</var></code> 
anzuzeigen, wird stattdessen <code>expt(<var>a</var>, <var>b</var>)</code> angezeigt.
Entsprechend wird statt <code><var>a</var>^^<var>b</var></code>, <code>ncexpt(<var>a</var>, <var>b</var>)</code>
angezeigt.  <code>expt</code> und <code>ncexpt</code> sind keine Funktionen und erscheinen 
nur in der Ausgabe.
</p></dd></dl>

<a name="exptdispflag"></a><a name="Item_003a-Command_002ede_002fdefvr_002fexptdispflag"></a><dl>
<dt><a name="index-exptdispflag"></a>Optionsvariable: <strong>exptdispflag</strong></dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat die Optionsvariable <code>exptdispflag</code> den Wert <code>true</code>, werden
Ausdr&uuml;cke mit einem negativen Exponenten als Quotient angezeigt.  Siehe auch
die Optionsvariable <code><a href="#g_t_0025edispflag">%edispflag</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) exptdispflag:true;
(%o1)                         true
(%i2) 10^-x;
                                1
(%o2)                          ---
                                 x
                               10
(%i3) exptdispflag:false;
(%o3)                         false
(%i4) 10^-x;
                                - x
(%o4)                         10
</pre></div>
</dd></dl>

<a name="grind"></a><a name="Item_003a-Command_002ede_002fdeffn_002fgrind"></a><dl>
<dt><a name="index-grind"></a>Funktion: <strong>grind</strong> <em>(<var>expr</var>)</em></dt>
<dt><a name="index-grind-1"></a>Optionsvariable: <strong>grind</strong></dt>
<dd>
<p>Die Funktion <code>grind</code> gibt den Ausdruck <var>expr</var> auf der Konsole in einer
Form aus, die f&uuml;r die Eingabe in Maxima geeignet ist.  <code>grind</code> gibt 
<code>done</code> zur&uuml;ck.
</p>
<p>Ist <var>expr</var> der Name einer Funktion oder eines Makros, gibt <code>grind</code>
die Definition der Funktion oder des Makros aus.
</p>
<p>Siehe auch die Funktion <code><a href="maxima_17.html#string">string</a></code>, die einen Ausdruck als eine
Zeichenkette zur&uuml;ckgibt.
</p>
<p>Hat die Optionsvariable <code>grind</code> den Wert <code>true</code>, haben die Ergebnisse
der Funktionen <code><a href="maxima_76.html#stringout">stringout</a></code> und <code>string</code> dasselbe Format wie die 
Funktion <code>grind</code>.  Ansonsten werden keine spezielle Formatierungen
von diesen Funktionen vorgenommen.  Der Standardwert der Optionsvariablen
<code>grind</code> ist <code>false</code>.
</p>
<p><code>grind</code> kann auch ein Argument der Funktion <code><a href="maxima_9.html#playback">playback</a></code> sein.  In
diesem Fall gibt <code>playback</code> die Eingabe im gleichen Format wie die Funktion
<code>grind</code> aus.
</p>
<p><code>grind</code> wertet das Argument aus.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) aa + 1729;
(%o1)                       aa + 1729
(%i2) grind (%);
aa+1729$
(%o2)                         done
(%i3) [aa, 1729, aa + 1729];
(%o3)                 [aa, 1729, aa + 1729]
(%i4) grind (%);
[aa,1729,aa+1729]$
(%o4)                         done
(%i5) matrix ([aa, 17], [29, bb]);
                           [ aa  17 ]
(%o5)                      [        ]
                           [ 29  bb ]
(%i6) grind (%);
matrix([aa,17],[29,bb])$
(%o6)                         done
(%i7) set (aa, 17, 29, bb);
(%o7)                   {17, 29, aa, bb}
(%i8) grind (%);
{17,29,aa,bb}$
(%o8)                         done
(%i9) exp (aa / (bb + 17)^29);
</pre><pre class="example">                                aa
                            -----------
                                     29
                            (bb + 17)
(%o9)                     %e
</pre><pre class="example">(%i10) grind (%);
%e^(aa/(bb+17)^29)$
(%o10)                        done
(%i11) expr: expand ((aa + bb)^10);
</pre><pre class="example">         10           9        2   8         3   7         4   6
(%o11) bb   + 10 aa bb  + 45 aa  bb  + 120 aa  bb  + 210 aa  bb
         5   5         6   4         7   3        8   2
 + 252 aa  bb  + 210 aa  bb  + 120 aa  bb  + 45 aa  bb
        9        10
 + 10 aa  bb + aa
</pre><pre class="example">(%i12) grind (expr);
</pre><pre class="example">bb^10+10*aa*bb^9+45*aa^2*bb^8+120*aa^3*bb^7+210*aa^4*bb^6
     +252*aa^5*bb^5+210*aa^6*bb^4+120*aa^7*bb^3+45*aa^8*bb^2
     +10*aa^9*bb+aa^10$
(%o12)                        done
</pre><pre class="example">(%i13) string (expr);
(%o13) bb^10+10*aa*bb^9+45*aa^2*bb^8+120*aa^3*bb^7+210*aa^4*bb^6\
+252*aa^5*bb^5+210*aa^6*bb^4+120*aa^7*bb^3+45*aa^8*bb^2+10*aa^9*\
bb+aa^10
</pre></div>
</dd></dl>

<a name="ibase"></a><a name="Item_003a-Command_002ede_002fdefvr_002fibase"></a><dl>
<dt><a name="index-ibase"></a>Optionsvariable: <strong>ibase</strong></dt>
<dd><p>Standardwert: <code>10</code>
</p>
<p><code>ibase</code> enth&auml;lt die Basis der ganzen Zahlen, welche von Maxima eingelesen
werden.
</p>
<p><code>ibase</code> kann eine ganze Zahl zwischen 2 und einschlie&szlig;lich 36 
zugewiesen werden.  Ist <code>ibase</code> gr&ouml;&szlig;er als 10, werden die Zahlen 0 
bis 9 und die Buchstaben A, B, C, &hellip; f&uuml;r die Darstellung der Zahl in der 
Basis <code>ibase</code> herangezogen.  Gro&szlig;e und kleine Buchstaben werden nicht 
unterschieden.  Die erste Stelle muss immer eine Ziffer sein, damit Maxima den 
eingelesenen Ausdruck als eine Zahl interpretiert.
</p>
<p>Gleitkommazahlen werden immer zur Basis 10 interpretiert.
</p>
<p>Siehe auch <code><a href="#obase">obase</a></code>.
</p>
<p>Beispiele:
</p>
<p><code>ibase</code> ist kleiner als 10.
</p>
<div class="example">
<pre class="example">(%i1) ibase : 2 $
(%i2) obase;
(%o2)                          10
(%i3) 1111111111111111;
(%o3)                         65535
</pre></div>

<p><code>ibase</code> ist gr&ouml;&szlig;er als 10.  Die erste Stelle muss eine Ziffer sein.
</p>
<div class="example">
<pre class="example">(%i1) ibase : 16 $
(%i2) obase;
(%o2)                          10
(%i3) 1000;
(%o3)                         4096
(%i4) abcd;
(%o4)                         abcd
(%i5) symbolp (abcd);
(%o5)                         true
(%i6) 0abcd;
(%o6)                         43981
(%i7) symbolp (0abcd);
(%o7)                         false
</pre></div>

<p>Wird eine ganze Zahl mit einem Dezimalpunkt beendet, wird die Zahl als 
Gleitkommazahl interpretiert.
</p>
<div class="example">
<pre class="example">(%i1) ibase : 36 $
(%i2) obase;
(%o2)                          10
(%i3) 1234;
(%o3)                         49360
(%i4) 1234.;
(%o4)                         1234
</pre></div>
</dd></dl>

<a name="ldisp"></a><a name="Item_003a-Command_002ede_002fdeffn_002fldisp"></a><dl>
<dt><a name="index-ldisp"></a>Funktion: <strong>ldisp</strong> <em>(<var>expr_1</var>, &hellip;, <var>expr_n</var>)</em></dt>
<dd>
<p>Die Ausdr&uuml;cke <var>expr_1</var>, &hellip;, <var>expr_n</var> werden auf der Konsole 
ausgegeben.  Dabei wird jedem Ausdruck eine Zwischenmarke zugewiesen.  Die Liste
der Zwischenmarken wird als Ergebnis zur&uuml;ckgegeben.
</p>
<p>Siehe auch die Funktionen <code><a href="#disp">disp</a></code>, <code><a href="#display">display</a></code> und <code><a href="#ldisplay">ldisplay</a></code>.
</p>
<div class="example">
<pre class="example">(%i1) e: (a+b)^3;
                                   3
(%o1)                       (b + a)
</pre><pre class="example">(%i2) f: expand (e);
                     3        2      2      3
(%o2)               b  + 3 a b  + 3 a  b + a
(%i3) ldisp (e, f);
                                   3
(%t3)                       (b + a)

                     3        2      2      3
(%t4)               b  + 3 a b  + 3 a  b + a

(%o4)                      [%t3, %t4]
(%i4) %t3;
                                   3
(%o4)                       (b + a)
(%i5) %t4;
                     3        2      2      3
(%o5)               b  + 3 a b  + 3 a  b + a
</pre></div>
</dd></dl>

<a name="ldisplay"></a><a name="Item_003a-Command_002ede_002fdeffn_002fldisplay"></a><dl>
<dt><a name="index-ldisplay"></a>Funktion: <strong>ldisplay</strong> <em>(<var>expr_1</var>, &hellip;, <var>expr_n</var>)</em></dt>
<dd>
<p>Die Ausdr&uuml;cke <var>expr_1</var>, &hellip;, <var>expr_n</var> werden als eine Gleichung
der Form <code>lhs = rhs</code> ausgegeben.  <code>lhs</code> ist eines der Argumente der
Funktion <code>ldisplay</code> und <code>rhs</code> ist der Wert oder das Ergebnis des
Argumentes.  Im Unterschied zur Funktion <code>display</code> wird jeder Gleichung
eine Zwischenmarke zugewiesen, die als Liste zur&uuml;ckgegeben werden.
</p>
<p>Siehe auch <code><a href="#display">display</a></code>, <code><a href="#disp">disp</a></code> und <code><a href="#ldisp">ldisp</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) e: (a+b)^3;
                                   3
(%o1)                       (b + a)
(%i2) f: expand (e);
                     3        2      2      3
(%o2)               b  + 3 a b  + 3 a  b + a
(%i3) ldisplay (e, f);
                                     3
(%t3)                     e = (b + a)

                       3        2      2      3
(%t4)             f = b  + 3 a b  + 3 a  b + a

(%o4)                      [%t3, %t4]
(%i4) %t3;
                                     3
(%o4)                     e = (b + a)
(%i5) %t4;
                       3        2      2      3
(%o5)             f = b  + 3 a b  + 3 a  b + a
</pre></div>
</dd></dl>

<a name="leftjust"></a><a name="Item_003a-Command_002ede_002fdefvr_002fleftjust"></a><dl>
<dt><a name="index-leftjust"></a>Optionsvariable: <strong>leftjust</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>leftjust</code> den Wert <code>true</code>, werden Formeln
linksb&uuml;ndig und nicht zentriert ausgegeben.
</p>
<p>Siehe auch die Optionsvariable <code><a href="#display2d">display2d</a></code>, um zwischen der 
1D- und 2D-Anzeige umzuschalten.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) expand((x+1)^3);
                        3      2
(%o1)                  x  + 3 x  + 3 x + 1
(%i2) leftjust:true$
(%i3) expand((x+1)^3);
       3      2
(%o3) x  + 3 x  + 3 x + 1
</pre></div>
</dd></dl>

<a name="linel"></a><a name="Item_003a-Command_002ede_002fdefvr_002flinel"></a><dl>
<dt><a name="index-linel"></a>Optionsvariable: <strong>linel</strong></dt>
<dd><p>Standardwert: <code>79</code>
</p>
<p>Die Optionsvariable <code>linel</code> enth&auml;lt die Anzahl der Zeichen einer Zeile
der Ausgabe.  <code>linel</code> k&ouml;nnen beliebige positive ganze Zahlen zugewiesen
werden, wobei sehr kleine oder gro&szlig;e Werte unpraktisch sein k&ouml;nnen.  Text,
der von internen Funktionen ausgegeben wird, wie Fehlermeldungen oder Ausgaben
der Hilfe, werden von <code>linel</code> nicht beeinflusst.
</p></dd></dl>

<a name="lispdisp"></a><a name="Item_003a-Command_002ede_002fdefvr_002flispdisp"></a><dl>
<dt><a name="index-lispdisp"></a>Optionsvariable: <strong>lispdisp</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>lispdisp</code> den Wert <code>true</code>, werden 
Lisp-Symbole mit einem vorangestelltem Fragezeichen <code>?</code> angezeigt.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) lispdisp: false$
(%i2) ?foo + ?bar;
(%o2)                       foo + bar
(%i3) lispdisp: true$
(%i4) ?foo + ?bar;
(%o4)                      ?foo + ?bar
</pre></div>
</dd></dl>

<a name="negsumdispflag"></a><a name="Item_003a-Command_002ede_002fdefvr_002fnegsumdispflag"></a><dl>
<dt><a name="index-negsumdispflag"></a>Optionsvariable: <strong>negsumdispflag</strong></dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat <code>negsumdispflag</code> den Wert <code>true</code>, wird eine Differenz mit zwei
Argumenten <code>x - y</code> als <code>x - y</code> und nicht als <code>-y + x</code> angezeigt.
Hat <code>negsumdispflag</code> den Wert <code>false</code>, wird die Differenz als
<code>-y + x</code> angezeigt.
</p></dd></dl>

<a name="obase"></a><a name="Item_003a-Command_002ede_002fdefvr_002fobase"></a><dl>
<dt><a name="index-obase"></a>Optionsvariable: <strong>obase</strong></dt>
<dd><p>Standardwert: <code>10</code>
</p>
<p><code>obase</code> enth&auml;lt die Basis f&uuml;r ganze Zahlen f&uuml;r die Ausgabe von
Maxima.  <code>obase</code> kann eine ganze Zahl zwischen 2 und einschlie&szlig;lich 36
zugewiesen werden.  Ist <code>obase</code> gr&ouml;&szlig;er als 10, werden die Zahlen 0 
bis 9 und die Buchstaben A, B, C, &hellip; f&uuml;r die Darstellung der Zahl in der 
Basis <code>obase</code> herangezogen.  Gro&szlig;e und kleine Buchstaben werden nicht 
unterschieden.  Die erste Stelle ist immer eine Ziffer.
</p>
<p>Siehe auch <code><a href="#ibase">ibase</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) obase : 2;
(%o1)                          10
(%i2) 2^8 - 1;
(%o10)                      11111111
(%i3) obase : 8;
(%o3)                          10
(%i4) 8^8 - 1;
(%o4)                       77777777
(%i5) obase : 16;
(%o5)                          10
(%i6) 16^8 - 1;
(%o6)                       0FFFFFFFF
(%i7) obase : 36;
(%o7)                          10
(%i8) 36^8 - 1;
(%o8)                       0ZZZZZZZZ
</pre></div>
</dd></dl>

<a name="pfeformat"></a><a name="Item_003a-Command_002ede_002fdefvr_002fpfeformat"></a><dl>
<dt><a name="index-pfeformat"></a>Optionsvariable: <strong>pfeformat</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>pfeformat</code> den Wert <code>true</code>, werden Br&uuml;che
mit ganzen Zahlen auf einer Zeile mit dem Zeichen <code>/</code> dargestellt.  Ist
der Nenner eine ganze Zahl, wird dieser als <code>1/n</code> vor den Ausdruck 
gestellt.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) pfeformat: false$
(%i2) 2^16/7^3;
                              65536
(%o2)                         -----
                               343
(%i3) (a+b)/8;
                              b + a
(%o3)                         -----
                                8
(%i4) pfeformat: true$ 
(%i5) 2^16/7^3;
(%o5)                       65536/343
(%i6) (a+b)/8;
(%o6)                      1/8 (b + a)
</pre></div>
</dd></dl>

<a name="powerdisp"></a><a name="Item_003a-Command_002ede_002fdefvr_002fpowerdisp"></a><dl>
<dt><a name="index-powerdisp"></a>Optionsvariable: <strong>powerdisp</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat <code>powerdisp</code> den Wert <code>true</code>, werden die Terme einer Summe mit
steigender Potenz angezeigt.  Der Standardwert ist <code>false</code> und die Terme
werden mit fallender Potenz angezeigt.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) powerdisp:true;
(%o1)                         true
(%i2) x^2+x^3+x^4;
                           2    3    4
(%o2)                     x  + x  + x
(%i3) powerdisp:false;
(%o3)                         false
(%i4) x^2+x^3+x^4;
                           4    3    2
(%o4)                     x  + x  + x
</pre></div>
</dd></dl>

<a name="print"></a><a name="Item_003a-Command_002ede_002fdeffn_002fprint"></a><dl>
<dt><a name="index-print"></a>Funktion: <strong>print</strong> <em>(<var>expr_1</var>, &hellip;, <var>expr_n</var>)</em></dt>
<dd>
<p>Wertet die Argumente <var>expr_1</var>, &hellip;, <var>expr_n</var> nacheinander von links 
nach rechts aus und zeigt die Ergebnisse an.  <code>print</code> gibt das Ergebnis des 
letzten Arguments als Ergebnis zur&uuml;ck.  <code>print</code> erzeugt keine 
Zwischenmarken.
</p>
<p>Siehe auch <code><a href="#display">display</a></code>, <code><a href="#disp">disp</a></code>, <code><a href="#ldisplay">ldisplay</a></code> und 
<code><a href="#ldisp">ldisp</a></code>.  Siehe <code><a href="maxima_76.html#printfile">printfile</a></code>, um den Inhalt einer Datei 
anzuzeigen.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) r: print (&quot;(a+b)^3 is&quot;, expand ((a+b)^3), &quot;log (a^10/b) is&quot;,
      radcan (log (a^10/b)))$
            3        2      2      3
(a+b)^3 is b  + 3 a b  + 3 a  b + a  log (a^10/b) is 

                                              10 log(a) - log(b) 
(%i2) r;
(%o2)                  10 log(a) - log(b)
(%i3) disp (&quot;(a+b)^3 is&quot;, expand ((a+b)^3), &quot;log (a^10/b) is&quot;,
      radcan (log (a^10/b)))$
                           (a+b)^3 is
</pre><pre class="example">
                     3        2      2      3
                    b  + 3 a b  + 3 a  b + a
</pre><pre class="example">
                         log (a^10/b) is

                       10 log(a) - log(b)
</pre></div>
</dd></dl>

<a name="sqrtdispflag"></a><a name="Item_003a-Command_002ede_002fdefvr_002fsqrtdispflag"></a><dl>
<dt><a name="index-sqrtdispflag"></a>Optionsvariable: <strong>sqrtdispflag</strong></dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat die Optionsvariable den Wert <code>false</code>, wird die Wurzelfunktion als
Exponentiation mit dem Exponenten <code>1/2</code> angezeigt.
</p></dd></dl>

<a name="stardisp"></a><a name="Item_003a-Command_002ede_002fdefvr_002fstardisp"></a><dl>
<dt><a name="index-stardisp"></a>Optionsvariable: <strong>stardisp</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>stardisp</code> den Wert <code>true</code>, wird die 
Multiplikation mit einem Stern <code>*</code> angezeigt.
</p></dd></dl>

<a name="ttyoff"></a><a name="Item_003a-Command_002ede_002fdefvr_002fttyoff"></a><dl>
<dt><a name="index-ttyoff"></a>Optionsvariable: <strong>ttyoff</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p> 
<p>Hat die Optionsvariable <code>ttyoff</code> den Wert <code>true</code>, werden Ergebnisse
nicht angezeigt.  Die Ergebnisse werden weiter berechnet und sie werden 
Marken zugewiesen.  Siehe <code><a href="maxima_9.html#labels">labels</a></code>.
</p>
<p>Textausgaben von Funktionen, wie Fehlermeldungen und Ausgaben der Hilfe mit
<code><a href="maxima_6.html#describe">describe</a></code> werden nicht beeinflusst.
</p></dd></dl>



<hr>
<div class="header">
<p>
Previous: <a href="maxima_9.html#Funktionen-und-Variablen-der-Eingabe" accesskey="p" rel="previous">Funktionen und Variablen der Eingabe</a>, Nach oben: <a href="maxima_7.html#Kommandozeile" accesskey="u" rel="up">Kommandozeile</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Inhaltsverzeichnis" rel="contents">Inhalt</a>][<a href="maxima_334.html#Index-der-Variablen-und-Funktionen" title="Index" rel="index">Index</a>]</p>
</div>



</body>
</html>
