<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 5.1, http://www.gnu.org/software/texinfo/ -->
<head>
<title>Maxima Manual: Funktionen und Variablen f&uuml;r Polynome</title>

<meta name="description" content="Maxima Manual: Funktionen und Variablen f&uuml;r Polynome">
<meta name="keywords" content="Maxima Manual: Funktionen und Variablen f&uuml;r Polynome">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="maxima_toc.html#Top" rel="start" title="Top">
<link href="maxima_334.html#Index-der-Variablen-und-Funktionen" rel="index" title="Index der Variablen und Funktionen">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="Inhaltsverzeichnis">
<link href="maxima_99.html#Polynome" rel="up" title="Polynome">
<link href="maxima_102.html#Gleichungen" rel="next" title="Gleichungen">
<link href="maxima_100.html#Einf_00fchrung-in-Polynome" rel="previous" title="Einf&uuml;hrung in Polynome">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
blockquote.smallquotation {font-size: smaller}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
div.indentedblock {margin-left: 3.2em}
div.lisp {margin-left: 3.2em}
div.smalldisplay {margin-left: 3.2em}
div.smallexample {margin-left: 3.2em}
div.smallindentedblock {margin-left: 3.2em; font-size: smaller}
div.smalllisp {margin-left: 3.2em}
kbd {font-style:oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: inherit; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: inherit; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.nocodebreak {white-space:nowrap}
span.nolinebreak {white-space:nowrap}
span.roman {font-family:serif; font-weight:normal}
span.sansserif {font-family:sans-serif; font-weight:normal}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="../figures/favicon.ico">

</head>

<body lang="de" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">
<a name="Funktionen-und-Variablen-f_00fcr-Polynome"></a>
<div class="header">
<p>
Previous: <a href="maxima_100.html#Einf_00fchrung-in-Polynome" accesskey="p" rel="previous">Einf&uuml;hrung in Polynome</a>, Nach oben: <a href="maxima_99.html#Polynome" accesskey="u" rel="up">Polynome</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Inhaltsverzeichnis" rel="contents">Inhalt</a>][<a href="maxima_334.html#Index-der-Variablen-und-Funktionen" title="Index" rel="index">Index</a>]</p>
</div>
<a name="Funktionen-und-Variablen-fur-Polynome"></a>
<h3 class="section">17.2 Funktionen und Variablen f&uuml;r Polynome</h3>

<a name="algebraic"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002falgebraic"></a><dl>
<dt><a name="index-algebraic"></a>Optionsvariable: <strong>algebraic</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>algebraic</code> den Wert <code>true</code>, wird beim
Umwandeln von Ausdr&uuml;cken in die CRE-Form und beim Rechnen mit Ausdr&uuml;cken
in einer CRE-Form der Ausdruck so vereinfacht, dass der Nenner frei von
algebraischen Zahlen (das sind Wurzeln von ganzen Zahlen) ist.
</p>
<p>Beispiele:
</p>
<p>Im zweiten Beispiel wird der Ausdruck automatisch mit <code>sqrt(2)</code> erweitert,
um den Nenner frei von der algebraischen Zahl <code>sqrt(2)</code> zu machen.
</p>
<div class="example">
<pre class="example">(%i1) algebraic:false;
(%o1)                         false
(%i2) rat(x^2+x)/sqrt(2);
                              2
                             x  + x
(%o2)/R/                     -------
                             sqrt(2)
(%i3) algebraic:true;
(%o3)                         true
(%i4) rat(x^2+x)/sqrt(2);
                              2
                     sqrt(2) x  + sqrt(2) x
(%o4)/R/             ----------------------
                               2
</pre></div>
</dd></dl>

<a name="berlefact"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fberlefact"></a><dl>
<dt><a name="index-berlefact"></a>Optionsvariable: <strong>berlefact</strong></dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat die Optionsvariable <code>berlefact</code> den Wert <code>false</code>, dann wird der
Kronecker-Algorithmus von der Funktion <code><a href="#factor">factor</a></code> f&uuml;r die
Faktorisierung genutzt.  Ansonsten wird der Berlekamp-Algorithmus genutzt.  Der
Standardwert ist <code>true</code>.
</p></dd></dl>

<a name="bezout"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fbezout"></a><dl>
<dt><a name="index-bezout"></a>Funktion: <strong>bezout</strong> <em>(<var>p1</var>, <var>p2</var>, <var>x</var>)</em></dt>
<dd>
<p>Die R&uuml;ckgabe ist die Sylvestermatrix der zwei Polynome <var>p1</var> und <var>p2</var>
mit der unabh&auml;ngigen Variablen <var>x</var>.  Die Determinante der Sylvestermatrix
ist die Resultante der Polynome.  Die Resultante kann auch sofort mit der
Funktion <code><a href="#resultant">resultant</a></code> berechnet werden.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) bezout(a*x+b, c*x^2+d, x);
                         [ b c  - a d ]
(%o1)                    [            ]
                         [  a     b   ]
(%i2) determinant(%);
                            2      2
(%o2)                      a  d + b  c
(%i3) resultant(a*x+b, c*x^2+d, x);
                            2      2
(%o3)                      a  d + b  c
</pre></div>
</dd></dl>

<a name="bothcoef"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fbothcoef"></a><dl>
<dt><a name="index-bothcoef"></a>Funktion: <strong>bothcoef</strong> <em>(<var>expr</var>, <var>x</var>)</em></dt>
<dd>
<p>Gibt eine Liste zur&uuml;ck, deren erstes Element der Koeffizient der Variablen
<var>x</var> im Ausdruck <var>expr</var> und deren zweites Element der verbleibende
Teil des Ausdrucks <var>expr</var> ist.  Das Ergebnis ist also <code>[A,B]</code> und es
gilt <code><var>expr</var> = A * <var>x</var> + B</code>.
</p>
<p>Die Funktion <code>bothcoef</code> hat den Alias-Namen <code>bothcoeff</code>.
</p>
<p>Siehe auch die Funktion <code><a href="#coeff">coeff</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) bothcoeff(a*x+2, x);
(%o1)                        [a, 2]
(%i2) bothcoeff(x^2+a*x+2, x);
                                2
(%o2)                      [a, x  + 2]
</pre></div>

<p>Definition einer Funktion <code>islinear</code>, die die Funktion <code>bothcoeff</code>
nutzt, um den linearen Anteil eines Ausdrucks zu ermitteln.
</p>
<div class="example">
<pre class="example">(%i1) islinear (expr, x) := 
         block ([c],
            c: bothcoef (rat (expr, x), x),
            is (freeof (x, c) and c[1] # 0))$
(%i2) islinear ((r^2 - (x - r)^2)/x, x);
(%o2)                         true
</pre></div>
</dd></dl>

<a name="coeff"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fcoeff"></a><dl>
<dt><a name="index-coeff"></a>Funktion: <strong>coeff</strong> <em>(<var>expr</var>, <var>x</var>, <var>n</var>)</em></dt>
<dt><a name="index-coeff-1"></a>Funktion: <strong>coeff</strong> <em>(<var>expr</var>, <var>x</var>)</em></dt>
<dd>
<p>Gibt den Koeffizienten von <code><var>x</var>^<var>n</var></code> des Ausdrucks <var>expr</var>
zur&uuml;ck.  Das Argument <var>expr</var> ist ein Polynom in der Variablen <var>x</var>.
</p>
<p>Das Kommando <code>coeff(<var>expr</var>, <var>x</var>^<var>n</var>)</code> ist &auml;quivalent zu
<code>coeff(<var>expr</var>, <var>x</var>, <var>n</var>)</code>.  Das Kommando
<code>coeff(<var>expr</var>, <var>x</var>, 0)</code> gibt den Teil des Ausdrucks <var>expr</var>
zur&uuml;ck, der frei von der Variablen <var>x</var> ist.  Wenn nicht angegeben, wird
das Argument <var>n</var> als <code>1</code> angenommen.
</p>
<p>Das Argument <var>x</var> kann auch eine indizierte Variable oder ein Teilausdruck
von <var>expr</var> sein.
</p>
<p><code>coeff</code> wendet weder die Funktion <code>expand</code> noch die Funktion 
<code>factor</code> an, um einen Ausdruck zu expandieren oder zu faktorisieren.  Daher
kann es zu anderen Ergebnissen kommen, wenn zuvor diese Funktionen angewendet 
werden.
</p>
<p>Wird <code>coeff</code> auf Listen, Matrizen oder Gleichungen angewendet, wird die
Funktion auf die Elemente oder beide Seiten der Gleichung angewendet.
</p>
<p>Siehe auch die Funktion <code><a href="#bothcoef">bothcoef</a></code>.
</p>
<p>Beispiele:
</p>
<p><code>coeff</code> gibt den Koeffizienten von <code><var>x</var>^<var>n</var></code> des Ausdrucks
<var>expr</var> zur&uuml;ck.
</p>
<div class="example">
<pre class="example">(%i1) coeff(b^3*a^3 + b^2*a^2 + b*a + 1, a^3);
                                3
(%o1)                          b
</pre></div>

<p><code>coeff(<var>expr</var>, <var>x</var>^<var>n</var>)</code> ist &auml;quivalent zu
<code>coeff(<var>expr</var>, <var>x</var>, <var>n</var>)</code>.
</p>
<div class="example">
<pre class="example">(%i1) coeff(c[4]*z^4 - c[3]*z^3 - c[2]*z^2 + c[1]*z, z, 3);
(%o1)                         - c
                                 3
(%i2) coeff(c[4]*z^4 - c[3]*z^3 - c[2]*z^2 + c[1]*z, z^3);
(%o2)                         - c
                                 3
</pre></div>

<p><code>coeff(<var>expr</var>, <var>x</var>, 0)</code> gibt den Teil des Ausdrucks <var>expr</var>
zur&uuml;ck, der frei von der Variablen <var>x</var> ist.
</p>
<div class="example">
<pre class="example">(%i1) coeff(a*u + b^2*u^2 + c^3*u^3, b, 0);
                            3  3
(%o1)                      c  u  + a u
</pre></div>

<p><var>x</var> kann eine einfache Variable, eine indizierte Variable oder ein 
Teilausdruck des Ausdrucks <var>expr</var> sein.
</p>
<div class="example">
<pre class="example">(%i1) coeff(h^4 - 2*%pi*h^2 + 1, h, 2);
(%o1)                        - 2 %pi
(%i2) coeff(v[1]^4 - 2*%pi*v[1]^2 + 1, v[1], 2);
(%o2)                        - 2 %pi
(%i3) coeff (sin(1+x)*sin(x) + sin(1+x)^3*sin(x)^3, sin(1+x)^3);
                                3
(%o3)                        sin (x)
(%i4) coeff((d - a)^2*(b + c)^3 + (a + b)^4*(c - d), a + b, 4);
(%o4)                         c - d
</pre></div>

<p><code>coeff</code> wendet die Funktionen <code>expand</code> und <code>factor</code> nicht an.
</p>
<div class="example">
<pre class="example">(%i1) coeff(c*(a + b)^3, a);
(%o1)                           0
(%i2) expand(c*(a + b)^3);
                 3          2        2        3
(%o2)           b  c + 3 a b  c + 3 a  b c + a  c
(%i3) coeff(%, a);
                                2
(%o3)                        3 b  c
(%i4) coeff(b^3*c + 3*a*b^2*c + 3*a^2*b*c + a^3*c, (a + b)^3);
(%o4)                           0
(%i5) factor(b^3*c + 3*a*b^2*c + 3*a^2*b*c + a^3*c);
                                  3
(%o5)                      (b + a)  c
(%i6) coeff(%, (a + b)^3);
(%o6)                           c
</pre></div>

<p><code>coeff</code> wird bei Listen und Matrizen auf die Elemente und bei Gleichungen
auf die beiden Seiten angewendet.
</p>
<div class="example">
<pre class="example">(%i1) coeff([4*a, -3*a, 2*a], a);
(%o1)                      [4, - 3, 2]
(%i2) coeff(matrix ([a*x, b*x], [-c*x, -d*x]), x);
                          [  a    b  ]
(%o2)                     [          ]
                          [ - c  - d ]
(%i3) coeff(a*u - b*v = 7*u + 3*v, u);
(%o3)                         a = 7
</pre></div>

<p>Die folgende Definition der Funktion <code>coeff_list</code> liefert eine Liste mit
den Koeffizienten, die in einem Polynom auftreten.  Neben der Funktion
<code>coeff</code> kommt hier die Funktion <code><a href="#hipow">hipow</a></code> zum Einsatz, um den h&ouml;chsten
Exponenten zu ermitteln. <code><a href="#rat">rat</a></code> und <code><a href="#ratdisrep">ratdisrep</a></code> werden verwendet, 
um das Polynom zwischenzeitlich in die kanonische Form (CRE) zu bringen.
</p>
<div class="example">
<pre class="example">(%i1) b : (x-y)^2;
                                       2
(%o1)                           (x - y)
(%i2) coeff_list(a, x) := (
   a : rat(a),
   reverse( makelist(ratdisrep(coeff(a, x, i)), i,0, hipow(a, x)) ))$

(%i3) coeff_list(b, x);
                                         2
(%o3)                        [1, - 2 y, y ]
</pre></div>
</dd></dl>

<a name="content"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fcontent"></a><dl>
<dt><a name="index-content"></a>Funktion: <strong>content</strong> <em>(<var>p</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</em></dt>
<dd>
<p>Gibt eine Liste zur&uuml;ck, deren erstes Element der gr&ouml;&szlig;te gemeinsame 
Teiler der Koeffizienten des Polynoms <var>p</var> in der Variablen <var>x_n</var> ist 
und dessen zweites Element das durch den gr&ouml;&szlig;ten gemeinsamen Teiler 
dividierte Polynom ist.  Die anderen Argumente <var>x_1</var>, &hellip;, <var>x_n-1</var>
haben dieselbe Bedeutung wie f&uuml;r die Funktion <code><a href="#ratvars">ratvars</a></code>.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) content(2*x*y + 4*x^2*y^2, y);
                                   2
(%o1)                   [2 x, 2 x y  + y]
</pre></div>
</dd></dl>

<a name="denom"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fdenom"></a><dl>
<dt><a name="index-denom"></a>Funktion: <strong>denom</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Gibt den Nenner des Ausdrucks <var>expr</var> zur&uuml;ck, wenn dieser ein
Quotient ist.  Ist der Ausdruck <var>expr</var> kein Quotient wird <var>expr</var>
zur&uuml;ckgegeben.
</p>
<p>Die Funktion <code>denom</code> wertet das Argument aus.  Siehe auch die Funktion
<code><a href="#num">num</a></code>.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) denom(x^2/(x+1));
(%o1)                         x + 1
</pre></div>
</dd></dl>

<a name="divide"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fdivide"></a><dl>
<dt><a name="index-divide"></a>Funktion: <strong>divide</strong> <em>(<var>p_1</var>, <var>p_2</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</em></dt>
<dd>
<p>Berechnet den Quotienten und den Rest der Division des Polynom <var>p_1</var> durch
das Polynom <var>p_2</var> f&uuml;r die Variable <var>x_n</var>.  Die anderen Argumente
<var>x_1</var>, &hellip;, <var>x_n-1</var> haben dieselbe Bedeutung wie f&uuml;r die Funktion
<code><a href="#ratvars">ratvars</a></code>.  Das Ergebnis ist eine Liste, wobei das erste Element der
Quotient und das zweite Element der Rest ist.
</p>
<p>Die Argumente der Funktion <code>divide</code> k&ouml;nnen auch ganze Zahlen sein.
</p>
<p>Siehe auch die Funktionen <code><a href="#quotient">quotient</a></code> und <code><a href="#remainder">remainder</a></code>, die jeweils
den Quotienten und den Rest der Polynomdivision zur&uuml;ckgegeben.
</p>
<p>Beispiele:
</p>
<p>Im zweiten Beispiel ist <code>y</code> die Hauptvariable des Ausdrucks.
</p>
<div class="example">
<pre class="example">(%i1) divide (x + y, x - y, x);
(%o1)                       [1, 2 y]
(%i2) divide (x + y, x - y);
(%o2)                      [- 1, 2 x]
</pre></div>

<p>Ein Beispiel f&uuml;r zwei Polynome in zwei Variablen.
</p>
<div class="example">
<pre class="example">(%i1) poly1 : sum(x^k*y^(6-k), k, 1, 5);
                  5    2  4    3  3    4  2    5
(%o1)          x y  + x  y  + x  y  + x  y  + x  y
(%i2) poly2 : sum(2*k*x^k*y^(3-k), k, 1, 3);
                          2      2        3
(%o2)                2 x y  + 4 x  y + 6 x
(%i3) divide(poly1, poly2, x);
              3        2      2          5       2  4
           4 y  + 3 x y  + 9 x  y  23 x y  + 16 x  y
(%o3)     [----------------------, ------------------]
                     54                    27
(%i4) expand(first(%)*poly2 + second(%));
                  5    2  4    3  3    4  2    5
(%o4)          x y  + x  y  + x  y  + x  y  + x  y
</pre></div>
</dd></dl>

<a name="dontfactor"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fdontfactor"></a><dl>
<dt><a name="index-dontfactor"></a>Optionsvariable: <strong>dontfactor</strong></dt>
<dd><p>Standardwert: <code>[]</code>
</p>
<p>Der Optionsvariablen <code>dontfactor</code> kann eine Liste mit den Variablen
zugewiesen werden, bez&uuml;glich der ein Ausdruck nicht faktorisiert werden soll.
Weiterhin wird nicht bez&uuml;glich von Variablen faktorisiert, die gem&auml;&szlig;
der kanonischen Ordnung der Variablen von geringerer Bedeutung sind als die
Variablen in der Liste <code>dontfactor</code>.
</p>
<p>Beispiel:
</p>
<p>Im zweiten Fall wird das Polynom nicht bez&uuml;glich der Variablen <var>x</var>
faktorisiert.
</p>
<div class="example">
<pre class="example">(%i1) expr:expand((x+1)^3*(y+2)^2);
       3  2      2  2        2    2      3         2
(%o1) x  y  + 3 x  y  + 3 x y  + y  + 4 x  y + 12 x  y + 12 x y
                                             3       2
                                  + 4 y + 4 x  + 12 x  + 12 x + 4
(%i2) factor(expr);
                               3        2
(%o2)                   (x + 1)  (y + 2)
(%i3) dontfactor:[x];
(%o3)                          [x]
(%i4) factor(expr);
                   3      2                   2
(%o4)            (x  + 3 x  + 3 x + 1) (y + 2)
</pre></div>
</dd></dl>

<a name="eliminate"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002feliminate"></a><dl>
<dt><a name="index-eliminate"></a>Funktion: <strong>eliminate</strong> <em>([<var>eqn_1</var>, &hellip;, <var>eqn_n</var>], [<var>x_1</var>, &hellip;, <var>x_k</var>])</em></dt>
<dd>
<p>Wendet ein Subresultanten-Verfahren an, um die Variablen <var>x_1</var>, &hellip;, 
<var>x_k</var> aus den Gleichungen <var>eqn_1</var>, &hellip;, <var>eqn_n</var> zu eliminieren.
Die R&uuml;ckgabe ist ein Gleichungssystem mit <code><var>n</var> - <var>k</var></code>
Gleichungen, wobei die <var>k</var>-Variablen <var>x_1</var>, &hellip;, <var>x_k</var>
eliminiert sind.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) eqn1: 2*x^2 + y*x + z;
                                      2
(%o1)                    z + x y + 2 x
(%i2) eqn2: 3*x + 5*y - z - 1;
(%o2)                  - z + 5 y + 3 x - 1
(%i3) eqn3: z^2 + x - y^2 + 5;
                          2    2
(%o3)                    z  - y  + x + 5
(%i4) eliminate([eqn1, eqn2, eqn3], [y,z]);
              2      4      3       2
(%o4)       [x  (45 x  + 3 x  + 11 x  + 81 x + 124)]
</pre></div>
</dd></dl>

<a name="ezgcd"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fezgcd"></a><dl>
<dt><a name="index-ezgcd"></a>Funktion: <strong>ezgcd</strong> <em>(<var>p_1</var>, <var>p_2</var>, <var>p_3</var>, &hellip;)</em></dt>
<dd>
<p>Gibt eine Liste zur&uuml;ck, deren erstes Element der gr&ouml;&szlig;te gemeinsame
Teiler der Polynome <var>p_1</var>, &hellip;, <var>p_n</var> ist und deren weitere Elemente
die durch den gr&ouml;&szlig;ten gemeinsamen Teiler dividierten Polynome sind.  Der
gr&ouml;&szlig;te gemeinsame Teiler wird immer mit dem <code>ezgcd</code>-Algorithmus 
bestimmt.
</p>
<p>Siehe auch die Funktionen <code><a href="#gcd">gcd</a></code>, <code><a href="#gcdex">gcdex</a></code> <code><a href="maxima_301.html#gcdivide">gcdivide</a></code> und
<code><a href="maxima_250.html#poly_005fgcd">poly_gcd</a></code>.
</p>
<p>Beispiel:
</p>
<p>Die drei Polynome haben den gr&ouml;&szlig;ten gemeinsamen Teiler <code>2*x-3</code>.
Der gr&ouml;&szlig;te gemeinsame Teiler wird zuerst mit der Funktion <code>gcd</code>
berechnet.  Dann wird das Ergebnis der Funktion <code>ezgcd</code> gezeigt.
</p>
<div class="example">
<pre class="example">(%i1) p1 : 6*x^3-17*x^2+14*x-3;
                        3       2
(%o1)                6 x  - 17 x  + 14 x - 3
(%i2) p2 : 4*x^4-14*x^3+12*x^2+2*x-3;
</pre><pre class="example">                    4       3       2
(%o2)            4 x  - 14 x  + 12 x  + 2 x - 3
</pre><pre class="example">(%i3) p3 : -8*x^3+14*x^2-x-3;
                          3       2
(%o3)                - 8 x  + 14 x  - x - 3

(%i4) gcd(p1, gcd(p2, p3));
(%o4)                        2 x - 3

(%i5) ezgcd(p1, p2, p3);
                   2               3      2           2
(%o5) [2 x - 3, 3 x  - 4 x + 1, 2 x  - 4 x  + 1, - 4 x  + x + 1]
</pre></div>
</dd></dl>

<a name="facexpand"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002ffacexpand"></a><dl>
<dt><a name="index-facexpand"></a>Optionsvariable: <strong>facexpand</strong></dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Die Optionsvariable <code>facexpand</code> kontrolliert, ob die irreduziblen Faktoren
der Faktorisierung mit <code><a href="#factor">factor</a></code> in einer expandierten oder in einer
rekursiven (CRE-Form) vorliegen.  Der Standard ist, dass die Faktoren expandiert
werden.
</p></dd></dl>

<a name="factor"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002ffactor"></a><dl>
<dt><a name="index-factor"></a>Funktion: <strong>factor</strong> <em>(<var>expr</var>)</em></dt>
<dt><a name="index-factor-1"></a>Funktion: <strong>factor</strong> <em>(<var>expr</var>, <var>p</var>)</em></dt>
<dd>

<p>Faktorisiert den Ausdruck <var>expr</var>, der eine beliebige Zahl an Variablen 
oder Funktionen enthalten kann, in irreduzible Faktoren &uuml;ber die ganzen 
Zahlen.  <code>factor(<var>expr</var>, <var>p</var></code> faktorisiert <var>expr</var> &uuml;ber den 
K&ouml;rper der rationalen Zahlen, der um die Nullstellen des minimalen Polynoms
<var>p</var> erweitert ist.
</p>

<p><code>factor</code> ruft die Funktion <code><a href="maxima_132.html#ifactors">ifactors</a></code> auf, um ganze Zahlen zu 
faktorisieren.
</p>

<p>Hat die Optionsvariable <code><a href="#factorflag">factorflag</a></code> den Wert <code>false</code>, wird die
Faktorisierung von ganzen Zahlen unterdr&uuml;ckt, die im Nenner einer rationalen
Funktion auftreten.
</p>

<p>Der Optionsvariablen <code><a href="#dontfactor">dontfactor</a></code> kann eine Liste mit den Variablen
zugewiesen werden, bez&uuml;glich der ein Ausdruck nicht faktorisiert werden soll.
Weiterhin wird nicht bez&uuml;glich von Variablen faktorisiert, die gem&auml;&szlig;
der kanonischen Ordnung der Variablen von geringerer Bedeutung sind als die
Variablen in der Liste <code>dontfactor</code>.
</p>

<p>Hat die Optionsvariable <code><a href="#savefactors">savefactors</a></code> den Wert <code>true</code>, versuchen
einige Funktionen bei der Vereinfachung eine bereits vorhandene Faktorisierung
zu erhalten, um weitere Vereinfachungen zu beschleunigen.
</p>

<p>Hat die Optionsvariable <code><a href="#berlefact">berlefact</a></code> den Wert <code>false</code>, dann wird der
Kronecker-Algorithmus f&uuml;r die Faktorisierung genutzt.  Ansonsten wird
der Berlekamp-Algorithmus genutzt.  Der Standardwert ist <code>true</code>.
</p>

<p>Hat die Optionsvariable <code><a href="#intfaclim">intfaclim</a></code> den Wert <code>true</code>, gibt Maxima
die Faktorisierung von ganzen Zahlen auf, wenn keine Faktorisierung durch
Anwendung der Methode der Probedivision und der Pollard-Rho-Methode gefunden
werden konnten.  Hat <code>intfaclim</code> den Wert <code>false</code>, versucht Maxima
eine ganze Zahl vollst&auml;ndig zu faktorisieren.  Der Wert der Optionsvariablen
<code>intfaclim</code> wird von der Funktion <code>factor</code> beachtet.  Mit dem Setzen
von <code>intfaclim</code> kann der Nutzer verhindern, dass Maxima beim Versuch sehr
gro&szlig;e ganze Zahlen zu faktorisieren, unn&ouml;tig viel Zeit verbraucht.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) factor (2^63 - 1);
                    2
(%o1)              7  73 127 337 92737 649657
(%i2) factor (-8*y - 4*x + z^2*(2*y + x));
(%o2)               (2 y + x) (z - 2) (z + 2)
(%i3) -1 - 2*x - x^2 + y^2 + 2*x*y^2 + x^2*y^2;
                2  2        2    2    2
(%o3)          x  y  + 2 x y  + y  - x  - 2 x - 1
(%i4) block ([dontfactor: [x]], factor (%/36/(1 + 2*y + y^2)));
                       2
                     (x  + 2 x + 1) (y - 1)
(%o4)                ----------------------
                           36 (y + 1)
(%i5) factor (1 + %e^(3*x));
                      x         2 x     x
(%o5)              (%e  + 1) (%e    - %e  + 1)
(%i6) factor (1 + x^4, a^2 - 2);
                    2              2
(%o6)             (x  - a x + 1) (x  + a x + 1)
(%i7) factor (-y^2*z^2 - x*z^2 + x^2*y^2 + x^3);
                       2
(%o7)              - (y  + x) (z - x) (z + x)
(%i8) (2 + x)/(3 + x)/(b + x)/(c + x)^2;
                             x + 2
(%o8)               ------------------------
                                           2
                    (x + 3) (x + b) (x + c)
(%i9) ratsimp (%);
</pre><pre class="example">                4                  3
(%o9) (x + 2)/(x  + (2 c + b + 3) x

     2                       2             2                   2
 + (c  + (2 b + 6) c + 3 b) x  + ((b + 3) c  + 6 b c) x + 3 b c )
</pre><pre class="example">(%i10) partfrac (%, x);
           2                   4                3
(%o10) - (c  - 4 c - b + 6)/((c  + (- 2 b - 6) c

     2              2         2                2
 + (b  + 12 b + 9) c  + (- 6 b  - 18 b) c + 9 b ) (x + c))

                 c - 2
 - ---------------------------------
     2                             2
   (c  + (- b - 3) c + 3 b) (x + c)

</pre><pre class="example">                         b - 2
 + -------------------------------------------------
             2             2       3      2
   ((b - 3) c  + (6 b - 2 b ) c + b  - 3 b ) (x + b)
</pre><pre class="example">
                         1
 - ----------------------------------------------
             2
   ((b - 3) c  + (18 - 6 b) c + 9 b - 27) (x + 3)
(%i11) map ('factor, %);
              2
             c  - 4 c - b + 6                 c - 2
(%o11) - ------------------------- - ------------------------
                2        2                                  2
         (c - 3)  (c - b)  (x + c)   (c - 3) (c - b) (x + c)

                       b - 2                        1
            + ------------------------ - ------------------------
                             2                          2
              (b - 3) (c - b)  (x + b)   (b - 3) (c - 3)  (x + 3)
(%i12) ratsimp ((x^5 - 1)/(x - 1));
                       4    3    2
(%o12)                x  + x  + x  + x + 1
(%i13) subst (a, x, %);
                       4    3    2
(%o13)                a  + a  + a  + a + 1
(%i14) factor (%th(2), %);
                       2        3        3    2
(%o14)   (x - a) (x - a ) (x - a ) (x + a  + a  + a + 1)
(%i15) factor (1 + x^12);
                       4        8    4
(%o15)               (x  + 1) (x  - x  + 1)
(%i16) factor (1 + x^99);
                 2            6    3
(%o16) (x + 1) (x  - x + 1) (x  - x  + 1)

   10    9    8    7    6    5    4    3    2
 (x   - x  + x  - x  + x  - x  + x  - x  + x  - x + 1)

   20    19    17    16    14    13    11    10    9    7    6
 (x   + x   - x   - x   + x   + x   - x   - x   - x  + x  + x

    4    3            60    57    51    48    42    39    33
 - x  - x  + x + 1) (x   + x   - x   - x   + x   + x   - x

    30    27    21    18    12    9    3
 - x   - x   + x   + x   - x   - x  + x  + 1)
</pre></div>

<p>Das Polynom <code>x^4+1</code> l&auml;sst sich nicht &uuml;ber den K&ouml;rper der ganzen
Zahlen faktorisieren.  Wird der K&ouml;rper um das minimale Polynom <code>a^2+1</code>
erweitert, ist die Faktorisierung m&ouml;glich.  Die Nullstellen des minimalen
Polynoms sind die imagin&auml;re Einheit <code>%i</code> und <code>-%i</code>.  Das Ergebnis
entspricht der Faktorisierung mit der Funktion <code><a href="#gfactor">gfactor</a></code>.
</p>
<div class="example">
<pre class="example">(%i1) factor(x^4+1);
                              4
(%o1)                        x  + 1
(%i2) factor(x^4+1, a^2+1);
                          2        2
(%o2)                   (x  - a) (x  + a)
(%i3) gfactor(x^4+1);
                         2         2
(%o3)                  (x  - %i) (x  + %i)
</pre></div>
</dd></dl>

<a name="factorflag"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002ffactorflag"></a><dl>
<dt><a name="index-factorflag"></a>Optionsvariable: <strong>factorflag</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>factorflag</code> den Wert <code>false</code>, wird die
Faktorisierung von ganzen Zahlen unterdr&uuml;ckt, die im Nenner einer rationalen
Funktion auftreten.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) factorflag:false;
(%o1)                         false
(%i2) factor(1/6*(x^2+2*x+1));
</pre><pre class="example">                                   2
                            (x + 1)
(%o2)                       --------
                               6
</pre><pre class="example">(%i3) factorflag:true;
(%o3)                         true
(%i4) factor(1/6*(x^2+2*x+1));
                                   2
                            (x + 1)
(%o4)                       --------
                              2 3
</pre></div>
</dd></dl>

<a name="factorout"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002ffactorout"></a><dl>
<dt><a name="index-factorout"></a>Funktion: <strong>factorout</strong> <em>(<var>expr</var>, <var>x_1</var>, <var>x_2</var>, &hellip;)</em></dt>
<dd>

<p>Gruppiert eine Summe <var>expr</var> in eine Summe mit Termen der Form
<code>f(<var>x_1</var>, <var>x_2</var>, ...) * g</code>, wobei <code>g</code> ein gemeinsamer Faktor
des Polynoms <code>f</code> ist.
</p>
<p>Beispiele:
</p>
<p>Das Polynom wird zuerst nach der Variablen <var>x</var>, dann nach <var>y</var> und 
zuletzt nach beiden Variablen faktorisiert.
</p>
<div class="example">
<pre class="example">(%i1) factorout(2*a*x^2+a*x+a+a*y, x);
                                 2
(%o1)                a y + a (2 x  + x + 1)
(%i2) factorout(2*a*x^2+a*x+a+a*y, y);
                                     2
(%o2)               a (y + 1) + 2 a x  + a x
(%i3) factorout(2*a*x^2+a*x+a+a*y, y, x);
                                2
(%o3)                 a (y + 2 x  + x + 1)
</pre></div>
</dd></dl>

<a name="factorsum"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002ffactorsum"></a><dl>
<dt><a name="index-factorsum"></a>Funktion: <strong>factorsum</strong> <em>(<var>expr</var>)</em></dt>
<dd>

<p>Versucht Terme in <var>expr</var> so zu gruppieren, dass die Teilsummen
faktorisierbar sind.  <code>factorsum</code> kann zum Beispiel das expandierte
Polynom <code>expand ((x + y)^2 + (z + w)^2)</code> wieder herstellen, nicht jedoch
das expandierte Polynom <code>expand ((x + 1)^2 + (x + y)^2)</code>, da die Terme
gemeinsame Variablen enthalten.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) expand ((x + 1)*((u + v)^2 + a*(w + z)^2));
           2      2                            2      2
(%o1) a x z  + a z  + 2 a w x z + 2 a w z + a w  x + v  x

                                     2        2    2            2
                        + 2 u v x + u  x + a w  + v  + 2 u v + u
(%i2) factorsum(%);
                                   2          2
(%o2)            (x + 1) (a (z + w)  + (v + u) )
</pre></div>
</dd></dl>

<a name="fasttimes"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002ffasttimes"></a><dl>
<dt><a name="index-fasttimes"></a>Funktion: <strong>fasttimes</strong> <em>(<var>p_1</var>, <var>p_2</var>)</em></dt>
<dd>

<p>F&uuml;hrt eine schnelle Multiplikation der Polynome <var>p_1</var> und <var>p_2</var> aus
und gibt das Ergebnis zur&uuml;ck.  Der Algorithmus ist von Vorteil, wenn die
Polynome mehrere Variablen haben und die Koeffizienten dicht besetzt sind.
Sind <code>n_1</code> und <code>n_2</code> jeweils der Grad der Polynome <var>p_1</var> und
<var>p_2</var>, dann ben&ouml;tigt die schnelle Multiplikation
<code>max(n_1, n_2)^1.585</code> Multiplikationen.
</p></dd></dl>

<a name="fullratsimp"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002ffullratsimp"></a><dl>
<dt><a name="index-fullratsimp"></a>Funktion: <strong>fullratsimp</strong> <em>(<var>expr</var>)</em></dt>
<dt><a name="index-fullratsimp-1"></a>Funktion: <strong>fullratsimp</strong> <em>(<var>expr</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</em></dt>
<dd>



<p>Die Funktion <code>fullratsimp</code> wendet die Funktion <code><a href="#ratsimp">ratsimp</a></code> auf das
Argument <var>expr</var> solange wiederholt an, bis sich das Ergebnis nicht mehr
&auml;ndert.  Nach jeder Anwendung von <code>ratsimp</code> wird der Ausdruck
zus&auml;tzlich vereinfacht.
</p>
<p>Sind nicht-rationale Ausdr&uuml;cke in einem Ausdruck enthalten, kann der Ausdruck
m&ouml;glicherweise mit einem Aufruf von <code>ratsimp</code> nicht vollst&auml;ndig
vereinfacht werden.  Dann kann der mehrfache Aufruf von <code>ratsimp</code> zu einem
besser vereinfachten Resultat f&uuml;hren.  Die Funktion <code>fullratsimp</code> ist
f&uuml;r solche Falle gedacht.
</p>
<p>Die weiteren Argumente <var>x_1</var>, &hellip;, <var>x_n</var> entsprechen denen der
Funktionen <code>ratsimp</code> und <code><a href="#rat">rat</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) expr: (x^(a/2) + 1)^2*(x^(a/2) - 1)^2/(x^a - 1);
                       a/2     2   a/2     2
                     (x    - 1)  (x    + 1)
(%o1)                -----------------------
                              a
                             x  - 1
(%i2) ratsimp (expr);
                          2 a      a
                         x    - 2 x  + 1
(%o2)                    ---------------
                              a
                             x  - 1
(%i3) fullratsimp (expr);
                              a
(%o3)                        x  - 1
(%i4) rat (expr);
</pre><pre class="example">                       a/2 4       a/2 2
                     (x   )  - 2 (x   )  + 1
(%o4)/R/             -----------------------
                              a
                             x  - 1
</pre></div>
</dd></dl>


<a name="fullratsubst"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002ffullratsubst"></a><dl>
<dt><a name="index-fullratsubst"></a>Funktion: <strong>fullratsubst</strong> <em>(<var>a</var>, <var>b</var>, <var>c</var>)</em></dt>
<dd>



<p>Entspricht der Funktion <code><a href="#ratsubst">ratsubst</a></code> mit dem Unterschied, dass die Funktion
solange rekursiv ausgef&uuml;hrt wird, bis sich das Ergebnis nicht mehr &auml;ndert.
Diese Funktion kann n&uuml;tzlich sein, wenn der Ausdruck, der eingesetzt wird,
und der zu ersetzende Ausdruck mehrere Variablen gemeinsam haben.
</p>
<p><code>fullratsubst</code> akzeptiert auch Argumente im Format der Funktion
<code><a href="#lratsubst">lratsubst</a></code>.  Das erste Argument kann also auch eine einzelne oder eine
Liste von Gleichungen sein.  Das zweite Argument ist in diesem Fall der
Ausdruck in dem die Ersetzungen durchgef&uuml;hrt werden.
</p>
<p>Mit dem Kommando <code>load(&quot;lrats&quot;)</code> werden die Funktionen <code>fullratsubst</code>
und <code>lratsubst</code> geladen.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;lrats&quot;)$
</pre></div>


<p><code><a href="maxima_32.html#subst">subst</a></code> kann mehrfache Substitutionen ausf&uuml;hren.  Die Funktion
<code>lratsubst</code> funktioniert analog zu der Funktion <code>subst</code>.
</p>
<div class="example">
<pre class="example">(%i2) subst ([a = b, c = d], a + c);
(%o2)                         d + b
(%i3) lratsubst ([a^2 = b, c^2 = d], (a + e)*c*(a + c));
(%o3)                (d + a c) e + a d + b c
</pre></div>


<p>Ist nur eine Substitution auszuf&uuml;hren, kann diese als eine einzelne Gleichung
angegeben werden.
</p>
<div class="example">
<pre class="example">(%i4) lratsubst (a^2 = b, a^3);
(%o4)                          a b
</pre></div>


<p><code>fullratsubst</code> ist &auml;quivalent zur Funktion <code>ratsubst</code> mit dem
Unterschied, dass die Funktion solange rekursiv angewendet wird, bis sich das
Ergebnis nicht mehr &auml;ndert.
</p>
<div class="example">
<pre class="example">(%i5) ratsubst (b*a, a^2, a^3);
                               2
(%o5)                         a  b
(%i6) fullratsubst (b*a, a^2, a^3);
</pre><pre class="example">                                 2
(%o6)                         a b
</pre></div>


<p><code>fullratsubst</code> akzeptiert auch eine Liste mit Gleichungen oder eine
Gleichung als erstes Argument.
</p>
<div class="example">
<pre class="example">(%i7) fullratsubst ([a^2 = b, b^2 = c, c^2 = a], a^3*b*c);
(%o7)                           b
(%i8) fullratsubst (a^2 = b*a, a^3);
                                 2
(%o8)                         a b
</pre></div>


<p><code>fullratsubst</code> kann zu einer unendlichen Rekursion f&uuml;hren.
</p>
<div class="example">
<pre class="example">(%i9) errcatch (fullratsubst (b*a^2, a^2, a^3));

*** - Lisp stack overflow. RESET
</pre></div>
</dd></dl>

<a name="gcd"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fgcd"></a><dl>
<dt><a name="index-gcd"></a>Funktion: <strong>gcd</strong> <em>(<var>p_1</var>, <var>p_2</var>, <var>x_1</var>, &hellip;)</em></dt>
<dt><a name="index-gcd-1"></a>Optionsvariable: <strong>gcd</strong></dt>
<dd>

<p>Gibt den gr&ouml;&szlig;ten gemeinsamen Teiler der Polynome <var>p_1</var> und <var>p_2</var>
zur&uuml;ck.  Die Argumente <var>x_1</var>, &hellip; sind optional und haben dieselbe
Bedeutung wie f&uuml;r die Funktion <code><a href="#ratvars">ratvars</a></code>.  Die Optionsvariable 
<code>gcd</code> kontrolliert, welcher Algorithmus verwendet wird und kann die
folgenden Werte annehmen:
</p>
<dl compact="compact">
<dt><code>ez</code></dt>
<dd><p>ezgcd-Alogrithmus
</p></dd>
<dt><code>subres</code></dt>
<dd><p>Subresultanten-Algorithmus
</p></dd>
<dt><code>red</code></dt>
<dd><p>Reduzierter modularer Algorithmus
</p></dd>
<dt><code>spmod</code></dt>
<dd><p>Modularer Algorithmus
</p></dd>
<dt><code>false</code></dt>
<dd><p>kein Algorithmus, die R&uuml;ckgabe ist immer 1
</p></dd>
</dl>


<p>Siehe auch die <code><a href="#ezgcd">ezgcd</a></code>, <code><a href="#gcdex">gcdex</a></code>, <code><a href="maxima_301.html#gcdivide">gcdivide</a></code>, und
<code><a href="maxima_250.html#poly_005fgcd">poly_gcd</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) p1:6*x^3+19*x^2+19*x+6; 
                        3       2
(%o1)                6 x  + 19 x  + 19 x + 6
(%i2) p2:6*x^5+13*x^4+12*x^3+13*x^2+6*x;
                  5       4       3       2
(%o2)          6 x  + 13 x  + 12 x  + 13 x  + 6 x
(%i3) gcd(p1, p2);
                            2
(%o3)                    6 x  + 13 x + 6
(%i4) p1/gcd(p1, p2), ratsimp;
(%o4)                         x + 1
(%i5) p2/gcd(p1, p2), ratsimp;
                              3
(%o5)                        x  + x
</pre></div>


<p>Die Funktion <code><a href="#ezgcd">ezgcd</a></code> gibt als Ergebnis eine Liste zur&uuml;ck, die als erstes
Element den gr&ouml;&szlig;ten gemeinsamen Teiler und als weitere Elemente die durch
den gr&ouml;&szlig;ten gemeinsamen Teiler dividierten Polynome enth&auml;lt.
</p>
<div class="example">
<pre class="example">(%i6) ezgcd(p1, p2);
                    2                     3
(%o6)           [6 x  + 13 x + 6, x + 1, x  + x]
</pre></div>
</dd></dl>

<a name="gcdex"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fgcdex"></a><dl>
<dt><a name="index-gcdex"></a>Funktion: <strong>gcdex</strong> <em>(<var>p_1</var>, <var>p_2</var>)</em></dt>
<dt><a name="index-gcdex-1"></a>Funktion: <strong>gcdex</strong> <em>(<var>p_1</var>, <var>p_2</var>, <var>x</var>)</em></dt>
<dd>

<p>Wendet den erweiterten Euklidischen Algorithmus f&uuml;r die beiden Polynome
<var>p_1</var> und <var>p_2</var> an und gibt eine Liste <code>[s, t, u]</code> mit den
Parametern <var>u</var>, <var>s</var> und <var>t</var> als Ergebnis zur&uuml;ck.  Der Parameter
<var>u</var> ist der gr&ouml;&szlig;te gemeinsame Teiler der Polynome.  Die Parameter
<var>s</var> und <var>t</var> sind die Bezoutkoeffizienten, so dass gilt
<code>u = s * p_1 + t * p_2</code>.
</p>
<p>Die R&uuml;ckgabe der Funktion <code>gcdex</code> ist in der CRE-Form.
</p>

<p>Siehe auch die Funktionen <code><a href="#ezgcd">ezgcd</a></code>, <code><a href="#gcd">gcd</a></code> und <code><a href="maxima_301.html#gcdivide">gcdivide</a></code>.
</p>
<p>Die Argumente <var>f</var> und <var>g</var> k&ouml;nnen ganze Zahlen sein.  In diesem Falle
wird die Funktion <code><a href="maxima_132.html#igcdex">igcdex</a></code> von der Funktion <code>gcdex</code> aufgerufen.
</p>
<p>Siehe auch die Funktionen <code><a href="#ezgcd">ezgcd</a></code>, <code><a href="#gcd">gcd</a></code>,<!-- /@w -->
<code><a href="maxima_301.html#gcdivide">gcdivide</a></code> und <code><a href="maxima_250.html#poly_005fgcd">poly_gcd</a></code>.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) gcdex (x^2 + 1, x^3 + 4);
                       2
                      x  + 4 x - 1  x + 4
(%o1)/R/           [- ------------, -----, 1]
                           17        17
(%i2) % . [x^2 + 1, x^3 + 4, -1];
(%o2)/R/                        0
</pre></div>

<p>Im folgenden Beispiel ist die unabh&auml;ngige Variable explizit als <var>x</var>
angegeben.  Ohne diese Angabe ist <var>y</var> die unabh&auml;ngige Variable.
</p>
<div class="example">
<pre class="example">(%i1) gcdex (x*(y + 1), y^2 - 1, x);
                               1
(%o1)/R/                 [0, ------, 1]
                              2
                             y  - 1
</pre></div>
</dd></dl>


<a name="gcfactor"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fgcfactor"></a><dl>
<dt><a name="index-gcfactor"></a>Funktion: <strong>gcfactor</strong> <em>(<var>g</var>)</em></dt>
<dd>

<p>Faktorisiert die Gau&szlig;sche Zahl <var>g</var> &uuml;ber die Gau&szlig;sche Zahlen.  Eine
Gau&szlig;sche Zahl <code>g</code> ist durch <code>g = a + b*%i</code> gegeben, wobei <code>a</code>
und <code>b</code> ganze Zahlen sind.  Die Faktoren werden so normalisiert, dass
<var>a</var> und <var>b</var> nicht negativ sind.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) gcfactor(5);
(%o1)               - %i (1 + 2 %i) (2 + %i)
(%i2) expand(%);
(%o2)                           5
(%i3) gcfactor(5+%i);
(%o3)               - %i (1 + %i) (2 + 3 %i)
(%i4) expand(%);
(%o4)                        %i + 5
</pre></div>
</dd></dl>


<a name="gfactor"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fgfactor"></a><dl>
<dt><a name="index-gfactor"></a>Funktion: <strong>gfactor</strong> <em>(<var>expr</var>)</em></dt>
<dd>

<p>Faktorisiert das Polynom <var>expr</var> &uuml;ber die Gau&szlig;schen Zahlen.  Das ist
die Faktorisierung &uuml;ber den K&ouml;rper der ganzen Zahlen, der um das Element
<var>%i</var> erweitert ist.
</p>
<p>Die Faktorisierung der Funktion <code>gfactor</code> ist &auml;quivalent zu
<code>factor(<var>expr</var>), <var>a</var>^2+1)</code> mit dem minimalen Polynom
<code><var>a</var>^2+1</code>, das die Nullstelle <code>%i</code> hat.  Siehe auch
<code><a href="#factor">factor</a></code>.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) gfactor(x^4 - 1);
(%o1)           (x - 1) (x + 1) (x - %i) (x + %i)
(%i2) factor(x^4 - 1, a^2+1);
(%o2)            (x - 1) (x + 1) (x - a) (x + a)
</pre></div>
</dd></dl>


<a name="gfactorsum"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fgfactorsum"></a><dl>
<dt><a name="index-gfactorsum"></a>Funktion: <strong>gfactorsum</strong> <em>(<var>expr</var>)</em></dt>
<dd>

<p>Entspricht der Funktion <code><a href="#factorsum">factorsum</a></code> mit den Unterschied, dass anstatt der
Funktion <code><a href="#factor">factor</a></code> die Funktion <code><a href="#gfactor">gfactor</a></code> angewendet wird, um den
Ausdruck <var>expr</var> zu faktorisieren.
</p></dd></dl>

<a name="hipow"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fhipow"></a><dl>
<dt><a name="index-hipow"></a>Funktion: <strong>hipow</strong> <em>(<var>expr</var>, <var>x</var>)</em></dt>
<dd>
<p>Gibt den gr&ouml;&szlig;ten Exponenten des Arguments <var>x</var> zur&uuml;ck, der im
Ausdruck <var>expr</var> auftritt.  Treten symbolische Exponenten auf, wird ein
Ausdruck mit <code>max</code> zur&uuml;ckgegeben.  Ist das Argument <var>x</var> nicht im
Ausdruck vorhanden, ist die R&uuml;ckgabe <code>0</code>.
</p>
<p>Die Funktion <code>hipow</code> betrachtet keine &auml;quivalenten Ausdr&uuml;cke.  Daher
k&ouml;nnen die Ausdr&uuml;cke <code>expand(<var>expr</var>)</code> und <var>expr</var> ein
verschiedenes Ergebnis haben.
</p>
<p>Siehe auch die Funktionen <code><a href="#lopow">lopow</a></code> und <code><a href="#coeff">coeff</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) hipow (y^3 * x^2 + x * y^4, x);
(%o1)                           2
(%i2) hipow ((x + y)^5, x);
(%o2)                           1
(%i3) hipow (expand ((x + y)^5), x);
(%o3)                           5
(%i4) hipow ((x + y)^5, x + y);
(%o4)                           5
(%i5) hipow (expand ((x + y)^5), x + y);
(%o5)                           0
(%i1) hipow ((x+y)^2 + (x+y)^a, x+y);
(%o1)                       max(2, a)
</pre></div>
</dd></dl>


<a name="intfaclim"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fintfaclim"></a><dl>
<dt><a name="index-intfaclim"></a>Optionsvariable: <strong>intfaclim</strong></dt>
<dd><p>Standardwert: <code>true</code>
</p>



<p>Hat die Optionsvariable <code><a href="#intfaclim">intfaclim</a></code> den Wert <code>true</code>, gibt Maxima
die Faktorisierung von ganzen Zahlen auf, wenn keine Faktorisierung durch
Anwendung der Methode der Probedivision und der Pollard-Rho-Methode gefunden
werden konnten.
</p>
<p>Hat <code>intfaclim</code> den Wert <code>false</code>, versucht Maxima eine ganze Zahl
vollst&auml;ndig zu faktorisieren.  <code>intfaclim</code> wird von den Funktionen
<code><a href="maxima_81.html#divisors">divisors</a></code>, <code><a href="maxima_132.html#divsum">divsum</a></code> und <code><a href="maxima_132.html#totient">totient</a></code> auf den Wert <code>false</code>
gesetzt.
</p>
<p>Der Wert der Optionsvariablen <code>intfaclim</code> wird von der Funktion
<code>factor</code> beachtet.  Mit dem Setzen von <code>intfaclim</code> kann der Nutzer
verhindern, dass Maxima beim Versuch sehr gro&szlig;e ganze Zahlen zu
faktorisieren, unn&ouml;tig viel Zeit verbraucht.
</p>
</dd></dl>

<a name="keepfloat"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fkeepfloat"></a><dl>
<dt><a name="index-keepfloat"></a>Optionsvariable: <strong>keepfloat</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>


<p>Hat die Optionsvariable <code>keepfloat</code> den Wert <code>true</code>, werden
Gleitkommazahlen nicht in rationale Zahlen umgewandelt, wenn Ausdr&uuml;cke mit
Gleitkommazahlen in eine CRE-Form umgewandelt werden.
</p>
<p>Die Funktion <code><a href="maxima_103.html#solve">solve</a></code> und Funktionen, die <code>solve</code> aufrufen, beachten
den Wert von <code>keepfloat</code> nicht.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) rat(x/2.0);

rat: replaced 0.5 by 1/2 = 0.5
                                x
(%o1)/R/                        -
                                2
(%i2) rat(x/2.0), keepfloat;
(%o2)/R/                      0.5 x
</pre></div>


<p>Die Funktion <code>solve</code> ignoriert den Wert der Optionsvariablen
<code>keepfloat</code>.
</p>
<div class="example">
<pre class="example">(%i3) solve(1.0-x,x), keepfloat;

rat: replaced 1.0 by 1/1 = 1.0
(%o3)                        [x = 1]
</pre></div>
</dd></dl>

<a name="lopow"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002flopow"></a><dl>
<dt><a name="index-lopow"></a>Funktion: <strong>lopow</strong> <em>(<var>expr</var>, <var>x</var>)</em></dt>
<dd>

<p>Gibt den kleinsten Exponenten von <var>x</var> zur&uuml;ck, der im Ausdruck <var>expr</var>
auftritt.  Treten symbolische Exponententen auf, wird ein Ausdruck mit 
<code>min</code> zur&uuml;ckgegeben.  Ist das Argument <var>x</var> nicht im
Ausdruck enthalten, ist die R&uuml;ckgabe 0.
</p>
<p>Die Funktion <code>lopow</code> betrachtet keine &auml;quivalenten Ausdr&uuml;cke.  Daher
k&ouml;nnen die Ausdr&uuml;cke <code>expand(<var>expr</var>)</code> und <var>expr</var> ein
verschiedenes Ergebnis haben.
</p>
<p>Siehe auch die Funktionen <code><a href="#hipow">hipow</a></code> und <code><a href="#coeff">coeff</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) lopow ((x+y)^2 + (x+y)^a, x+y);
(%o1)                       min(a, 2)
</pre></div>
</dd></dl>


<a name="lratsubst"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002flratsubst"></a><dl>
<dt><a name="index-lratsubst"></a>Funktion: <strong>lratsubst</strong> <em>(<var>L</var>, <var>expr</var>)</em></dt>
<dd>

<p>Ist analog zum Kommando <code>subst (<var>L</var>, <var>expr</var>)</code> mit dem Unterschied,
dass anstatt der Funktion <code><a href="maxima_32.html#subst">subst</a></code> die Funktion <code><a href="#ratsubst">ratsubst</a></code> genutzt
wird.
</p>


<p>Das erste Argument der Funktion <code>lratsubst</code> ist eine Gleichung oder eine
Liste mit Gleichungen, die dem Format der Funktion <code>subst</code> entsprechen.
Die Substitutionen werden in der Reihenfolge der Gleichungen der Liste von links
nach rechts ausgef&uuml;hrt.
</p>
<p>Mit dem Kommando <code>lrats</code> werden die Funktionen <code>fullratsubst</code> und
<code>lratsubst</code> geladen.  Siehe auch die Funktion <code><a href="#fullratsubst">fullratsubst</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;lrats&quot;)$
</pre></div>


<p><code>subst</code> kann mehrfache Substitutionen ausf&uuml;hren.  <code>lratsubst</code> ist
analog zu <code>subst</code>.
</p>
<div class="example">
<pre class="example">(%i2) subst ([a = b, c = d], a + c);
(%o2)                         d + b
(%i3) lratsubst ([a^2 = b, c^2 = d], (a + e)*c*(a + c));
(%o3)                (d + a c) e + a d + b c
</pre></div>


<p>Soll nur eine Substitution ausgef&uuml;hrt werden, kann eine einzelne Gleichung
als erstes Argument angegeben werden.
</p>
<div class="example">
<pre class="example">(%i4) lratsubst (a^2 = b, a^3);
(%o4)                          a b
</pre></div>
</dd></dl>

<a name="modulus"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fmodulus"></a><dl>
<dt><a name="index-modulus"></a>Optionsvariable: <strong>modulus</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>

<p>Hat die Optionsvariable <code>modulus</code> eine positive Zahl <var>p</var> als Wert,
werden Operationen f&uuml;r rationale Zahlen, wie von der Funktion <code><a href="#rat">rat</a></code> und
verwandte Funktionen, modulo <var>p</var> ausgef&uuml;hrt.
</p>
<p><code><var>n</var></code> mod <var>p</var> ist definiert als eine ganze Zahl, die f&uuml;r ungerade
<var>p</var> die Werte <code>[-(<var>p</var>-1)/2, ..., 0, ..., (<var>p</var>-1)/2]</code> annimmt
und f&uuml;r gerade <var>p</var> die Werte <code>[-(<var>p</var>/2 - 1), ..., 0, ....,
<var>p</var>/2]</code>, so dass  <code><var>a</var> <var>p</var> + <var>k</var></code> gleich <var>n</var> ist f&uuml;r
eine ganze Zahl <var>a</var>.
</p>

<p>Liegt ein Ausdruck <var>expr</var> bereits in einer CRE-Form vor und wird der Wert
der Optionsvariable <code>modulus</code> ge&auml;ndert, dann sollte der Ausdruck zum
Beispiel mit dem Kommando <code>expr: rat (ratdisrep (expr))</code> zun&auml;chst in die
Standardform gebracht werden, um dann erneut in die CRE-Form umgewandelt zu
werden, um korrekte Ergebnisse zu erzielen.
</p>

<p>Typischerweise erh&auml;lt die Optionsvariable <code>modulus</code> eine Primzahl als
Wert.  Erh&auml;lt <code>modulus</code> eine positive ganze Zahl als Wert, die nicht eine
Primzahl ist, wird die Zuweisung akzeptiert, jedoch eine Warnung ausgegeben.
Wird Null oder eine negative Zahl zugewiesen signalisiert Maxima einen Fehler.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) modulus:7;
(%o1)                           7
(%i2) polymod([0,1,2,3,4,5,6,7]);
(%o2)            [0, 1, 2, 3, - 3, - 2, - 1, 0]
(%i3) modulus:false;
(%o3)                         false
(%i4) poly:x^6+x^2+1;
                            6    2
(%o4)                      x  + x  + 1
(%i5) factor(poly);
                            6    2
(%o5)                      x  + x  + 1
(%i6) modulus:13;
(%o6)                          13
(%i7) factor(poly);
</pre><pre class="example">                      2        4      2
(%o7)               (x  + 6) (x  - 6 x  - 2)
</pre><pre class="example">(%i8) polymod(%);
                            6    2
(%o8)                      x  + x  + 1
</pre></div>
</dd></dl>


<a name="num"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fnum"></a><dl>
<dt><a name="index-num"></a>Funktion: <strong>num</strong> <em>(<var>expr</var>)</em></dt>
<dd>


<p>Gibt den Z&auml;hler des Ausdrucks <var>expr</var> zur&uuml;ck, wenn dieser ein
Quotient ist.  Ist der Ausdruck <var>expr</var> kein Quotient wird <var>expr</var>
zur&uuml;ckgegeben.
</p>
<p>Die Funktion <code>num</code> wertet das Argument aus.  Siehe auch die Funktion
<code><a href="#denom">denom</a></code>.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) num(x^2/(x+1));
                                2
(%o1)                          x
</pre></div>
</dd></dl>

<a name="partfrac"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fpartfrac"></a><dl>
<dt><a name="index-partfrac"></a>Funktion: <strong>partfrac</strong> <em>(<var>expr</var>, <var>var</var>)</em></dt>
<dd>



<p>F&uuml;hrt f&uuml;r den Ausdruck <var>expr</var> eine vollst&auml;ndige Partialbruchzerlegung
aus.
</p>
<div class="example">
<pre class="example">(%i1) 1/(1+x)^2 - 2/(1+x) + 2/(2+x);
                      2       2        1
(%o1)               ----- - ----- + --------
                    x + 2   x + 1          2
                                    (x + 1)
(%i2) ratsimp (%);
                                 x
(%o2)                 - -------------------
                         3      2
                        x  + 4 x  + 5 x + 2
(%i3) partfrac (%, x);
                      2       2        1
(%o3)               ----- - ----- + --------
                    x + 2   x + 1          2
                                    (x + 1)
</pre></div>
</dd></dl>

<a name="polydecomp"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fpolydecomp"></a><dl>
<dt><a name="index-polydecomp"></a>Funktion: <strong>polydecomp</strong> <em>(<var>p</var>, <var>x</var>)</em></dt>
<dd>

<p>Zerlegt das Polynom <var>p</var> in der Variablen <var>x</var> in Polynome, die
miteinander verkettet das urspr&uuml;ngliche Polynom ergeben.  <code>polydecomp</code>
gibt eine Liste <code>[<var>p_1</var>, ..., <var>p_n</var>]</code> zur&uuml;ck, so dass der
folgende Ausdruck gleich dem Polynom <var>p</var> ist:
</p>
<div class="example">
<pre class="example">lambda ([x], p_1) (lambda ([x], p_2) (... (lambda ([x], p_n) (x))
  ...))
</pre></div>


<p>Der Grad des Polynoms <var>p_i</var> ist gr&ouml;&szlig;er als 1 f&uuml;r <var>i</var> kleiner
als <var>n</var>.
</p>

<p>Eine solche Zerlegung ist nicht eindeutig.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) polydecomp (x^210, x);
                          7   5   3   2
(%o1)                   [x , x , x , x ]
(%i2) p : expand (subst (x^3 - x - 1, x, x^2 - a));
                6      4      3    2
(%o2)          x  - 2 x  - 2 x  + x  + 2 x - a + 1
(%i3) polydecomp (p, x);
                        2       3
(%o3)                 [x  - a, x  - x - 1]
</pre></div>


<p>Die folgende Funktion verkettet die Elemente der Liste
<code>L = [e_1, ..., e_n]</code> zu einer Funktion in der Variablen <var>x</var>.  Diese
Funktion ist die Inverse Operation zu der Funktion <code>polydecomp</code>.
</p>
<div class="example">
<pre class="example">compose (L, x) :=
  block ([r : x], for e in L do r : subst (e, x, r), r) $
</pre></div>


<p>Anwendung der Funktionen <code>compose</code> und <code>polydecomp</code>.
</p>
<div class="example">
<pre class="example">(%i3) polydecomp (compose ([x^2 - a, x^3 - x - 1], x), x);
                        2       3
(%o3)                 [x  - a, x  - x - 1]
</pre></div>


<p>W&auml;hrend  <code>compose (polydecomp (<var>p</var>, <var>x</var>), <var>x</var>)</code> immer das
Polynom <var>p</var> als Ergebnis hat, hat <code>polydecomp (compose ([<var>p_1</var>,
..., <var>p_n</var>], <var>x</var>), <var>x</var>)</code> nicht notwendigerweise das Ergebnis
<code>[<var>p_1</var>, ..., <var>p_n</var>]</code>.
</p>
<div class="example">
<pre class="example">(%i4) polydecomp (compose ([x^2 + 2*x + 3, x^2], x), x);
                          2       2
(%o4)                   [x  + 2, x  + 1]
(%i5) polydecomp (compose ([x^2 + x + 1, x^2 + x + 1], x), x);
</pre><pre class="example">                      2       2
                     x  + 3  x  + 5
(%o5)               [------, ------, 2 x + 1]
                       4       2
</pre></div>
</dd></dl>

<a name="polymod"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fpolymod"></a><dl>
<dt><a name="index-polymod"></a>Funktion: <strong>polymod</strong> <em>(<var>p</var>)</em></dt>
<dt><a name="index-polymod-1"></a>Funktion: <strong>polymod</strong> <em>(<var>p</var>, <var>m</var>)</em></dt>
<dd>

<p>Konvertiert das Polynom <var>p</var> in eine modulare Darstellung bez&uuml;glich
dem aktuellen Modul.  Das Modul ist der Wert der Variablen <code>modulus</code>.
</p>

<p><code>polymod(<var>p</var>, <var>m</var></code> konvertiert das Polynom bez&uuml;glich dem Modul 
<var>m</var>, anstatt dem aktuellen Modul <code>modulus</code>.
</p>

<p>Siehe auch <code><a href="#modulus">modulus</a></code>.
</p></dd></dl>

<a name="powers"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fpowers"></a><dl>
<dt><a name="index-powers"></a>Funktion: <strong>powers</strong> <em>(<var>expr</var>, <var>x</var>)</em></dt>
<dd>

<p>Gibt eine Liste mit den Potenzen der Variablen <var>x</var> zur&uuml;ck, die im
Ausdruck <var>expr</var> auftreten.
</p>
<p>Mit dem Kommando <code>load(&quot;powers&quot;)</code> wird die Funktion geladen.
</p>

</dd></dl>

<a name="quotient"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fquotient"></a><dl>
<dt><a name="index-quotient"></a>Funktion: <strong>quotient</strong> <em>(<var>p_1</var>, <var>p_2</var>)</em></dt>
<dt><a name="index-quotient-1"></a>Funktion: <strong>quotient</strong> <em>(<var>p_1</var>, <var>p_2</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</em></dt>
<dd>
<p>Berechnet den Quotienten der Polynome <var>p_1</var> und <var>p_2</var> f&uuml;r die Variable
<var>x_n</var>.  Die anderen Variablen <var>x_1</var>, &hellip;, <var>x_n-1</var> haben dieselbe
Bedeutung wie f&uuml;r die Funktion <code><a href="#ratvars">ratvars</a></code>.
</p>
<p><code>quotient</code> gibt das erste Element des Ergebnisses der Funktion
<code><a href="#divide">divide</a></code> zur&uuml;ck.
</p>
<p>Siehe auch die Funktion <code><a href="#remainder">remainder</a></code>.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) poly1 : x^3-2*x^2-5*x+7;
                        3      2
(%o1)                  x  - 2 x  - 5 x + 7
(%i2) poly2 : x-1;
(%o2)                         x - 1
(%i3) quotient(poly1, poly2, x);
                            2
(%o3)                      x  - x - 6
</pre></div>
</dd></dl>


<a name="rat"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002frat"></a><dl>
<dt><a name="index-rat"></a>Funktion: <strong>rat</strong> <em>(<var>expr</var>)</em></dt>
<dt><a name="index-rat-1"></a>Funktion: <strong>rat</strong> <em>(<var>expr</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</em></dt>
<dd>

<p>Konvertiert einen Ausdruck <var>expr</var> in die CRE-Form.  Der Ausdruck wird so 
expandiert und gruppiert, dass alle Terme einen gemeinsamen Nenner haben und
der gr&ouml;&szlig;te gemeinsame Teiler gek&uuml;rzt ist.  Weiterhin werden
Gleitkommazahlen in rationale Zahlungen umgewandelt.  Die Toleranz der
Umwandlung wird von der Optionsvariablen <code><a href="maxima_14.html#ratepsilon">ratepsilon</a></code> kontrolliert.  Die
Variablen im Ausdruck werden entsprechend der Funktion <code><a href="#ratvars">ratvars</a></code><!-- /@w -->
gem&auml;&szlig; der angegebenen Argumente <var>x_1</var>, &hellip;, <var>x_n</var> angeordnet.
</p>

<p><code>rat</code> vereinfacht im Allgemeinen keine Ausdr&uuml;cke bis auf die Addition
<code>+</code>, Subtraktion <code>-</code>, Multiplikation <code>*</code>, Division <code>/</code>
und die Exponentiation <code>^</code> mit einer ganzen Zahl.  Dagegen f&uuml;hrt die
Funktion <code><a href="#ratsimp">ratsimp</a></code> auch weitere Vereinfachungen aus.  Variablen und Zahlen
in einer CRE-Form sind nicht identisch mit denen in der Standardform.  Zum
Beispiel hat <code>rat(x)- x</code> das Ergebnis <code>rat(0)</code>, welches eine 
andere interne Darstellung als <code>0</code> hat.
</p>



<p>Hat die Optionsvariable <code><a href="#ratfac">ratfac</a></code> den Wert <code>true</code>, wird ein Ausdruck
von der Funktion <code>rat</code> nur teilweise faktorisiert.  Bei der Ausf&uuml;hrung
von Operationen wird bleibt der Ausdruck so vollst&auml;ndig als m&ouml;glich in
seiner faktorisierten Form, ohne dass eine Faktorisierung ausgef&uuml;hrt wird.
Damit kann Rechenzeit eingespart werden.
</p>

<p>Hat die Optionsvariable <code><a href="#ratprint">ratprint</a></code> den Wert <code>false</code>, werden
Meldungen unterdr&uuml;ckt, wenn eine Gleitkommazahl in eine rationale
umgewandelt wird.
</p>

<p>Hat die Optionsvariable <code><a href="#keepfloat">keepfloat</a></code> den Wert <code>true</code>, werden
Gleitkommazahlen nicht in rationale Zahlen umgewandelt.
</p>

<p>Siehe auch die Funktionen <code><a href="#ratexpand">ratexpand</a></code> und <code><a href="#ratsimp">ratsimp</a></code>, um
Ausdr&uuml;cke zu vereinfachen, sowie die Funktion <code><a href="#ratdisrep">ratdisrep</a></code>, um einen
Ausdruck von einer CRE-Form in eine allgemeine Form zu transformieren.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) ((x - 2*y)^4/(x^2 - 4*y^2)^2 + 1)*(y + a)*(2*y + x) /
      (4*y^2 + x^2);
                                           4
                                  (x - 2 y)
              (y + a) (2 y + x) (------------ + 1)
                                   2      2 2
                                 (x  - 4 y )
(%o1)         ------------------------------------
                              2    2
                           4 y  + x
(%i2) rat (%, y, a, x);
</pre><pre class="example">                            2 a + 2 y
(%o2)/R/                    ---------
                             x + 2 y
</pre></div>
</dd></dl>

<a name="ratalgdenom"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fratalgdenom"></a><dl>
<dt><a name="index-ratalgdenom"></a>Optionsvariable: <strong>ratalgdenom</strong></dt>
<dd><p>Standardwert: <code>true</code>
</p>

<p>Hat die Optionsvariable <code>ratalgdenom</code> den Wert <code>true</code>, versucht
Maxima den Nenner beim Auftreten von Wurzeln rational zu machen.
<code>ratalgdenom</code> wirkt sich nur aus, wenn die Optionsvariable
<code><a href="#algebraic">algebraic</a></code> den Wert <code>true</code> hat und der Ausdruck in einer CRE-Form
vorliegt.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) algebraic:true$

(%i2) ratalgdenom:false$

(%i3) rat(sqrt(3)/sqrt(2));
                             sqrt(3)
(%o3)/R/                     -------
                             sqrt(2)
(%i4) ratalgdenom:true$

(%i5) rat(sqrt(3)/sqrt(2));
                         sqrt(2) sqrt(3)
(%o5)/R/                 ---------------
                                2
(%i6) algebraic:false$

(%i7) rat(sqrt(3)/sqrt(2));
                             sqrt(3)
(%o7)/R/                     -------
                             sqrt(2)
</pre></div>
</dd></dl>


<a name="ratcoef"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fratcoef"></a><dl>
<dt><a name="index-ratcoef"></a>Funktion: <strong>ratcoef</strong> <em>(<var>expr</var>, <var>x</var>, <var>n</var>)</em></dt>
<dt><a name="index-ratcoef-1"></a>Funktion: <strong>ratcoef</strong> <em>(<var>expr</var>, <var>x</var>)</em></dt>
<dd>

<p>Gibt den Koeffizienten des Ausdrucks <code><var>x</var>^<var>n</var></code> in dem Argument
<var>expr</var> zur&uuml;ck.  Wenn das Argument <var>n</var> nicht angegeben ist, wird
der Wert zu <code>1</code> angenommen.
</p>

<p>Die R&uuml;ckgabe ist frei von der Variablen <var>x</var>.  Existiert kein Koeffizient
<code><var>x</var>^<var>n</var></code> dann ist die R&uuml;ckgabe <code>0</code>.
</p>

<p><code>ratcoef</code> expandiert und vereinfacht das Argument <var>expr</var>.  Daher kann
<code>ratcoef</code> ein anderes Ergebnis als die Funktion <code><a href="#coeff">coeff</a></code> haben, die
keine Vereinfachungen ausf&uuml;hrt.  Daher <code>ratcoef((x + 1)/y + x, x)</code> das
Ergebnis <code>(y + 1)/y</code> und nicht das Ergebnis <code>1</code> wie es von der
Funktion <code>coeff</code> zur&uuml;ckgegeben wird.
</p>

<p><code>ratcoef(<var>expr</var>, <var>x</var>, 0)</code> gibt eine Summe der Terme zur&uuml;ck, die
die Variable <var>x</var> nicht enthalten.
</p>

<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) s: a*x + b*x + 5$
(%i2) ratcoef (s, a + b);
(%o2)                           x
</pre></div>
</dd></dl>

<a name="ratdenom"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fratdenom"></a><dl>
<dt><a name="index-ratdenom"></a>Funktion: <strong>ratdenom</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Gibt den Nenner des Argumentes <var>expr</var> zur&uuml;ck.  <code>ratdenom</code> wandelt
den Ausdruck zuerst in eine CRE-Form um und gibt das Ergebnis in einer 
CRE-Form zur&uuml;ck.
</p>
<p>Das Argument <var>expr</var> wird von der Funktion <code><a href="#rat">rat</a></code> in eine CRE-Form
gebracht, falls <var>expr</var> nicht bereits in einer CRE-Form vorliegt.  Diese
Transformation kann den Ausdruck <var>expr</var> ver&auml;ndern, da alle Terme &uuml;ber
einen gemeinsamen Nenner zusammengefasst werden.
</p>
<p>Die Funktion <code><a href="#denom">denom</a></code> ist vergleichbar.  <code>denom</code> wandelt den Ausdruck
jedoch nicht eine CRE-Form um und hat als Ergebnis einen Ausdruck in der
Standardform.  Daher k&ouml;nnen sich die Ergebnisse von <code>ratdenom</code> und 
<code>denom</code> voneinander unterscheiden.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) expr: expand((x^2+2*x+3)/(x-1));
</pre><pre class="example">                        2
                       x       2 x      3
(%o1)                 ----- + ----- + -----
                      x - 1   x - 1   x - 1
</pre><pre class="example">(%i2) ratdenom(expr);
(%o2)/R/                      x - 1
(%i3) denom(expr);
(%o3)                           1
</pre></div>
</dd></dl>

<a name="ratdenomdivide"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fratdenomdivide"></a><dl>
<dt><a name="index-ratdenomdivide"></a>Optionsvariable: <strong>ratdenomdivide</strong></dt>
<dd><p>Standardwert: <code>true</code>
</p>

<p>Hat die Optionsvariable <code>ratdenomdivide</code> den Wert <code>true</code>, expandiert
die Funktion <code><a href="#ratexpand">ratexpand</a></code> einen Quotienten der im Z&auml;hler eine Summe hat,
in eine Summe der Quotienten.  Ansonsten werden die Terme &uuml;ber einen
gemeinsamen Nenner zusammengefasst.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) expr: (x^2 + x + 1)/(y^2 + 7);
                            2
                           x  + x + 1
(%o1)                      ----------
                              2
                             y  + 7
(%i2) ratdenomdivide: true$
(%i3) ratexpand (expr);
                       2
                      x        x        1
(%o3)               ------ + ------ + ------
                     2        2        2
                    y  + 7   y  + 7   y  + 7
(%i4) ratdenomdivide: false$
(%i5) ratexpand (expr);
                            2
                           x  + x + 1
(%o5)                      ----------
                              2
                             y  + 7
(%i6) expr2: a^2/(b^2 + 3) + b/(b^2 + 3);
</pre><pre class="example">                                     2
                           b        a
(%o6)                    ------ + ------
                          2        2
                         b  + 3   b  + 3
</pre><pre class="example">(%i7) ratexpand (expr2);
                                  2
                             b + a
(%o7)                        ------
                              2
                             b  + 3
</pre></div>
</dd></dl>

<a name="ratdiff"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fratdiff"></a><dl>
<dt><a name="index-ratdiff"></a>Funktion: <strong>ratdiff</strong> <em>(<var>expr</var>, <var>x</var>)</em></dt>
<dd>

<p>Differenziert einen rationalen Ausdruck <var>expr</var> nach der Variablen <var>x</var>.
<var>expr</var> muss eine rationale Funktion oder ein Polynom in der Variablen
<var>x</var> sein.  Das Argument <var>x</var> kann ein Teilausdruck des Argumentes
<var>expr</var> sein.
</p>

<p>Das Ergebnis ist &auml;quivalent zum Ergebnis der Funktion <code><a href="maxima_90.html#diff">diff</a></code>,<!-- /@w -->
kann aber eine andere Form haben.  F&uuml;r rationale Funktionen kann die
Funktion <code>ratdiff</code> schneller sein.
</p>

<p><code>ratdiff</code> gibt das Ergebnis in einer CRE-Form zur&uuml;ck, wenn das Argument
in einer CRE-Form vorliegt.  Ansonsten ist das Ergebnis in der Standardform.
</p>

<p><code>ratdiff</code> beachtet nur die Abh&auml;ngigkeit des Ausdrucks von der Variablen
<var>x</var>.  Abh&auml;ngigkeiten die mit der Funktion <code><a href="maxima_90.html#depends">depends</a></code> definiert werden,
werden von der Funktion <code>ratdiff</code> ignoriert.
</p>

<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) expr: (4*x^3 + 10*x - 11)/(x^5 + 5);
                           3
                        4 x  + 10 x - 11
(%o1)                   ----------------
                              5
                             x  + 5
(%i2) ratdiff (expr, x);
                    7       5       4       2
                 8 x  + 40 x  - 55 x  - 60 x  - 50
(%o2)          - ---------------------------------
                          10       5
                         x   + 10 x  + 25
(%i3) expr: f(x)^3 - f(x)^2 + 7;
                         3       2
(%o3)                   f (x) - f (x) + 7
(%i4) ratdiff (expr, f(x));
                           2
(%o4)                   3 f (x) - 2 f(x)
(%i5) expr: (a + b)^3 + (a + b)^2;
                              3          2
(%o5)                  (b + a)  + (b + a)
(%i6) ratdiff (expr, a + b);
</pre><pre class="example">                    2                    2
(%o6)            3 b  + (6 a + 2) b + 3 a  + 2 a
</pre></div>
</dd></dl>

<a name="ratdisrep"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fratdisrep"></a><dl>
<dt><a name="index-ratdisrep"></a>Funktion: <strong>ratdisrep</strong> <em>(<var>expr</var>)</em></dt>
<dd>

<p>Gibt das Argument <var>expr</var> als einen allgemeinen Ausdruck zur&uuml;ck.  Ist
<var>expr</var> bereits ein allgemeiner Ausdruck, wird dieser unver&auml;ndert
zur&uuml;ckgegeben.
</p>



<p>Im Allgemeinen wird die Funktion <code>ratdisrep</code> aufgerufen, um einen
Ausdruck von der CRE-Form in einen allgemeinen Ausdruck umzuwandeln.
</p>

<p>Siehe auch die Funktion <code><a href="#totaldisrep">totaldisrep</a></code>.
</p></dd></dl>

<a name="ratexpand"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fratexpand"></a><dl>
<dt><a name="index-ratexpand"></a>Funktion: <strong>ratexpand</strong> <em>(<var>expr</var>)</em></dt>
<dt><a name="index-ratexpand-1"></a>Optionsvariable: <strong>ratexpand</strong></dt>
<dd>

<p>Expandiert das Argument <var>expr</var> indem Produkte und Potenzen von Summen
ausmultipliziert, Br&uuml;che &uuml;ber einen gemeinsamen Nenner dargestellt werden
und der gr&ouml;&szlig;te gemeinsamen Teiler heraus gek&uuml;rzt wird.  Ist der Z&auml;hler
eine Summe, wird er in seine Terme aufgespalten, die jeweils durch den Nenner
dividiert werden.
</p>

<p>Die R&uuml;ckgabe der Funktion <code>ratexpand</code> ist ein allgemeiner Ausdruck, auch
wenn das Argument <var>expr</var> ein Ausdruck in der CRE-Form ist.
</p>


<p>Die Optionsvariable <code>ratexpand</code> kontrolliert die Vereinfachung der Funktion
<code>ratsimp</code>.  Hat <code>ratexpand</code> den Wert <code>true</code>, wird ein Ausdruck
vollst&auml;ndig ausmultipliziert. Ist der Wert <code>false</code>, wird der Ausdruck
nur bez&uuml;glich der Hauptvariablen ausmultipliziert.  Zum Beispiel hat 
<code>ratsimp((x+1)*(y+1))</code> das Ergebnis <code>x y + y + x + 1</code>, wenn
<code>ratexpand</code> den Wert <code>true</code> hat, ansonsten ist das Ergebnis
<code>(x + 1) y + x + 1</code>.  Siehe auch die Funktion <code><a href="#ratsimp">ratsimp</a></code>.
</p>

<p>Hat die Optionsvariable <code><a href="#ratdenomdivide">ratdenomdivide</a></code> den Wert <code>true</code>, expandiert
die Funktion <code><a href="#ratexpand">ratexpand</a></code> einen Quotienten der im Z&auml;hler eine Summe hat,
in eine Summe der Quotienten.  Ansonsten werden die Terme &uuml;ber einen
gemeinsamen Nenner zusammengefasst.
</p>

<p>Hat die Optionsvariable <code><a href="#keepfloat">keepfloat</a></code> den Wert <code>true</code>, werden
Gleitkommazahlen im Argument <var>expr</var> nicht in rationale Zahlen umgewandelt,
wenn der Ausdruck in eine CRE-Form umgewandelt wird.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) ratexpand ((2*x - 3*y)^3);
                     3         2       2        3
(%o1)          - 27 y  + 54 x y  - 36 x  y + 8 x
(%i2) expr: (x - 1)/(x + 1)^2 + 1/(x - 1);
</pre><pre class="example">                         x - 1       1
(%o2)                   -------- + -----
                               2   x - 1
                        (x + 1)
</pre><pre class="example">(%i3) expand (expr);
                    x              1           1
(%o3)          ------------ - ------------ + -----
                2              2             x - 1
               x  + 2 x + 1   x  + 2 x + 1
(%i4) ratexpand (expr);
                        2
                     2 x                 2
(%o4)           --------------- + ---------------
                 3    2            3    2
                x  + x  - x - 1   x  + x  - x - 1
</pre></div>
</dd></dl>

<a name="ratfac"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fratfac"></a><dl>
<dt><a name="index-ratfac"></a>Optionsvariable: <strong>ratfac</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>



<p>Hat die Optionsvariable <code>ratfac</code> den Wert <code>true</code>, werden Ausdr&uuml;cke
in einer CRE-Form nur teilweise faktorisiert.  Bei der Ausf&uuml;hrung
von Operationen bleibt der Ausdruck so vollst&auml;ndig als m&ouml;glich in
seiner faktorisierten Form, ohne dass eine Faktorisierung mit der Funktion
<code><a href="#factor">factor</a></code> ausgef&uuml;hrt wird.  Auf diese Weise kann Rechenzeit eingespart
werden.
</p>



<p>Der <code><a href="#ratweight">ratweight</a></code>-Mechanismus ist nicht kompatibel mit dem Setzen der
Variablen <code>ratfac</code>.
</p> 
</dd></dl>

<a name="ratnumer"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fratnumer"></a><dl>
<dt><a name="index-ratnumer"></a>Funktion: <strong>ratnumer</strong> <em>(<var>expr</var>)</em></dt>
<dd>

<p>Gibt den Z&auml;hler des Argumentes <var>expr</var> zur&uuml;ck.  <code>ratnumer</code> wandelt
den Ausdruck zuerst in eine CRE-Form um und gibt das Ergebnis in einer 
CRE-Form zur&uuml;ck.
</p>

<p>Das Argument <var>expr</var> wird von der Funktion <code><a href="#rat">rat</a></code> in eine CRE-Form
gebracht, falls <var>expr</var> nicht bereits in einer CRE-Form vorliegt.  Diese
Transformation kann den Ausdruck <var>expr</var> ver&auml;ndern, da alle Terme &uuml;ber
einen gemeinsamen Nenner zusammengefasst werden.
</p>

<p>Die Funktion <code><a href="#num">num</a></code> ist vergleichbar.  <code>num</code> wandelt den Ausdruck
jedoch nicht eine CRE-Form um und hat als Ergebnis einen Ausdruck in der
Standardform.  Daher k&ouml;nnen sich die Ergebnisse von <code>ratnumer</code> und 
<code>num</code> voneinander unterscheiden.
</p>
</dd></dl>

<a name="ratp"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fratp"></a><dl>
<dt><a name="index-ratp"></a>Funktion: <strong>ratp</strong> <em>(<var>expr</var>)</em></dt>
<dd>

<p>Gibt das Ergebnis <code>true</code> zur&uuml;ck, wenn das Argument <var>expr</var> in einer
CRE-Form oder einer erweiterten CRE-Form vorliegt.
</p>

<p>CRE-Formen werden von der Funktion <code><a href="#rat">rat</a></code> und verwandten Funktionen erzeugt.
Erweiterte CRE-Formen werden von der Funktion <code><a href="maxima_85.html#taylor">taylor</a></code> und verwandten
Funktionen erzeugt.
</p></dd></dl>

<a name="ratprint"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fratprint"></a><dl>
<dt><a name="index-ratprint"></a>Optionsvariable: <strong>ratprint</strong></dt>
<dd><p>Standardwert: <code>true</code>
</p>

<p>Hat die Optionsvariable <code>ratprint</code> den Wert <code>true</code>, gibt Maxima eine
Meldung aus, wenn eine Gleitkommazahl in eine rationale Zahl umgewandelt wird.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) ratprint:true;
(%o1)                         true
(%i2) rat(0.75*x);

rat: replaced 0.75 by 3/4 = 0.75
                               3 x
(%o2)/R/                       ---
                                4
(%i3) ratprint:false;
(%o3)                         false
(%i4) rat(0.75*x);
                               3 x
(%o4)/R/                       ---
                                4
</pre></div>
</dd></dl>

<a name="ratsimp"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fratsimp"></a><dl>
<dt><a name="index-ratsimp"></a>Funktion: <strong>ratsimp</strong> <em>(<var>expr</var>)</em></dt>
<dt><a name="index-ratsimp-1"></a>Funktion: <strong>ratsimp</strong> <em>(<var>expr</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</em></dt>
<dd>

<p>Vereinfacht den Ausdruck <var>expr</var> und alle Teilausdr&uuml;cke, einschlie&szlig;lich
der nicht rationalen Anteile.  Das Ergebnis ist ein Quotient aus zwei Polynomen
in einer rekursiven Form.  In der rekursiven Form ist das Polynom nach der
Hauptvariablen vollst&auml;ndig ausmultipliziert und ein Polynom in allen anderen
Variablen.  Variable k&ouml;nnen auch nicht-rationale Ausdr&uuml;cke wie
<code>sin(x^2 + 1)</code> sein.
</p>

<p><code>ratsimp(<var>expr</var>, <var>x_1</var>, ..., <var>x_n</var>)</code> vereinfacht einen Ausdruck
mit einer Ordnung der Variablen wie sie von der Funktion <code><a href="#ratvars">ratvars</a></code><!-- /@w -->
definiert wird.
</p>

<p>Hat die Optionsvariable <code><a href="#ratsimpexpons">ratsimpexpons</a></code> den Wert <code>true</code>, wird
<code>ratsimp</code> auch auf die Exponenten von Ausdr&uuml;cke angewendet.
</p>

<p>Siehe auch die Funktion <code><a href="#ratexpand">ratexpand</a></code>.  Die Funktion <code>ratsimp</code> wird
auch von einigen Schaltern kontrolliert, die Einfluss auf <code>ratexpand</code>
haben.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) sin (x/(x^2 + x)) = exp ((log(x) + 1)^2 - log(x)^2);
                                         2      2
                   x         (log(x) + 1)  - log (x)
(%o1)        sin(------) = %e
                  2
                 x  + x
(%i2) ratsimp (%);
                             1          2
(%o2)                  sin(-----) = %e x
                           x + 1
(%i3) ((x - 1)^(3/2) - (x + 1)*sqrt(x - 1))/sqrt((x - 1)*(x + 1));
</pre><pre class="example">                       3/2
                (x - 1)    - sqrt(x - 1) (x + 1)
(%o3)           --------------------------------
                     sqrt((x - 1) (x + 1))
</pre><pre class="example">(%i4) ratsimp (%);
</pre><pre class="example">                           2 sqrt(x - 1)
(%o4)                    - -------------
                                 2
                           sqrt(x  - 1)
</pre><pre class="example">(%i5) x^(a + 1/a), ratsimpexpons: true;
                               2
                              a  + 1
                              ------
                                a
(%o5)                        x
</pre></div>
</dd></dl>

<a name="ratsimpexpons"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fratsimpexpons"></a><dl>
<dt><a name="index-ratsimpexpons"></a>Optionsvariable: <strong>ratsimpexpons</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>

<p>Hat die Optionsvariable <code>ratsimpexpons</code> den Wert <code>true</code>, wird
<code>ratsimp</code> auch auf die Exponenten von Ausdr&uuml;cke angewendet.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) expr: x^(a+1/a);
                             a + 1/a
(%o1)                       x
(%i2) ratsimpexpons: false;
(%o2)                         false
(%i3) ratsimp(expr);
                             a + 1/a
(%o3)                       x
(%i4) ratsimpexpons: true;
(%o4)                         true
(%i5) ratsimp(expr);
                               2
                              a  + 1
                              ------
                                a
(%o5)                        x
</pre></div>
</dd></dl>

<a name="radsubstflag"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fradsubstflag"></a><dl>
<dt><a name="index-radsubstflag"></a>Optionsvariable: <strong>radsubstflag</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>

<p>Hat <code>radsubstflag</code> den Wert <code>true</code>, werden Wurzeln von der Funktion
<code><a href="#ratsubst">ratsubst</a></code> auch dann substituiert, wenn diese nicht explizit im Ausdruck
enthalten sind.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) radsubstflag: false$
(%i2) ratsubst (u, sqrt(x), x);
(%o2)                           x
(%i3) radsubstflag: true$
(%i4) ratsubst (u, sqrt(x), x);
                                2
(%o4)                          u
</pre></div>
</dd></dl>

<a name="ratsubst"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fratsubst"></a><dl>
<dt><a name="index-ratsubst"></a>Funktion: <strong>ratsubst</strong> <em>(<var>a</var>, <var>b</var>, <var>c</var>)</em></dt>
<dd>

<p>Substituiert <var>a</var> f&uuml;r <var>b</var> in den Ausdruck <var>c</var> und gibt das Ergebnis
der Substitution zur&uuml;ck.
</p>

<p>Im Unterschied zu <code><a href="maxima_32.html#subst">subst</a></code> kann <code>ratsubst</code> auch Teilausdr&uuml;cke im
Ausdruck <var>c</var> substituieren.  So hat <code>subst(a, x + y, x + y + z)</code> das
Ergebnis <code>x + y + z</code> und <code>ratsubst</code> das Ergebnis <code>z + a</code>.
</p>

<p>Hat <code>radsubstflag</code> den Wert <code>true</code>, werden Wurzeln von der Funktion
<code>ratsubst</code> auch dann substituiert, wenn diese nicht explizit im Ausdruck
enthalten sind.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) ratsubst (a, x*y^2, x^4*y^3 + x^4*y^8);
                              3      4
(%o1)                      a x  y + a
(%i2) cos(x)^4 + cos(x)^3 + cos(x)^2 + cos(x) + 1;
               4         3         2
(%o2)       cos (x) + cos (x) + cos (x) + cos(x) + 1
(%i3) ratsubst (1 - sin(x)^2, cos(x)^2, %);
            4           2                     2
(%o3)    sin (x) - 3 sin (x) + cos(x) (2 - sin (x)) + 3
(%i4) ratsubst (1 - cos(x)^2, sin(x)^2, sin(x)^4);
</pre><pre class="example">                        4           2
(%o4)                cos (x) - 2 cos (x) + 1
</pre><pre class="example">(%i5) radsubstflag: false$
(%i6) ratsubst (u, sqrt(x), x);
(%o6)                           x
(%i7) radsubstflag: true$
(%i8) ratsubst (u, sqrt(x), x);
                                2
(%o8)                          u
</pre></div>
</dd></dl>

<a name="ratvars"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fratvars"></a><dl>
<dt><a name="index-ratvars"></a>Funktion: <strong>ratvars</strong> <em>(<var>x_1</var>, &hellip;, <var>x_n</var>)</em></dt>
<dt><a name="index-ratvars-1"></a>Funktion: <strong>ratvars</strong> <em>()</em></dt>
<dt><a name="index-ratvars-2"></a>Systemvariable: <strong>ratvars</strong></dt>
<dd>

<p>Deklariert die Variablen <var>x_1</var>, &hellip;, <var>x_n</var> zu Hauptvariablen einer
rationalen Funktion.  Ist die Variable <var>x_n</var> in einem Ausdruck vorhanden,
wird diese zur Hauptvariablen.  Ist <var>x_n</var> nicht im Ausdruck vorhanden, 
wird einer der vorhergehenden Variablen <var>x_i</var> zur Hauptvariablen.
</p>

<p>Eine Variable einer rationalen Funktion, die nicht unter den <var>x_1</var>, &hellip;,
<var>x_n</var> ist, erh&auml;lt eine geringe Priorit&auml;t als <var>x_1</var>.
</p>

<p>Die Argumente der Funktion <code>ratvars</code> k&ouml;nnen auch nicht-rationale
Ausdr&uuml;cke wie <code>sin(x)</code> sein.
</p>

<p>Die Systemvariable <code>ratvars</code> enth&auml;lt die Liste der zuletzt mit der
Funktion <code>ratvars</code> zu Hauptvariablen erkl&auml;rten Variablen.  Jeder Aufruf
der Funktion <code>ratvars</code> setzt diese Liste zur&uuml;ck.  Der Aufruf ohne
Argumente <code>ratvars()</code> l&ouml;scht die Systemvariable <code>ratvars</code>.
</p></dd></dl>

<a name="ratweight"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fratweight"></a><dl>
<dt><a name="index-ratweight"></a>Funktion: <strong>ratweight</strong> <em>(<var>x_1</var>, <var>w_1</var>, &hellip;, <var>x_n</var>, <var>w_n</var>)</em></dt>
<dt><a name="index-ratweight-1"></a>Funktion: <strong>ratweight</strong> <em>()</em></dt>
<dd>


<p>Weist der Variablen <var>x_i</var> ein Gewicht <var>w_i</var> zu.  Hat ein Term einer
rationalen Funktion ein gr&ouml;&szlig;eres Gewicht als der Wert der Variablen
<code><a href="#ratwtlvl">ratwtlvl</a></code> wird der Term durch <code>0</code> ersetzt.  Das Gewicht eines Terms
wird anhand der mit <code>ratweight</code> den Variablen zugewiesenen Gewichte
ermittelt.  Die Gewichte der Variablen in einem Term werden mit der Potenz
der Variablen multipliziert und dann addiert.  Zum Beispiel hat der Term
<code>3 x_1^2 x_2</code> das Gewicht <code>2 w_1 + w_2</code>.  Terme die den Wert
von <code>ratwtlvl</code> &uuml;bersteigen, werden nur dann entfernt, wenn rationale
Funktionen in einer CRE-Form multipliziert oder potenziert werden.
</p>
<p><code>ratweight()</code> gibt die Liste der zugewiesenen Gewichte zur&uuml;ck.
</p>

<p>Der <code><a href="#ratweight">ratweight</a></code>-Mechanismus ist nicht kompatibel mit dem Setzen der
Variablen <code>ratfac</code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) ratweight (a, 1, b, 1);
(%o1)                     [a, 1, b, 1]
(%i2) expr1: rat(a + b + 1)$
(%i3) expr1^2;
                  2                  2
(%o3)/R/         b  + (2 a + 2) b + a  + 2 a + 1
(%i4) ratwtlvl: 1$
(%i5) expr1^2;
(%o5)/R/                  2 b + 2 a + 1
</pre></div>
</dd></dl>

<a name="ratweights"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fratweights"></a><dl>
<dt><a name="index-ratweights"></a>System variable: <strong>ratweights</strong></dt>
<dd><p>Standardwert: <code>[]</code>
</p>

<p>Die Systemvariable <code>ratweights</code> enth&auml;lt die Liste der Gewichte die
Variablen mit der Funktion <code><a href="#ratweights">ratweights</a></code> zugewiesen sind.
</p>

<p>Die Gewichte k&ouml;nnen mit dem Kommando <code>kill(ratweights)</code> gel&ouml;scht
werden.
</p></dd></dl>

<a name="ratwtlvl"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fratwtlvl"></a><dl>
<dt><a name="index-ratwtlvl"></a>Optionsvariable: <strong>ratwtlvl</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>

<p>Die Optionsvariable wird im Zusammenhang mit den <code><a href="#ratweight">ratweight</a></code>-Mechanismus
genutzt und kontrolliert das Entfernen von Termen einer rationalen Funktion in
einer CRE-Form, wenn deren Gewicht den Wert von <code>ratwtlvl</code> &uuml;bersteigt.
Mit dem Standardwert <code>false</code> werden keine Terme entfernt.
</p></dd></dl>

<a name="remainder"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fremainder"></a><dl>
<dt><a name="index-remainder"></a>Funktion: <strong>remainder</strong> <em>(<var>p_1</var>, <var>p_2</var>)</em></dt>
<dt><a name="index-remainder-1"></a>Funktion: <strong>remainder</strong> <em>(<var>p_1</var>, <var>p_2</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</em></dt>
<dd>
<p>Berechnet den Rest der Polynomdivision von <var>p_1</var> und <var>p_2</var> f&uuml;r die
Variable <var>x_n</var>.  Die anderen Variablen <var>x_1</var>, &hellip;, <var>x_n-1</var>
haben dieselbe Bedeutung wie f&uuml;r die Funktion <code><a href="#ratvars">ratvars</a></code>.
</p>
<p><code>remainder</code> gibt das zweite Element des Ergebnisses der Funktion
<code><a href="#divide">divide</a></code> zur&uuml;ck.
</p>
<p>Siehe auch die Funktion <code><a href="#quotient">quotient</a></code>.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) poly1 : x^3-2*x^2-5*x+7;
                        3      2
(%o1)                  x  - 2 x  - 5 x + 7
(%i2) poly2 : x^2+1;
                              2
(%o2)                        x  + 1
(%i3) remainder(poly1, poly2, x);
(%o3)                        9 - 6 x
</pre></div>
</dd></dl>

<a name="resultant"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fresultant"></a><dl>
<dt><a name="index-resultant"></a>Funktion: <strong>resultant</strong> <em>(<var>p_1</var>, <var>p_2</var>, <var>x</var>)</em></dt>
<dd>

<p>Berechnet die Resultante der Polynome <var>p_1</var> und <var>p_2</var> und eliminiert
die unabh&auml;ngige Variable <var>x</var>.  Die Resultante ist die Determinante der
Sylvestermatrix f&uuml;r die beiden Polynome.  Das Ergebnis ist Null, wenn die
beiden Polynome <var>p_1</var> und <var>p_2</var> einen gemeinsamen Faktor haben.
</p>

<p>K&ouml;nnen die Polynome <var>p_1</var> oder <var>p_2</var> faktorisiert werden, kann es
von Vorteil sein, die Faktorisierung zuvor auszuf&uuml;hren.
</p>

<p>Die Optionsvariable <code>resultant</code> kontrolliert, welcher Algorithmus f&uuml;r
die Berechnung der Resultante von Maxima genutzt wird.  Siehe die 
Optionsvariable <code><a href="#option_005fresultant">resultant</a></code>.
</p>

<p>Die Funktion <code><a href="#bezout">bezout</a></code> berechnet die Sylvestermatrix der Polynome
<var>p_1</var> und <var>p_2</var>.  Die Determinante der Sylvestermatrix ist die
Resultante.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) resultant(2*x^2+3*x+1, 2*x^2+x+1, x);
(%o1)                           8
(%i2) resultant(x+1, x+1, x);
(%o2)                           0
(%i3) resultant((x+1)*x, (x+1), x);
(%o3)                           0
(%i4) resultant(a*x^2+b*x+1, c*x + 2, x);
                         2
(%o4)                   c  - 2 b c + 4 a

(%i5) bezout(a*x^2+b*x+1, c*x+2, x);
                        [ 2 a  2 b - c ]
(%o5)                   [              ]
                        [  c      2    ]
(%i6) determinant(%);
(%o6)                   4 a - (2 b - c) c
</pre></div>
</dd></dl>

<a name="option_005fresultant"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fresultant"></a><dl>
<dt><a name="index-resultant-1"></a>Optionsvariable: <strong>resultant</strong></dt>
<dd><p>Standardwert: <code>subres</code>
</p>

<p>Die Optionsvariable <code>resultant</code> kontrolliert, welcher Algorithmus f&uuml;r die
Berechnung der Resultante mit der Funktion <code><a href="#resultant">resultant</a></code> von Maxima genutzt
wird.  Die m&ouml;glichen Werte sind:
</p>
<dl compact="compact">
<dt><code>subres</code></dt>
<dd><p>Subresultanten-Algorithmus
</p></dd>
<dt><code>mod</code></dt>
<dd><p>Modularer Resultanten-Algorithmus
</p></dd>
<dt><code>red</code></dt>
<dd><p>Reduzierter Subresultanten-Algorithmus
</p></dd>
</dl>

<p>Der Standwert <code>subres</code> ist f&uuml;r die meisten Probleme geeignet.  F&uuml;r
gro&szlig;e Polynome in einer oder zwei Variablen kann <code>mod</code> besser sein.
</p></dd></dl>

<a name="savefactors"></a><a name="Item_003a-Polynomials_002ede_002fdefvr_002fsavefactors"></a><dl>
<dt><a name="index-savefactors"></a>Optionsvariable: <strong>savefactors</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>

<p>Hat die Optionsvariable <code>savefactors</code> den Wert <code>true</code>, versuchen
einige Funktionen bei der Vereinfachung eine bereits vorhandene Faktorisierung
zu erhalten, um weitere Vereinfachungen zu beschleunigen.
</p></dd></dl>

<a name="showratvars"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fshowratvars"></a><dl>
<dt><a name="index-showratvars"></a>Funktion: <strong>showratvars</strong> <em>(<var>expr</var>)</em></dt>
<dd>

<p>Gibt eine Liste mit den Variablen des Ausdrucks <var>expr</var> zur&uuml;ck.  Der
Ausdruck liegt in einer CRE-Form vor.
</p>
<p>Siehe auch die Funktion <code><a href="#ratvars">ratvars</a></code>.
</p></dd></dl>


<a name="sqfr"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002fsqfr"></a><dl>
<dt><a name="index-sqfr"></a>Funktion: <strong>sqfr</strong> <em>(<var>expr</var>)</em></dt>
<dd>



<p>Entspricht der Funktion <code><a href="#factor">factor</a></code> mit dem Unterschied, dass faktorisierte
Polynome quadratfrei sind.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) sqfr (4*x^4 + 4*x^3 - 3*x^2 - 4*x - 1);
                                2   2
(%o1)                  (2 x + 1)  (x  - 1)
</pre></div>
</dd></dl>


<a name="tellrat"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002ftellrat"></a><dl>
<dt><a name="index-tellrat"></a>Funktion: <strong>tellrat</strong> <em>(<var>p_1</var>, &hellip;, <var>p_n</var>)</em></dt>
<dt><a name="index-tellrat-1"></a>Funktion: <strong>tellrat</strong> <em>()</em></dt>
<dd>

<p>F&uuml;gt dem Ring der ganzen Zahlen, die algebraische Zahlen hinzu, die L&ouml;sungen
der minimalen Polynome <var>p_1</var>, &hellip;, <var>p_n</var> sind.  Jedes Argument
<var>p_i</var> ist ein Polynom, dessen Koeffizienten ganze Zahlen sind.
</p>

<p><code>tellrat(<var>x</var>)</code> bedeutet, dass in einer rationalen Funktion die
Variable <var>x</var> mit dem Wert <code>0</code> substituiert wird.
</p>

<p><code>tellrat()</code> gibt eine Liste der minimalen Polynome zur&uuml;ck.
</p>

<p>Die Optionsvariable <code><a href="#algebraic">algebraic</a></code> muss den Wert <code>true</code> haben, damit
die Vereinfachungen von algebraischen Zahlen ausgef&uuml;hrt wird.
</p>

<p>Maxima kennt bereits die Erweiterungen um die Imagin&auml;re Einheit <code>%i</code> und
die Wurzeln der ganzen Zahlen.
</p>

<p>Die Funktion <code><a href="#untellrat">untellrat</a></code> entfernt die Eigenschaften, die mit der Funktion
<code>tellrat</code> definiert wurden.
</p>

<p>Hat ein minimales Polynom mehrere Variablen, wie zum Beispiel in
<code>tellrat(x^2 - y^2)</code>, dann entsteht eine Mehrdeutigkeit, da Maxima nicht
ermitteln kann, ob <var>x^2</var> f&uuml;r <var>y^2</var> zu ersetzten ist, oder umgekehrt.
In diesem Fall kann die Syntax <code>tellrat (y^2 = x^2)</code> genutzt werden, die
besagt, dass <var>y^2</var> durch <var>x^2</var> zu ersetzen ist.
</p>

<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) 10*(%i + 1)/(%i + 3^(1/3));
</pre><pre class="example">                           10 (%i + 1)
(%o1)                      -----------
                                  1/3
                            %i + 3
</pre><pre class="example">(%i2) ev (ratdisrep (rat(%)), algebraic);
</pre><pre class="example">             2/3      1/3              2/3      1/3
(%o2)    (4 3    - 2 3    - 4) %i + 2 3    + 4 3    - 2
</pre><pre class="example">(%i3) tellrat (1 + a + a^2);
                            2
(%o3)                     [a  + a + 1]
(%i4) 1/(a*sqrt(2) - 1) + a/(sqrt(3) + sqrt(2));
                      1                 a
(%o4)           ------------- + -----------------
                sqrt(2) a - 1   sqrt(3) + sqrt(2)
(%i5) ev (ratdisrep (rat(%)), algebraic);
         (7 sqrt(3) - 10 sqrt(2) + 2) a - 2 sqrt(2) - 1
(%o5)    ----------------------------------------------
                               7
(%i6) tellrat (y^2 = x^2);
                        2    2   2
(%o6)                 [y  - x , a  + a + 1]
</pre></div>
</dd></dl>

<a name="totaldisrep"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002ftotaldisrep"></a><dl>
<dt><a name="index-totaldisrep"></a>Funktion: <strong>totaldisrep</strong> <em>(<var>expr</var>)</em></dt>
<dd>

<p>Konvertiert alle Teilausdr&uuml;cke im Ausdruck <var>expr</var> von der CRE-Form in die
allgemeine Form und gibt das Ergebnis zur&uuml;ck.  Ist <var>expr</var> selbst eine
CRE-Form, dann entspricht <code>totaldisrep</code> der Funktion <code>ratdisrep</code>.
</p>

<p><code>totaldisrep</code> ist insbesondere hilfreich, wenn Gleichungen, Listen oder
Matrizen in eine allgemeine Form zu konvertieren sind.
</p>
</dd></dl>

<a name="untellrat"></a><a name="Item_003a-Polynomials_002ede_002fdeffn_002funtellrat"></a><dl>
<dt><a name="index-untellrat"></a>Funktion: <strong>untellrat</strong> <em>(<var>x_1</var>, &hellip;, <var>x_n</var>)</em></dt>
<dd>

<p>Entfernt Eigenschaften von den Symbolen <var>x_1</var>, &hellip;, <var>x_n</var>, die mit
der Funktion <code>tellrat</code> zugewiesen wurden.
</p>
</dd></dl>



<hr>
<div class="header">
<p>
Previous: <a href="maxima_100.html#Einf_00fchrung-in-Polynome" accesskey="p" rel="previous">Einf&uuml;hrung in Polynome</a>, Nach oben: <a href="maxima_99.html#Polynome" accesskey="u" rel="up">Polynome</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Inhaltsverzeichnis" rel="contents">Inhalt</a>][<a href="maxima_334.html#Index-der-Variablen-und-Funktionen" title="Index" rel="index">Index</a>]</p>
</div>



</body>
</html>
