<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 5.1, http://www.gnu.org/software/texinfo/ -->
<head>
<title>Maxima Manual: Funktionen und Variablen f&uuml;r Ausdr&uuml;cke</title>

<meta name="description" content="Maxima Manual: Funktionen und Variablen f&uuml;r Ausdr&uuml;cke">
<meta name="keywords" content="Maxima Manual: Funktionen und Variablen f&uuml;r Ausdr&uuml;cke">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="maxima_toc.html#Top" rel="start" title="Top">
<link href="maxima_334.html#Index-der-Variablen-und-Funktionen" rel="index" title="Index der Variablen und Funktionen">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="Inhaltsverzeichnis">
<link href="maxima_28.html#Ausdr_00fccke" rel="up" title="Ausdr&uuml;cke">
<link href="maxima_33.html#Operatoren" rel="next" title="Operatoren">
<link href="maxima_31.html#Bezeichner" rel="previous" title="Bezeichner">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
blockquote.smallquotation {font-size: smaller}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
div.indentedblock {margin-left: 3.2em}
div.lisp {margin-left: 3.2em}
div.smalldisplay {margin-left: 3.2em}
div.smallexample {margin-left: 3.2em}
div.smallindentedblock {margin-left: 3.2em; font-size: smaller}
div.smalllisp {margin-left: 3.2em}
kbd {font-style:oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: inherit; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: inherit; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.nocodebreak {white-space:nowrap}
span.nolinebreak {white-space:nowrap}
span.roman {font-family:serif; font-weight:normal}
span.sansserif {font-family:sans-serif; font-weight:normal}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="figures/favicon.ico">

</head>

<body lang="de" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">
<a name="Funktionen-und-Variablen-f_00fcr-Ausdr_00fccke"></a>
<div class="header">
<p>
Previous: <a href="maxima_31.html#Bezeichner" accesskey="p" rel="previous">Bezeichner</a>, Nach oben: <a href="maxima_28.html#Ausdr_00fccke" accesskey="u" rel="up">Ausdr&uuml;cke</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Inhaltsverzeichnis" rel="contents">Inhalt</a>][<a href="maxima_334.html#Index-der-Variablen-und-Funktionen" title="Index" rel="index">Index</a>]</p>
</div>
<a name="Funktionen-und-Variablen-fur-Ausdrucke"></a>
<h3 class="section">6.4 Funktionen und Variablen f&uuml;r Ausdr&uuml;cke</h3>

<a name="alias"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002falias"></a><dl>
<dt><a name="index-alias"></a>Funktion: <strong>alias</strong> <em>(<var>new_name_1</var>, <var>old_name_1</var>, &hellip;, <var>new_name_n</var>, <var>old_name_n</var>)</em></dt>
<dd>
<p>Die Funktion <code>alias</code> erm&ouml;glicht einen alternativen Alias-Namen f&uuml;r eine 
Maxima-Funktion, einer Variablen oder einem Array.  Der Funktion <code>alias</code> 
kann eine beliebige Anzahl von paarweisen Namen und Alias-Namen &uuml;bergeben 
werden.
</p>
<p><code>alias</code> gibt eine Liste mit den Symbolen zur&uuml;ck, denen ein Alias-Name
zugewiesen werden konnte.  Wurde einem Symbol bereits derselbe Alias-Name 
gegeben, enth&auml;lt die Liste den Wert <code>false</code>.  Wird versucht einem Symbol,
das bereits einen Alias-Namen hat, einen neuen Alias-Namen zu geben, bricht
<code>alias</code> mit einer Fehlermeldung ab.
</p>
<p>Symbole, die einen Alias-Namen erhalten haben, werden in die Systemvariable 
<code>aliases</code> eingetragen.  Siehe die Systemvariable <code><a href="#aliases">aliases</a></code>.
</p>
<p>Die Funktionen <code><a href="#ordergreat">ordergreat</a></code> und <code><a href="#orderless">orderless</a></code> sowie die Deklaration
eines Symbols als ein <code><a href="#noun">noun</a></code> mit der Funktion <code><a href="maxima_63.html#declare">declare</a></code> erzeugen
automatisch Alias-Namen, die in die Liste <code>aliases</code> eingetragen werden.
</p>
<p>Der Alias-Name kann mit der Funktion <code><a href="maxima_9.html#kill">kill</a></code> entfernt werden.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) alias(mysqrt,sqrt);
(%o1)                        [sqrt]
(%i2) aliases;
(%o2)                        [sqrt]
(%i3) mysqrt(4);
(%o3)                           2
(%i4) kill(mysqrt);
(%o4)                         done
(%i5) mysqrt(4);
(%o5)                       mysqrt(4)
(%i6) aliases;
(%o6)                          []
</pre></div>
</dd></dl>

<a name="aliases"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002faliases"></a><dl>
<dt><a name="index-aliases"></a>Systemvariable: <strong>aliases</strong></dt>
<dd><p>Anfangswert: <code>[]</code>
</p>
<p>Die Systemvariable <code>aliases</code> ist eine Informationsliste der Symbole, die 
einen vom Nutzer definierten Alias-Namen mit dem Kommando <code>alias</code> 
erhalten haben.  Weiterhin werden von den Funktionen <code><a href="#ordergreat">ordergreat</a></code> und 
<code><a href="#orderless">orderless</a></code> sowie bei der Deklaration eines Symbols als ein
<code><a href="#noun">noun</a></code> mit der Funktion <code><a href="maxima_63.html#declare">declare</a></code> Alias-Namen generiert, die in die
Liste <code>aliases</code> eingetragen werden.
</p>
<p>Siehe auch die Funktion <code><a href="#alias">alias</a></code> f&uuml;r ein Beispiel.
</p></dd></dl>

<a name="allbut"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002fallbut"></a><dl>
<dt><a name="index-allbut"></a>Schl&uuml;sselwort: <strong>allbut</strong></dt>
<dd>
<p>Das Schl&uuml;sselwort <code>allbut</code> wird bei <code>part</code>-Befehlen wie
<code><a href="#part">part</a></code>, <code><a href="#inpart">inpart</a></code>, <code><a href="#substpart">substpart</a></code>,<!-- /@w -->
<code><a href="#substinpart">substinpart</a></code>, <code><a href="#dpart">dpart</a></code> und <code><a href="#lpart">lpart</a></code> genutzt, um Indizes bei
der Auswahl von Teilausdr&uuml;cken auszuschlie&szlig;en.
</p>
<p>Das Schl&uuml;sselwort <code>allbut</code> kann auch zusammen mit dem Kommando
<code>kill</code> verwendet werden.  <code>kill(allbut(<var>a_1</var>, <var>a_2</var>, ...))</code>
hat denselben Effekt wie <code>kill(all)</code> mit der Ausnahme, dass die Symbole 
<var>a_1</var>, <var>a_2</var>, &hellip; von <code>kill</code> ausgenommen werden.  Siehe die 
Funktion <code><a href="maxima_9.html#kill">kill</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) expr : e + d + c + b + a;
(%o1)                   e + d + c + b + a
(%i2) part (expr, [2, 5]);
(%o2)                         d + a

(%i3) expr : e + d + c + b + a;
(%o3)                   e + d + c + b + a
(%i4) part (expr, allbut (2, 5));
(%o4)                       e + c + b
</pre></div>

<p>Das Schl&uuml;sselwort <code>allbut</code> kann zusammen mit dem Kommando <code>kill</code>
verwendet werden.
</p>
<div class="example">
<pre class="example">(%i1) [aa : 11, bb : 22, cc : 33, dd : 44, ee : 55];
(%o1)                 [11, 22, 33, 44, 55]
(%i2) kill (allbut (cc, dd));
(%o0)                         done
(%i1) [aa, bb, cc, dd];
(%o1)                   [aa, bb, 33, 44]
</pre></div>
</dd></dl>

<a name="args"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fargs"></a><dl>
<dt><a name="index-args"></a>Funktion: <strong>args</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Die Funktion <code>args</code> gibt eine Liste mit den Argumenten des Hauptoperators
des Ausdrucks <var>expr</var> zur&uuml;ck.
</p>
<p>Die Anordnung der Argumente der Ergebnisliste wird von der Optionsvariablen
<code>inflag</code> beeinflu&szlig;t.  Hat <code>inflag</code> den Wert <code>true</code>, ist die
Anordnung entsprechend der internen Darstellung des Ausdrucks <var>expr</var>.
Ansonsten ist die Anordnung wie in der externen Darstellung f&uuml;r die Anzeige.
Siehe die Optionsvariable <code><a href="#inflag">inflag</a></code>.
</p>
<p><code>args(<var>expr</var>)</code> ist &auml;quivalent zu 
<code>substpart(&quot;[&quot;, <var>expr</var>, 0)</code>.  Siehe auch <code><a href="#substpart">substpart</a></code> und 
<code><a href="#op">op</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) args(gamma_incomplete(a,x));
(%o1)                        [a, x]
(%i2) args(x+y+z);
(%o2)                       [z, y, x]
(%i3) args(x+y+z),inflag:true;
(%o3)                       [x, y, z]
(%i4) args(x+2*a);
(%o4)                       [x, 2 a]
</pre></div>
</dd></dl>

<a name="atom"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fatom"></a><dl>
<dt><a name="index-atom"></a>Funktion: <strong>atom</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Gibt den Wert <code>true</code> zur&uuml;ck, wenn das Argument <var>expr</var> ein Atom ist.
Atome sind ganze Zahlen, Gleitkommazahlen, Zeichenketten und Symbole.  Siehe
auch die Funktionen <code><a href="#symbolp">symbolp</a></code> und <code><a href="maxima_21.html#listp">listp</a></code>.
</p>

<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) atom(5);
(%o1)                         true
(%i2) atom(5.0);
(%o2)                         true
(%i3) atom(5.0b0);
(%o3)                         true
(%i4) atom(1/2);
(%o4)                         false
(%i5) atom('a);
(%o5)                         true
(%i6) atom(2*x);
(%o6)                         false
(%i7) atom(&quot;string&quot;);
(%o7)                         true
</pre></div>
</dd></dl>

<a name="box"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fbox"></a><dl>
<dt><a name="index-box"></a>Funktion: <strong>box</strong> <em>(<var>expr</var>)</em></dt>
<dt><a name="index-box-1"></a>Funktion: <strong>box</strong> <em>(<var>expr</var>, <var>a</var>)</em></dt>
<dd>
<p>Die Funktion <code>box(<var>expr</var>)</code> umschlie&szlig;t den Ausdruck <var>expr</var> in 
der Ausgabe mit einem Rahmen, wenn <code>display2d</code> den Wert <code>true</code> hat.
Ansonsten ist der R&uuml;ckgabewert ein Ausdruck mit <code>box</code> als Operator und 
<var>expr</var> als Argument.
</p>
<p><code>box(<var>expr</var>, <var>a</var>)</code> umschlie&szlig;t <var>expr</var> mit einem Rahmen, der
mit einer Marke <var>a</var> bezeichnet ist.  Ist die Marke l&auml;nger als der Rahmen,
werden Zeichen abgeschnitten.
</p>
<p>Die Funktion <code>box</code> wertet ihre Argumente aus.  Die eingerahmten Ausdr&uuml;cke
werden dagegen nicht mehr ausgewertet.
</p>
<p>Die Optionsvariable <code><a href="#boxchar">boxchar</a></code> enth&auml;lt das Zeichen, das von den Funktionen
<code>box</code> sowie <code><a href="#dpart">dpart</a></code> und <code><a href="#lpart">lpart</a></code> verwendet wird, um den Rahmen
auszugeben.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) box (a^2 + b^2);
                            &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                            &quot; 2    2&quot;
(%o1)                       &quot;b  + a &quot;
                            &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i2) a : 1234;
(%o2)                         1234
(%i3) b : c - d;
(%o3)                         c - d
(%i4) box (a^2 + b^2);
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                      &quot;       2          &quot;
(%o4)                 &quot;(c - d)  + 1522756&quot;
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i5) box (a^2 + b^2, term_1);
                      term_1&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                      &quot;       2          &quot;
(%o5)                 &quot;(c - d)  + 1522756&quot;
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i6) 1729 - box (1729);
                                 &quot;&quot;&quot;&quot;&quot;&quot;
(%o6)                     1729 - &quot;1729&quot;
                                 &quot;&quot;&quot;&quot;&quot;&quot;
</pre></div>
</dd></dl>

<a name="boxchar"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002fboxchar"></a><dl>
<dt><a name="index-boxchar"></a>Optionsvariable: <strong>boxchar</strong></dt>
<dd><p>Standardwert: <code>&quot;</code>
</p>
<p>Die Optionsvariable <code>boxchar</code> enth&auml;lt das Zeichen, welches von den 
Funktionen <code><a href="#box">box</a></code> sowie <code><a href="#dpart">dpart</a></code> und <code><a href="#lpart">lpart</a></code> genutzt wird, um
einen Rahmen auszugeben.
</p>
<p>Die Rahmen werden immer mit dem aktuellen Wert von <code>boxchar</code> ausgegeben.
Das Zeichen <code>boxchar</code> wird nicht zusammen mit dem eingerahmten Ausdruck
gespeichert.
</p></dd></dl>

<a name="collapse"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fcollapse"></a><dl>
<dt><a name="index-collapse"></a>Funktion: <strong>collapse</strong> <em>(<var>expr</var>)</em></dt>
<dt><a name="index-collapse-1"></a>Funktion: <strong>collapse</strong> <em>([<var>expr_1</var>, <var>expr_2</var>, &hellip;])</em></dt>
<dd>
<p>Komprimiert einen Ausdruck <var>expr</var>, indem gemeinsame Teilausdr&uuml;cke 
denselben Speicher nutzen.  <code>collapse</code> wird von der Funktion 
<code>optimize</code> aufgerufen.  <code>collapse</code> kann auch mit einer Liste 
aufgerufen werden, die mehrere Argumente enth&auml;lt.
</p>

<p>Siehe auch die Funktion <code><a href="#optimize">optimize</a></code>.
</p></dd></dl>

<a name="dispform"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fdispform"></a><dl>
<dt><a name="index-dispform"></a>Funktion: <strong>dispform</strong> <em>(<var>expr</var>)</em></dt>
<dt><a name="index-dispform-1"></a>Funktion: <strong>dispform</strong> <em>(<var>expr</var>, all)</em></dt>
<dd>
<p><code>dispform</code> formatiert den Ausdruck <var>expr</var> von der internen Darstellung
in eine externe Darstellung, wie sie f&uuml;r die Anzeige des Ausdrucks ben&ouml;tigt 
wird.  Bei der Formatierung sind Optionsvariablen wie <code><a href="maxima_103.html#dispflag">dispflag</a></code> und
<code><a href="maxima_10.html#powerdisp">powerdisp</a></code> wirksam.
</p>
<p>Beispiele f&uuml;r die interne und externe Darstellung von Ausdr&uuml;cken sind:
</p>
<div class="example">
<pre class="example">          Interne Darstellung            Externe Darstellung
------------------------------------------------------------
-x      : ((MTIMES) -1 $x)               ((MMINUS) $x)
sqrt(x) : ((MEXPT) $x ((RAT) 1 2))       ((%SQRT) $X)
a/b     : ((MTIMES) $A ((MEXPT) $B -1))  ((MQUOTIENT) $A $B)
</pre></div>

<p><code>dispform(<var>expr</var>)</code> gibt die externe Darstellung nur f&uuml;r den ersten 
Operator im Ausdruck zur&uuml;ck.  <code>dispform(<var>expr</var>, all)</code> gibt die 
externe Darstellung aller Operatoren im Ausdruck <var>expr</var> zur&uuml;ck.
</p>
<p>Siehe auch <code><a href="#part">part</a></code>, <code><a href="#inpart">inpart</a></code> und <code><a href="#inflag">inflag</a></code>.
</p>
<p>Beispiel:
</p>
<p>Die Funktion <code>dispform</code> kann genutzt werden, um die Wurzelfunktion in
einem Ausdruck zu substituieren.  Die Wurzelfunktion ist nur in der externen
Darstellung eines Ausdruckes vorhanden:
</p>
<div class="example">
<pre class="example">(%i1) expr: sqrt(5)/(5+sqrt(2));
                             sqrt(5)
(%o1)                      -----------
                           sqrt(2) + 5
(%i2) subst(f,sqrt,expr);
                             sqrt(5)
(%o2)                      -----------
                           sqrt(2) + 5
(%i3) subst(f,sqrt,dispform(expr));
                              f(5)
(%o3)                      -----------
                           sqrt(2) + 5
(%i4) subst(f,sqrt,dispform(expr,all));
                              f(5)
(%o4)                       --------
                            f(2) + 5
</pre></div>
</dd></dl>

<a name="disolate"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fdisolate"></a><dl>
<dt><a name="index-disolate"></a>Funktion: <strong>disolate</strong> <em>(<var>expr</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</em></dt>
<dd>
<p>Die Funktion <code>disolate</code> arbeitet &auml;hnlich wie die Funktion <code>isolate</code>.
Teilausdr&uuml;cke im Ausdruck <var>expr</var>, die die Variablen <var>x_1</var>, &hellip;, 
<var>x_n</var> nicht enthalten, werden durch Zwischenmarken <code>%t1</code>, <code>%t2</code>, 
&hellip; ersetzt.  Im Unterschied zu der Funktion <code>isolate</code> kann die
Funktion <code>disolate</code> Teilausdr&uuml;cke zu mehr als einer Variablen aus einem
Ausdruck isolieren.
</p>
<p>Die Ersetzung von Teilausdr&uuml;cken durch Zwischenmarken kann mit der 
Optionsvariable <code>isolate_wrt_times</code> kontrolliert werden.  Hat die
Optionsvariable <code>isolate_wrt_times</code> den Wert <code>true</code>, werden 
Ersetzungen in Produkten ausgef&uuml;hrt.  Der Standardwert ist <code>false</code>.
Siehe <code><a href="#isolate_005fwrt_005ftimes">isolate_wrt_times</a></code> f&uuml;r Beispiele.
</p>
<p>Die Optionsvariable <code><a href="#exptisolate">exptisolate</a></code> hat im Unterschied zur Funktion
<code>isolate</code> keinen Einfluss auf die Ersetzung von Teilausdr&uuml;cken durch
Zwischenmarken.
</p>
<p><code>disolate</code> wird automatisch aus der Datei
<samp>share/simplification/disol.mac</samp> geladen.  Das Kommando 
<code>demo(disol)$</code> zeigt Beispiele.
</p>
<p>Siehe auch die Funktion <code><a href="#isolate">isolate</a></code>.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) expr:a*(e*(g+f)+b*(d+c));
(%o1)               a (e (g + f) + b (d + c))
(%i2) disolate(expr,a,b,e);
(%t2)                         d + c

(%t3)                         g + f

(%o3)                   a (%t3 e + %t2 b)
</pre></div>
</dd></dl>

<a name="dpart"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fdpart"></a><dl>
<dt><a name="index-dpart"></a>Funktion: <strong>dpart</strong> <em>(<var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</em></dt>
<dd>
<p>W&auml;hlt wie die Funktion <code>part</code> einen Teilausdruck aus, gibt aber den 
vollst&auml;ndigen Ausdruck zur&uuml;ck, wobei der ausgew&auml;hlte Teilausdruck 
eingerahmt ist.  Der Rahmen ist Teil des zur&uuml;ckgegebenen Ausdrucks.
</p>
<p>Siehe auch <code><a href="#part">part</a></code>, <code><a href="#inpart">inpart</a></code> und <code><a href="#lpart">lpart</a></code> sowie <code><a href="#box">box</a></code>.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) dpart (x+y/z^2, 1, 2, 1);
                             y
(%o1)                       ---- + x
                               2
                            &quot;&quot;&quot;
                            &quot;z&quot;
                            &quot;&quot;&quot;
</pre></div>
</dd></dl>

<a name="exptisolate"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002fexptisolate"></a><dl>
<dt><a name="index-exptisolate"></a>Optionsvariable: <strong>exptisolate</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat <code>exptisolate</code> den Wert <code>true</code>, dann sucht die Funktion
<code>isolate</code> auch in den Exponenten von Zahlen oder Symbolen nach
Teilausdr&uuml;cken zu einer Variablen.
</p>
<p>Siehe die Funktion <code><a href="#isolate">isolate</a></code> f&uuml;r Beispiele.
</p></dd></dl>

<a name="exptsubst"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002fexptsubst"></a><dl>
<dt><a name="index-exptsubst"></a>Optionsvariable: <strong>exptsubst</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Die Optionsvariable <code>exptsubst</code> kontrolliert die Substitution von
Ausdr&uuml;cken mit der Exponentialfunktion durch die Funktionen <code><a href="#subst">subst</a></code> und
<code><a href="#psubst">psubst</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) subst(y,%e^x,%e^(a*x)),exptsubst:false;
                                a x
(%o1)                         %e
(%i2) subst(y,%e^x,%e^(a*x)),exptsubst:true;
                                a
(%o2)                          y
</pre></div>
</dd></dl>

<a name="freeof"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002ffreeof"></a><dl>
<dt><a name="index-freeof"></a>Funktion: <strong>freeof</strong> <em>(<var>x</var>, <var>expr</var>)</em></dt>
<dt><a name="index-freeof-1"></a>Funktion: <strong>freeof</strong> <em>(<var>x_1</var>, &hellip;, <var>x_n</var>, <var>expr</var>)</em></dt>
<dd>
<p><code>freeof(<var>x</var>, <var>expr</var>)</code> gibt das Ergebnis <code>true</code> zur&uuml;ck, wenn
das Argument <var>x</var> nicht im Ausdruck <var>expr</var> enthalten ist.  Ansonsten ist
der R&uuml;ckgabewert <code>false</code>.
</p>
<p><code>freeof(<var>x_1</var>, ..., <var>x_n</var>, <var>expr</var>)</code> gibt das Ergebnis 
<code>true</code> zur&uuml;ck, wenn keines der Argumente <var>x_1</var>, <var>x_2</var>, &hellip;
im Ausdruck <var>expr</var> enthalten ist.
</p>
<p>Die Argumente <var>x_1</var>, &hellip;, <var>x_n</var> k&ouml;nnen die Namen von Funktionen 
und Variablen sein, indizierte Namen, die Namen von Operatoren oder allgemeine
Ausdr&uuml;cke.  Die Funktion <code>freeof</code> wertet die Argumente aus.
</p>
<p>Bei der Pr&uuml;fung, ob ein Teilausdruck <var>x</var> im Ausdruck <var>expr</var> enthalten
ist, untersucht die Funktion <code>freeof</code> den Ausdruck <var>expr</var> in der 
vorliegenden Form (nach Auswertung und Vereinfachung) und versucht nicht 
herauszufinden, ob der Teilausdruck in einem &auml;quivalenten Ausdruck enth&auml;lten
w&auml;re.
</p>
<p><code>freeof</code> ignoriert Dummy-Variablen.  Dummy-Variablen sind Variablen, die 
au&szlig;erhalb eines Ausdrucks nicht in Erscheinung treten.  Folgende 
Dummy-Variablen werden von <code>freeof</code> ignoriert: der Index einer Summe oder 
eines Produktes, die unabh&auml;ngige Variable in einem Grenzwert, die 
Integrationsvariable eines bestimmten Integrals oder einer 
Laplacetransformation, formale Variablen in <code><a href="maxima_90.html#at">at</a></code>- oder
<code><a href="maxima_160.html#lambda">lambda</a></code>-Ausdr&uuml;cke, lokale Variablen eines Blocks oder einer
<code><a href="maxima_168.html#do">do</a></code>-Schleife.
</p>
<p>Das unbestimmte Integral ist <i>nicht</i> frei von der Integrationsvariablen.
</p>
<p>Beispiele:
</p>
<p>Argumente sind Namen von Funktionen, Variablen, indizierten Variablen, 
Operatoren und Ausdr&uuml;cke.  <code>freeof(a, b, expr)</code> ist &auml;quivalent zu
<code>freeof(a, expr) and freeof(b, expr)</code>.
</p>
<div class="example">
<pre class="example">(%i1) expr: z^3 * cos (a[1]) * b^(c+d);
</pre><pre class="example">                                 d + c  3
(%o1)                   cos(a ) b      z
                             1
</pre><pre class="example">(%i2) freeof(z, expr);
(%o2)                         false
(%i3) freeof(cos, expr);
(%o3)                         false
(%i4) freeof(a[1], expr);
(%o4)                         false
(%i5) freeof(cos (a[1]), expr);
(%o5)                         false
(%i6) freeof(b^(c+d), expr);
(%o6)                         false
(%i7) freeof(&quot;^&quot;, expr);
(%o7)                         false
(%i8) freeof(w, sin, a[2], sin (a[2]), b*(c+d), expr);
(%o8)                         true
</pre></div>

<p>Die Funktion <code>freeof</code> wertet die Argumente aus.
</p>
<div class="example">
<pre class="example">(%i1) expr: (a+b)^5$
(%i2) c: a$
(%i3) freeof(c, expr);
(%o3)                         false
</pre></div>

<p><code>freeof</code> betrachtet keine &auml;quivalenten Ausdr&uuml;cke.  Vereinfachungen 
k&ouml;nnen einen &auml;quivalenten Ausdruck liefern, der jedoch den Teilausdruck 
nicht mehr enth&auml;lt.
</p>
<div class="example">
<pre class="example">(%i1) expr: (a+b)^5$
(%i2) expand(expr);
          5        4       2  3       3  2      4      5
(%o2)    b  + 5 a b  + 10 a  b  + 10 a  b  + 5 a  b + a
(%i3) freeof(a+b, %);
(%o3)                         true
(%i4) freeof(a+b, expr);
(%o4)                         false
</pre></div>

<p>Die Exponentialfunktion <code>exp(x)</code> wird von Maxima sofort zu <code>%e^x</code> 
vereinfacht.  Der Name <code>exp</code> der Exponentialfunktion ist daher nicht in
einem Ausdruck enthalten.
</p>
<div class="example">
<pre class="example">(%i5) exp(x);
                                 x
(%o5)                          %e
(%i6) freeof(exp, exp (x));
(%o6)                         true
</pre></div>

<p>Eine Summe ist frei von dem Index und ein bestimmtes Integral ist frei von der
Integrationsvariablen.  Ein unbestimmtes Integral ist nicht frei von der 
Integrationsvariablen.
</p>
<div class="example">
<pre class="example">(%i1) freeof(i, 'sum (f(i), i, 0, n));
(%o1)                         true
(%i2) freeof(x, 'integrate (x^2, x, 0, 1));
(%o2)                         true
(%i3) freeof(x, 'integrate (x^2, x));
(%o3)                         false
</pre></div>
</dd></dl>

<a name="inflag"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002finflag"></a><dl>
<dt><a name="index-inflag"></a>Optionsvariable: <strong>inflag</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>inflag</code> den Wert <code>true</code>, wird von Funktionen,
die Teile eines Ausdrucks <code>expr</code> extrahieren, die interne Form des
Ausdrucks <code>expr</code> betrachtet.
</p>
<p>Die Anordnung der Argumente der internen Darstellung unterscheidet sich zum
Beispiel f&uuml;r die Addition von der externen Darstellung f&uuml;r die Anzeige.
Daher hat <code>first(x+y)</code> das Ergebnis <code>x</code>, wenn <code>inflag</code> den Wert
<code>true</code> hat, und <code>y</code>, wenn <code>inflag</code> den Wert <code>false</code> hat.
Der Ausdruck <code>first(y+x)</code> gibt in beiden F&auml;llen dasselbe Ergebnis.
</p>
<p>Hat <code>inflag</code> den Wert <code>true</code>, entsprechen die Funktionen <code>part</code> 
und <code>substpart</code> den Funktionen <code>inpart</code> und <code>substinpart</code>.
</p>
<p>Folgende Funktionen werden von der Optionsvariablen <code>inflag</code> beeinflusst:
<code><a href="#part">part</a></code>, <code><a href="#substpart">substpart</a></code>, <code><a href="maxima_21.html#first">first</a></code>, <code><a href="maxima_21.html#rest">rest</a></code>,<!-- /@w -->
<code><a href="maxima_21.html#last">last</a></code>, <code><a href="maxima_21.html#length">length</a></code>, die Konstruktion <code><a href="maxima_168.html#for">for</a></code> &hellip;
<code>in</code>, <code><a href="maxima_160.html#map">map</a></code>, <code><a href="maxima_160.html#fullmap">fullmap</a></code>, <code><a href="maxima_160.html#maplist">maplist</a></code>,<!-- /@w -->
<code><a href="#reveal">reveal</a></code>, <code><a href="#pickapart">pickapart</a></code>, <code><a href="#args">args</a></code> und <code><a href="#op">op</a></code>.
</p></dd></dl>

<a name="inpart"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002finpart"></a><dl>
<dt><a name="index-inpart"></a>Funktion: <strong>inpart</strong> <em>(<var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</em></dt>
<dd>
<p>Die Funktion <code>inpart</code> ist &auml;hnlich wie <code>part</code>, arbeitet aber mit der 
internen Darstellung eines Ausdruckes und nicht mit der externen Darstellung 
f&uuml;r die Anzeige.  Da keine Formatierung vorgenommen wird, ist die Funktion 
<code>inpart</code> schneller als <code>part</code>.
</p>
<p>Immer dann, wenn sich die interne und die externe Darstellung eines Ausdrucks
voneinander unterscheiden, haben die Funktionen <code>inpart</code> und <code>part</code>
verschiedene Ergebnisse.  Dies trifft zu f&uuml;r die Anordnung der Argumente einer
Addition, der Subtraktion und Division sowie zum Beispiel f&uuml;r die 
Wurzelfunktion.
</p>
<p>Ist das letzte Argument einer <code>part</code>-Funktion eine Liste mit Indizes, 
werden mehrere Teilausdr&uuml;cke heraus gepickt.  So hat
<code>inpart(x + y + z, [1, 3])</code> das Ergebnis <code>z+x</code>.
</p>
<p>Siehe auch <code><a href="#part">part</a></code>, <code><a href="#dpart">dpart</a></code> und <code><a href="#lpart">lpart</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) x + y + w*z;
(%o1)                      w z + y + x
(%i2) inpart (%, 3, 2);
(%o2)                           z
(%i3) part (%th (2), 1, 2);
(%o3)                           z
(%i4) 'limit (f(x)^g(x+1), x, 0, minus);
                                  g(x + 1)
(%o4)                 limit   f(x)
                      x -&gt; 0-
(%i5) inpart (%, 1, 2);
(%o5)                       g(x + 1)
</pre></div>
</dd></dl>

<a name="isolate"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fisolate"></a><dl>
<dt><a name="index-isolate"></a>Funktion: <strong>isolate</strong> <em>(<var>expr</var>, <var>x</var>)</em></dt>
<dd>
<p>Teilausdr&uuml;cke im Ausdruck <var>expr</var>, die die Variable <var>x</var> nicht 
enthalten, werden durch Zwischenmarken <code>%t1</code>, <code>%t2</code>, &hellip; ersetzt.
Dies kann genutzt werden, um die weitere Auswertung und Vereinfachung dieser
Teilausdr&uuml;cke zu verhindern.  Die Ersetzung der Teilausdr&uuml;cke kann durch 
eine Auswertung des Ausdrucks r&uuml;ckg&auml;ngig gemacht werden.
</p>
<p>Die Ersetzung von Teilausdr&uuml;cken kann mit den Optionsvariablen 
<code><a href="#exptisolate">exptisolate</a></code> und <code><a href="#isolate_005fwrt_005ftimes">isolate_wrt_times</a></code> kontrolliert werden.  Hat die
Optionsvariable <code>exptisolate</code> den Wert <code>true</code>, werden Ersetzungen auch
f&uuml;r die Exponentiation ausgef&uuml;hrt.  Die Basis muss dabei eine Zahl oder ein 
Symbol wie <code>%e</code> sein.  Hat die Optionsvariable <code>isolate_wrt_times</code> den 
Wert <code>true</code>, werden Ersetzungen in Produkten ausgef&uuml;hrt.  Siehe
<code>isolate_wrt_times</code> f&uuml;r Beispiele.
</p>
<p>Die Ersetzung von Teilausdr&uuml;cken f&uuml;r mehrere Variable kann mit der Funktion
<code>disolate</code> ausgef&uuml;hrt werden.  Siehe <code><a href="#disolate">disolate</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) (b+a)^4*(x*((d+c)^2+2*x)+1);
                       4                  2
(%o1)           (b + a)  (x (2 x + (d + c) ) + 1)
(%i2) isolate(%,x);

                                   2
(%t2)                       (d + c)


                                   4
(%t3)                       (b + a)

(%o3)                %t3 (x (2 x + %t2) + 1)
(%i4) ratexpand(%);
                          2
(%o4)              2 %t3 x  + %t2 %t3 x + %t3
(%i5) ev(%);
                  4  2          4        2            4
(%o5)    2 (b + a)  x  + (b + a)  (d + c)  x + (b + a)
(%i6) (b+a)*(b+a+x)^2*%e^(b+a*x+x^2);
                                       2
                                  2   x  + a x + b
(%o6)          (b + a) (x + b + a)  %e
(%i7) ev(isolate(%,x),exptisolate:true);

(%t7)                         b + a


                                 b
(%t8)                          %e

                                        2
                                   2   x  + a x
(%o8)             %t7 %t8 (x + %t7)  %e
</pre></div>
</dd></dl>

<a name="isolate_005fwrt_005ftimes"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002fisolate_005fwrt_005ftimes"></a><dl>
<dt><a name="index-isolate_005fwrt_005ftimes"></a>Optionsvariable: <strong>isolate_wrt_times</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>isolate_wrt_times</code> den Wert <code>true</code>, f&uuml;hren 
die Funktionen <code>isolate</code> und <code>disolate</code> auch Ersetzungen in Produkten 
aus.
</p>
<p>Siehe auch die Funktionen <code><a href="#isolate">isolate</a></code> und <code><a href="#disolate">disolate</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) isolate_wrt_times: true$
(%i2) isolate (expand ((a+b+c)^2), c);

(%t2)                          2 a


(%t3)                          2 b


                          2            2
(%t4)                    b  + 2 a b + a

                     2
(%o4)               c  + %t3 c + %t2 c + %t4
(%i4) isolate_wrt_times: false$
(%i5) isolate (expand ((a+b+c)^2), c);
                     2
(%o5)               c  + 2 b c + 2 a c + %t4
</pre></div>
</dd></dl>

<a name="listconstvars"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002flistconstvars"></a><dl>
<dt><a name="index-listconstvars"></a>Optionsvariable: <strong>listconstvars</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>listconstvars</code> den Wert <code>true</code>, werden
Konstante wie <code><a href="maxima_18.html#g_t_0025e">%e</a></code>, <code><a href="maxima_18.html#g_t_0025pi">%pi</a></code> und Variablen, die als konstant
deklariert sind, von der Funktion <code><a href="#listofvars">listofvars</a></code> in die Ergebnisliste
aufgenommen.  Der Standardwert von <code>listconstvars</code> ist <code>false</code> und
Konstante werden ignoriert.
</p></dd></dl>

<a name="listdummyvars"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002flistdummyvars"></a><dl>
<dt><a name="index-listdummyvars"></a>Optionsvariable: <strong>listdummyvars</strong></dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat <code>listdummyvars</code> den Wert <code>false</code>, werden die Dummy-Variablen eines
Ausdrucks von der Funktion <code><a href="#listofvars">listofvars</a></code> ignoriert.  Dummy-Variablen sind
zum Beispiel der Index einer Summe, die Grenzwertvariable oder die
Integrationsvariable eines bestimmten Integrals.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) listdummyvars: true$
(%i2) listofvars ('sum(f(i), i, 0, n));
(%o2)                        [i, n]
(%i3) listdummyvars: false$
(%i4) listofvars ('sum(f(i), i, 0, n));
(%o4)                          [n]
</pre></div>
</dd></dl>

<a name="listofvars"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002flistofvars"></a><dl>
<dt><a name="index-listofvars"></a>Funktion: <strong>listofvars</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Die Funktion <code>listofvars</code> gibt eine Liste der Variablen zur&uuml;ck, die im 
Ausdruck <var>expr</var> enthalten sind.
</p>
<p>Hat die Optionsvariable <code><a href="#listconstvars">listconstvars</a></code> den Wert <code>true</code>, werden auch
Konstante wie <code><a href="maxima_18.html#g_t_0025e">%e</a></code>, <code><a href="maxima_18.html#g_t_0025pi">%pi</a></code> und <code><a href="maxima_18.html#g_t_0025i">%i</a></code> sowie als konstant
deklarierte Variable in die Liste aufgenommen.  Der Standardwert von
<code>listconstvars</code> ist <code>false</code>.
</p>
<p>Siehe entsprechend die Optionsvariable <code><a href="#listdummyvars">listdummyvars</a></code> f&uuml;r 
Dummy-Variablen.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) listofvars (f (x[1]+y) / g^(2+a));
(%o1)                     [g, a, x , y]
                                  1
</pre></div>
</dd></dl>

<a name="lfreeof"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002flfreeof"></a><dl>
<dt><a name="index-lfreeof"></a>Funktion: <strong>lfreeof</strong> <em>(<var>list</var>, <var>expr</var>)</em></dt>
<dd>
<p>F&uuml;r jedes Element <var>m</var> der Liste <var>list</var> wird die Funktion
<code>freeof</code> aufgerufen.  <code>lfreeof</code> hat den R&uuml;ckgabewert <code>true</code>,
wenn keines der Elemente der Liste <var>list</var> im Ausdruck <code>expr</code> enthalten
ist.  Ansonsten ist der R&uuml;ckgabewert <code>false</code>.
</p>
<p>Siehe auch die Funktion <code><a href="#freeof">freeof</a></code>.
</p></dd></dl>

<a name="lpart"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002flpart"></a><dl>
<dt><a name="index-lpart"></a>Funktion: <strong>lpart</strong> <em>(<var>label</var>, <var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</em></dt>
<dd>
<p>Die Funktion <code>lpart</code> ist &auml;hnlich zu <code>dpart</code>, verwendet aber einen
Rahmen, der mit einer Marke gekennzeichnet ist.
</p>
<p>Siehe auch <code><a href="#part">part</a></code>, <code><a href="#inpart">inpart</a></code> und <code><a href="#dpart">dpart</a></code>.
</p></dd></dl>

<a name="mainvar"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002fmainvar"></a><dl>
<dt><a name="index-mainvar"></a>Eigenschaft: <strong>mainvar</strong></dt>
<dd>
<p>Die Deklaration einer Variablen als eine Hauptvariable mit der Funktion
<code><a href="maxima_63.html#declare">declare</a></code> &auml;ndert deren Anordnung in einem Ausdruck der kanonisch geordnet
ist.  Hauptvariable sind bez&uuml;glich der Funktionen <code><a href="#ordergreatp">ordergreatp</a></code> und
<code><a href="#orderlessp">orderlessp</a></code> stets gr&ouml;&szlig;er als alle anderen Symbole, Konstanten und
Zahlen.
</p>

<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) sort([9, 1, %pi, g, t, a]);
(%o1)                 [1, 9, %pi, a, g, t]

(%i2) declare(a, mainvar)$
(%i3) sort([9, 1, %pi, g, t, a]);
(%o3)                 [1, 9, %pi, g, t, a]
</pre></div>
</dd></dl>

<a name="noun"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002fnoun"></a><dl>
<dt><a name="index-noun"></a>Eigenschaft: <strong>noun</strong></dt>
<dd>
<p><code>noun</code> ist eine der Optionen des Kommandos <code><a href="maxima_63.html#declare">declare</a></code>.  Wird eine
Funktion als <code>noun</code> deklariert, wird diese als Substantivform behandelt
und nicht ausgewertet.
</p>
<p>Ein Symbol <code>f</code>, dass als <code>noun</code> deklariert wird, wird in die
Informationsliste <code><a href="#aliases">aliases</a></code> eingetragen und die R&uuml;ckgabe der Funktion
<code><a href="maxima_63.html#properties">properties</a></code> enth&auml;lt den Eintrag <code>noun</code>.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) factor (12345678);
                             2
(%o1)                     2 3  47 14593
(%i2) declare (factor, noun);
(%o2)                         done
(%i3) factor (12345678);
(%o3)                   factor(12345678)
(%i4) ''%, nouns;
                             2
(%o4)                     2 3  47 14593
</pre></div>
</dd></dl>

<a name="noundisp"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002fnoundisp"></a><dl>
<dt><a name="index-noundisp"></a>Optionsvariable: <strong>noundisp</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat <code>noundisp</code> den Wert <code>true</code>, werden Substantivformen mit einem
vorangestelltem Hochkomma angezeigt.  Diese Optionsvariable hat immer den Wert
<code>true</code>, wenn die Definition von Funktionen angezeigt wird.
</p></dd></dl>

<a name="nounify"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fnounify"></a><dl>
<dt><a name="index-nounify"></a>Funktion: <strong>nounify</strong> <em>(<var>f</var>)</em></dt>
<dd>
<p>Die Funktion <code>nounify</code> gibt den Namen einer Funktion <var>f</var> in einer 
Substantivform zur&uuml;ck.  Der Name <var>f</var> ist ein Symbol oder eine
Zeichenkette.
</p>
<p>Einige Funktionen geben eine Substantivform zur&uuml;ck, wenn die Funktion nicht 
ausgewertet werden kann.  Wird einem Funktionsaufruf wie zum Beispiel 
<code>'f(x)</code> oder <code>'(f(x))</code> ein Hochkomma vorangestellt, wird ebenfalls 
eine Substantivform zur&uuml;ckgegeben.
</p>
<p>Siehe auch die Funktion <code><a href="#verbify">verbify</a></code>.
</p></dd></dl>

<a name="nterms"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fnterms"></a><dl>
<dt><a name="index-nterms"></a>Funktion: <strong>nterms</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Die Funktion <code>nterms</code> gibt die Anzahl der Terme des Ausdrucks <var>expr</var> 
zur&uuml;ck, wobei der Ausdruck als vollst&auml;ndig expandiert angenommen wird, ohne 
dass Terme gek&uuml;rzt oder zusammengefasst werden.
</p>
<p>Ausdr&uuml;cke wie <code>sin(<var>expr</var>)</code>, <code>sqrt(<var>expr</var>)</code> oder 
<code>exp(<var>expr</var>)</code> werden dabei als ein Term gez&auml;hlt.
</p></dd></dl>

<a name="op"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fop"></a><dl>
<dt><a name="index-op"></a>Funktion: <strong>op</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Die Funktion <code>op</code> gibt den Hauptoperator des Ausdrucks <var>expr</var> zur&uuml;ck.
<code>op(<var>expr</var>)</code> ist &auml;quivalent zu <code>part(<var>expr</var>, 0)</code>.
</p>
<p>Ist der Hauptoperator des Ausdrucks <var>expr</var> ein Operator wie &quot;+&quot;, &quot;*&quot; oder 
&quot;/&quot; wird der Name des Operators als Zeichenkette zur&uuml;ckgegeben.  Andernfalls 
wird ein Symbol zur&uuml;ckgegeben.
</p>
<p><code>op</code> beachtet den Wert der Optionsvariablen <code><a href="#inflag">inflag</a></code>.  <code>op</code>
wertet die Argumente aus.  Siehe auch <code><a href="#args">args</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) stringdisp: true$
(%i2) op (a * b * c);
(%o2)                          &quot;*&quot;
(%i3) op (a * b + c);
(%o3)                          &quot;+&quot;
(%i4) op ('sin (a + b));
(%o4)                          sin
(%i5) op (a!);
(%o5)                          &quot;!&quot;
(%i6) op (-a);
(%o6)                          &quot;-&quot;
(%i7) op ([a, b, c]);
(%o7)                          &quot;[&quot;
(%i8) op ('(if a &gt; b then c else d));
(%o8)                         &quot;if&quot;
(%i9) op ('foo (a));
(%o9)                          foo
(%i10) prefix (foo);
(%o10)                        &quot;foo&quot;
(%i11) op (foo a);
(%o11)                        &quot;foo&quot;
(%i12) op (F [x, y] (a, b, c));
(%o12)                        F
                               x, y
(%i13) op (G [u, v, w]);
(%o13)                          G
</pre></div>
</dd></dl>

<a name="operatorp"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002foperatorp"></a><dl>
<dt><a name="index-operatorp"></a>Funktion: <strong>operatorp</strong> <em>(<var>expr</var>, <var>op</var>)</em></dt>
<dt><a name="index-operatorp-1"></a>Funktion: <strong>operatorp</strong> <em>(<var>expr</var>, [<var>op_1</var>, &hellip;, <var>op_n</var>])</em></dt>
<dd>
<p>Das Kommando <code>operatorp(<var>expr</var>, <var>op</var>)</code> gibt <code>true</code> zur&uuml;ck,
wenn <var>op</var> der Hauptoperator des Ausdrucks <var>expr</var> ist.
</p>
<p><code>operatorp(<var>expr</var>, [<var>op_1</var>, ..., <var>op_n</var>])</code> gibt <code>true</code> 
zur&uuml;ck, wenn einer der Operatoren <var>op_1</var>, &hellip;, <var>op_n</var> der 
Hauptoperator des Ausdrucks <var>expr</var> ist.
</p></dd></dl>

<a name="option_005fopsubst"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002fopsubst"></a><dl>
<dt><a name="index-opsubst-3"></a>Optionsvariable: <strong>opsubst</strong></dt>
<dd>

<p>Hat die Optionsvariable <code>opsubst</code> den Wert <code>false</code>, f&uuml;hrt die 
Funktion <code><a href="#subst">subst</a></code> keine Substitution in einen Operator eines Ausdrucks aus.
Zum Beispiel hat <code>(opsubst: false, subst(x^2, r, r+r[0]))</code> das Ergebnis
<code>x^2+r[0]</code>.
</p></dd></dl>

<a name="optimize"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002foptimize"></a><dl>
<dt><a name="index-optimize"></a>Funktion: <strong>optimize</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Die Funktion <code>optimize</code> gibt einen Ausdruck zur&uuml;ck, der dasselbe Ergebnis 
und dieselben Seiteneffekte wie <var>expr</var> hat, der jedoch effizienter 
ausgewertet werden kann.  Im neuen Ausdruck wird die mehrfache Berechnung 
gleicher Teilausdr&uuml;cke vermieden und gleiche Teilausdr&uuml;cke werden 
zusammengefasst.
</p>
<p>Siehe auch die Funktion <code><a href="#collapse">collapse</a></code>.
</p>

<p><code>example(optimize)</code> zeigt ein Beispiel.
</p></dd></dl>

<a name="optimprefix"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002foptimprefix"></a><dl>
<dt><a name="index-optimprefix"></a>Optionsvariable: <strong>optimprefix</strong></dt>
<dd><p>Standardwert: <code>%</code>
</p>
<p>Die Optionsvariable <code>optimprefix</code> enth&auml;lt den Pr&auml;fix, der von der 
Funktion <code><a href="#optimize">optimize</a></code> benutzt wird, um einen Teilausdruck zu benennen.
</p></dd></dl>

<a name="ordergreat"></a><a name="orderless"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fordergreat"></a><dl>
<dt><a name="index-ordergreat"></a>Funktion: <strong>ordergreat</strong> <em>(<var>v_1</var>, &hellip;, <var>v_n</var>)</em></dt>
<dd><a name="Item_003a-Expressions_002ede_002fdeffn_002forderless"></a></dd><dt><a name="index-orderless"></a>Funktion: <strong>orderless</strong> <em>(<var>v_1</var>, &hellip;, <var>v_n</var>)</em></dt>
<dd>
<p>Die Funktion <code>ordergreat</code> &auml;ndert die kanonische Anordnung der Symbole so,
dass <var>v_1</var> &gt; <var>v_2</var> &gt; &hellip; &gt; <var>v_n</var>.  Weiterhin ist <var>v_n</var> 
kleiner als jedes andere Symbol, das nicht in der Liste enthalten ist.
</p>
<p><code>orderless</code> &auml;ndert die kanonische Anordnung der Symbole so, dass
<var>v_1</var> &lt; <var>v_2</var> &lt; &hellip; &lt; <var>v_n</var>.  Weiterhin ist <var>v_n</var>
gr&ouml;&szlig;er als jedes andere Symbol, das nicht in der Liste enthalten ist.
</p>
<p>Die durch <code>ordergreat</code> und <code>orderless</code> definierte Ordnung wird durch
<code><a href="#unorder">unorder</a></code> wieder aufgehoben.  <code>ordergreat</code> und <code>orderless</code> 
k&ouml;nnen jeweils nur einmal aufgerufen werden, solange nicht mit <code>unorder</code> 
zuvor die definierte Ordnung aufgehoben wird.
</p>
<p>Siehe auch <code><a href="#ordergreatp">ordergreatp</a></code>, <code><a href="#orderlessp">orderlessp</a></code> und <code><a href="#mainvar">mainvar</a></code>.
</p></dd></dl>

<a name="ordergreatp"></a><a name="orderlessp"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fordergreatp"></a><dl>
<dt><a name="index-ordergreatp"></a>Funktion: <strong>ordergreatp</strong> <em>(<var>expr_1</var>, <var>expr_2</var>)</em></dt>
<dd><a name="Item_003a-Expressions_002ede_002fdeffn_002forderlessp"></a></dd><dt><a name="index-orderlessp"></a>Funktion: <strong>orderlessp</strong> <em>(<var>expr_1</var>, <var>expr_2</var>)</em></dt>
<dd>
<p>Die Funktion <code>ordergreatp</code> gibt <code>true</code> zur&uuml;ck, wenn in der 
kanonischen Ordnung von Maxima <var>expr_1</var> gr&ouml;&szlig;er als <var>expr_2</var> ist.
Ansonsten ist das Ergebnis <code>false</code>.
</p>
<p>Die Funktion <code>orderlessp</code> gibt <code>true</code> zur&uuml;ck, wenn in der 
kanonischen Ordnung von Maxima <var>expr_1</var> kleiner als <var>expr_2</var> ist.
Ansonsten ist das Ergebnis <code>false</code>.
</p>
<p>Alle Maxima-Atome und Ausdr&uuml;cke sind vergleichbar unter <code>ordergreatp</code> und
<code>orderlessp</code>.  Die kanonische Ordnung von Atomen ist folgenderma&szlig;en:
</p>
<p align="left">Numerische Konstanten &lt;
   deklarierte Konstanten &lt;
   deklarierte Skalare &lt;
   erstes Argument von <code>orderless</code> &lt;
   weitere Argumente von <code>orderless</code> &lt;
   letztes Argument von <code>orderless</code> &lt;
   Variablen beginnend mit a, ... &lt;
   Variablen beginnend mit Z &lt;
   letzte Argument von <code>ordergreat</code> &lt;
   weitere Argumente von <code>ordergreat</code> &lt;
   erste Argument von <code>ordergreat</code> &lt;
   deklarierte Hauptvariablen.
</p>
<p>Die Ordnung f&uuml;r Ausdr&uuml;cke, die keine Atome sind, wird von der f&uuml;r Atome 
abgeleitet.  F&uuml;r die Operatoren <code>&quot;+&quot;</code>, <code>&quot;*&quot;</code> und <code>&quot;^&quot;</code> kann die
Ordnung nicht einfach beschrieben werden.  Andere Operatoren, Funktionen und 
Ausdr&uuml;cke werden angeordnet nach den Argumenten, dann nach den Namen.
Bei Ausdr&uuml;cken mit Indizes wird der Name des Symbols als Operator und der 
Index als Argument betrachtet.
</p>
<p>Die kanonische Ordnung der Ausdr&uuml;cke wird modifiziert durch die Funktionen
<code><a href="#ordergreat">ordergreat</a></code> und <code><a href="#orderless">orderless</a></code> sowie der Deklarationen
<code><a href="#mainvar">mainvar</a></code>, <code><a href="maxima_63.html#constant">constant</a></code> und <code><a href="maxima_63.html#scalar">scalar</a></code>.
</p>
<p>Siehe auch <code><a href="maxima_21.html#sort">sort</a></code>.
</p>
<p>Beispiele:
</p>
<p>Ordne Symbole und Konstanten.  <code><a href="maxima_18.html#g_t_0025pi">%pi</a></code> wird nicht nach dem numerischen Wert
sortiert, sondern wie eine Konstante.
</p>
<div class="example">
<pre class="example">(%i1) stringdisp : true;
(%o1)                         true
(%i2) sort ([%pi, 3b0, 3.0, x, X, &quot;foo&quot;, 3, a, &quot;bar&quot;, 4.0, 4b0]);
(%o2) [3, 3.0, 4.0, 3.0b0, 4.0b0, %pi, &quot;bar&quot;, &quot;foo&quot;, a, x, X]
</pre></div>

<p>Anwendung der Funktionen <code>ordergreat</code> und <code>orderless</code>.
</p>
<div class="example">
<pre class="example">(%i1) sort ([M, H, K, T, E, W, G, A, P, J, S]);
(%o1)           [A, E, G, H, J, K, M, P, S, T, W]
(%i2) ordergreat (S, J);
(%o2)                         done
(%i3) orderless (M, H);
(%o3)                         done
(%i4) sort ([M, H, K, T, E, W, G, A, P, J, S]);
(%o4)           [M, H, A, E, G, K, P, T, W, J, S]
</pre></div>

<p>Anwendung der Deklarationen <code>mainvar</code>, <code>constant</code> und <code>scalar</code>.
</p>
<div class="example">
<pre class="example">(%i1) sort ([aa, foo, bar, bb, baz, quux, cc, dd, A1, B1, C1]);
(%o1)   [aa, bar, baz, bb, cc, dd, foo, quux, A1, B1, C1]
(%i2) declare (aa, mainvar);
(%o2)                         done
(%i3) declare ([baz, quux], constant);
(%o3)                         done
(%i4) declare ([A1, B1], scalar);
(%o4)                         done
(%i5) sort ([aa, foo, bar, bb, baz, quux, cc, dd, A1, B1, C1]);
(%o5)   [baz, quux, A1, B1, bar, bb, cc, dd, foo, C1, aa]
</pre></div>

<p>Ordne nicht atomare Ausdr&uuml;cke.
</p>
<div class="example">
<pre class="example">(%i1) sort ([f(1), f(2), f(2, 1), g(1), g(1, 2), g(n), f(n, 1)]);
(%o1) [f(1), g(1), g(1, 2), f(2), f(2, 1), g(n), f(n, 1)]
(%i2) sort ([foo(1), X[1], X[k], foo(k), 1, k]);
(%o2)            [1, foo(1), X , k, foo(k), X ]
                              1              k
</pre></div>
</dd></dl>

<a name="ordermagnitudep"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fordermagnitudep"></a><dl>
<dt><a name="index-ordermagnitudep"></a>Funktion: <strong>ordermagnitudep</strong> <em>(<var>expr_1</var>, <var>expr_2</var>)</em></dt>
<dd>
<p>Ist eine Aussagefunktion, die das Ergebnis <code>true</code> hat, wenn die Argumente
<var>expr_1</var> und <var>expr_2</var> Zahlen, Konstante oder konstante Ausdr&uuml;cke
repr&auml;sentieren und <var>expr_1</var> kleiner als <var>expr_2</var> ist.  Sind die
Argumente nicht der Gr&ouml;&szlig;e nach vergleichbar, wird die Ordnung durch die
Aussagefunktion <code><a href="#orderlessp">orderlessp</a></code> bestimmt.
</p>
<p>Wird die Aussagefunktion <code>ordermagnitudep</code> als Argument der Funktion 
<code><a href="maxima_21.html#sort">sort</a></code> verwendet, werden die Elemente einer Liste nach der Gr&ouml;&szlig;e
sortiert.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) ordermagnitudep(1, 2);
(%o1)                         true
(%i2) ordermagnitudep(%e, %pi);
(%o2)                         true
(%i3) sort([%e, %pi, sin(1), 0, 1, 2, 3, 4]);
(%o3)           [0, 1, 2, 3, 4, %e, %pi, sin(1)]
(%i4) sort([%e, %pi, sin(1), 0, 1, 2, 3, 4], ordermagnitudep);
(%o4)           [0, sin(1), 1, 2, %e, 3, %pi, 4]
</pre></div>
</dd></dl>

<a name="part"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fpart"></a><dl>
<dt><a name="index-part"></a>Funktion: <strong>part</strong> <em>(<var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</em></dt>
<dd>
<p>Die Funktion <code>part</code> gibt einen Teilausdruck des Ausdrucks <var>expr</var>
zur&uuml;ck.  Der Ausdruck <var>expr</var> wird zuvor in das Format f&uuml;r die Anzeige
umgewandelt.
</p>
<p>Der Teilausdruck wird durch die Indizes <var>n_1</var>, &hellip;, <var>n_k</var> 
ausgew&auml;hlt.  Zuerst wird der Teilausdruck <var>n_1</var> ermittelt, von diesem der
Teilausdruck <var>n_2</var>, u.s.w.  Der zum Index <var>n_k</var> zuletzt gewonnene 
Teilausdruck ist dann das Ergebnis.
</p>
<p><code>part</code> kann auch verwendet werden, um ein Element einer Liste oder die
Zeile einer Matrix zu erhalten.
</p>
<p>Das letzte Argument einer <code>part</code>-Funktion kann eine Liste mit Indizes sein.
In diesem Fall werden alle angegebenen Teilausdr&uuml;cke als Ergebnis
zur&uuml;ckgegeben.  Zum Beispiel hat das Kommando <code>part(x + y + z, [1, 3])</code>
das Ergebnis <code>z+x</code>.
</p>
<p>Die Systemvariable <code><a href="#piece">piece</a></code> enth&auml;lt den letzten Ausdruck, der bei der
Verwendung einer <code>part</code>-Funktion ausgew&auml;hlt wurde.
</p>
<p>Hat die Optionsvariable <code><a href="#partswitch">partswitch</a></code> den Wert <code>true</code>, wird <code>end</code>
zur&uuml;ckgegeben, wenn versucht wurde, einen Teilausdruck zu bilden, der nicht
existiert, andernfalls wird eine Fehlermeldung ausgegeben.
</p>
<p>Siehe auch <code><a href="#inpart">inpart</a></code>, <code><a href="#substpart">substpart</a></code>, <code><a href="#substinpart">substinpart</a></code>,<!-- /@w -->
<code><a href="#dpart">dpart</a></code> und <code><a href="#lpart">lpart</a></code>.
</p> 
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) part(z+2*y+a,2);
(%o1)                                 2 y
(%i2) part(z+2*y+a,[1,3]);
(%o2)                                z + a
(%i3) part(z+2*y+a,2,1);
(%o3)                                  2
</pre></div>

<p><code>example(part)</code> zeigt weitere Beispiele.
</p></dd></dl>

<a name="partition"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fpartition"></a><dl>
<dt><a name="index-partition"></a>Funktion: <strong>partition</strong> <em>(<var>expr</var>, <var>var</var>)</em></dt>
<dd>
<p>Die Funktion <code>partition</code> gibt eine Liste mit zwei Ausdr&uuml;cken zur&uuml;ck.
Ist das Argument <var>expr</var> ein Produkt enth&auml;lt das erste Element die
Faktoren, die die Variable <code>var</code> enthalten, und das zweite Element
enth&auml;lt die &uuml;brigen Faktoren.  Entsprechend enth&auml;lt das erste Element die
Terme einer Summe oder die Elemente einer Liste, die die Variable <var>var</var>
enthalten, und das zweite Elemente die verbleibende Terme der Summe oder
Elemente der Liste.
</p>
<div class="example">
<pre class="example">(%i1) partition (2*a*x*f(x), x);
(%o1)                     [2 a, x f(x)]
(%i2) partition (a+b, x);
(%o2)                      [b + a, 0]
(%i3) partition ([a, b, f(a), c], a); 
(%o3)                  [[b, c], [a, f(a)]]
</pre></div>
</dd></dl>

<a name="partswitch"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002fpartswitch"></a><dl>
<dt><a name="index-partswitch"></a>Optionsvariable: <strong>partswitch</strong></dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>partswitch</code> den Wert <code>true</code>, wird <code>end</code> 
zur&uuml;ckgegeben, wenn versucht wird, einen Teilausdruck zu bilden, der nicht
existiert, andernfalls wird eine Fehlermeldung ausgegeben.
</p></dd></dl>

<a name="pickapart"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fpickapart"></a><dl>
<dt><a name="index-pickapart"></a>Funktion: <strong>pickapart</strong> <em>(<var>expr</var>, <var>n</var>)</em></dt>
<dd>
<p>Den Teilausdr&uuml;cken in einer Tiefe <var>n</var> eines verschachtelten Ausdrucks 
werden Zwischenmarken zugewiesen.  <var>n</var> ist eine ganze positive Zahl.  Die 
R&uuml;ckgabe von <code>pickapart</code> ist ein &auml;quivalenter Ausdruck, der die 
Zwischenmarken enth&auml;lt.
</p>
<p>Siehe auch <code><a href="#part">part</a></code>, <code><a href="#dpart">dpart</a></code>, <code><a href="#lpart">lpart</a></code>,<!-- /@w -->
<code><a href="#inpart">inpart</a></code> und <code><a href="#reveal">reveal</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) expr: (a+b)/2 + sin (x^2)/3 - log (1 + sqrt(x+1));
</pre><pre class="example">                                          2
                                     sin(x )   b + a
(%o1)       - log(sqrt(x + 1) + 1) + ------- + -----
                                        3        2
</pre><pre class="example">(%i2) pickapart (expr, 0);

                                          2
                                     sin(x )   b + a
(%t2)       - log(sqrt(x + 1) + 1) + ------- + -----
                                        3        2

(%o2)                          %t2
(%i3) pickapart (expr, 1);

(%t3)                - log(sqrt(x + 1) + 1)


                                  2
                             sin(x )
(%t4)                        -------
                                3


                              b + a
(%t5)                         -----
                                2

(%o5)                    %t5 + %t4 + %t3
(%i5) pickapart (expr, 2);

(%t6)                 log(sqrt(x + 1) + 1)


                                  2
(%t7)                        sin(x )


(%t8)                         b + a

                         %t8   %t7
(%o8)                    --- + --- - %t6
                          2     3
(%i8) pickapart (expr, 3);

(%t9)                    sqrt(x + 1) + 1


                                2
(%t10)                         x

</pre><pre class="example">                  b + a              sin(%t10)
(%o10)            ----- - log(%t9) + ---------
                    2                    3
</pre><pre class="example">(%i10) pickapart (expr, 4);

(%t11)                     sqrt(x + 1)

                      2
                 sin(x )   b + a
(%o11)           ------- + ----- - log(%t11 + 1)
                    3        2
(%i11) pickapart (expr, 5);

(%t12)                        x + 1

                   2
              sin(x )   b + a
(%o12)        ------- + ----- - log(sqrt(%t12) + 1)
                 3        2
(%i12) pickapart (expr, 6);
                  2
             sin(x )   b + a
(%o12)       ------- + ----- - log(sqrt(x + 1) + 1)
                3        2
</pre></div>
</dd></dl>

<a name="piece"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002fpiece"></a><dl>
<dt><a name="index-piece"></a>Systemvariable: <strong>piece</strong></dt>
<dd>
<p>Die Systemvariable <code>piece</code> enth&auml;lt den letzten Ausdruck, der bei der 
Verwendung einer <code>part</code>-Funktion ausgew&auml;hlt wurde.
</p>
<p>Siehe auch <code><a href="#part">part</a></code> und <code><a href="#inpart">inpart</a></code>.
</p></dd></dl>

<a name="psubst"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fpsubst"></a><dl>
<dt><a name="index-psubst"></a>Funktion: <strong>psubst</strong> <em>(<var>list</var>, <var>expr</var>)</em></dt>
<dt><a name="index-psubst-1"></a>Funktion: <strong>psubst</strong> <em>(<var>a</var>, <var>b</var>, <var>expr</var>)</em></dt>
<dd>
<p><code>psubst(<var>a</var>, <var>b</var>, <var>expr</var>)</code> ist identisch mit <code>subst</code>.
Siehe <code><a href="#subst">subst</a></code>.
</p>
<p>Im Unterschied zu <code>subst</code> f&uuml;hrt die Funktion <code>psubst</code> Substitutionen
parallel aus, wenn das erste Argument <var>list</var> eine Liste mit Gleichungen ist.
</p>
<p>Siehe auch die Funktion <code><a href="#sublis">sublis</a></code>, um Substitutionen parallel
auszuf&uuml;hren.
</p>
<p>Beispiel:
</p>
<p>Das erste Beispiel zeigt die parallele Substitution mit <code>psubst</code>.  Das 
zweite Beispiel zeigt das Ergebnis f&uuml;r die Funktion <code>subst</code>.  In diesem
Fall werden die Substitutionen nacheinander ausgef&uuml;hrt.
</p>
<div class="example">
<pre class="example">(%i4) psubst ([a^2=b, b=a], sin(a^2) + sin(b));
(%o4)                           sin(b) + sin(a)
(%i5) subst ([a^2=b, b=a], sin(a^2) + sin(b));
(%o5)                              2 sin(a)
</pre></div>
</dd></dl>

<a name="rembox"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002frembox"></a><dl>
<dt><a name="index-rembox"></a>Funktion: <strong>rembox</strong> <em>(<var>expr</var>, unlabelled)</em></dt>
<dt><a name="index-rembox-1"></a>Funktion: <strong>rembox</strong> <em>(<var>expr</var>, <var>label</var>)</em></dt>
<dt><a name="index-rembox-2"></a>Funktion: <strong>rembox</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Die Funktion <code>rembox</code> entfernt Rahmen aus dem Ausdruck <var>expr</var>.
<code>rembox(<var>expr</var>, unlabelled)</code> entfernt alle Rahmen, die keine Marke 
haben.  <code>rembox(<var>expr</var>, <var>label</var>)</code> entfernt nur Rahmen, die mit der 
Marke <var>label</var> gekennzeichnet sind.  <code>rembox(<var>expr</var>)</code> entfernt alle 
Rahmen.
</p>
<p>Rahmen werden mit den Funktionen <code><a href="#box">box</a></code>, <code><a href="#dpart">dpart</a></code> und
<code><a href="#lpart">lpart</a></code> einem Ausdruck hinzugef&uuml;gt.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) expr: (a*d - b*c)/h^2 + sin(%pi*x);
                                  a d - b c
(%o1)                sin(%pi x) + ---------
                                      2
                                     h

(%i2) dpart (dpart (expr, 1, 1), 2, 2);
                        &quot;&quot;&quot;&quot;&quot;&quot;&quot;    a d - b c
(%o2)               sin(&quot;%pi x&quot;) + ---------
                        &quot;&quot;&quot;&quot;&quot;&quot;&quot;      &quot;&quot;&quot;&quot;
                                     &quot; 2&quot;
                                     &quot;h &quot;
                                     &quot;&quot;&quot;&quot;

(%i3) expr2: lpart (BAR, lpart (FOO, %, 1), 2);
                  FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                  &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   &quot;a d - b c&quot;
(%o3)             &quot;sin(&quot;%pi x&quot;)&quot; + &quot;---------&quot;
                  &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   &quot;  &quot;&quot;&quot;&quot;   &quot;
                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;  &quot; 2&quot;   &quot;
                                   &quot;  &quot;h &quot;   &quot;
                                   &quot;  &quot;&quot;&quot;&quot;   &quot;
                                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;

(%i4) rembox (expr2, unlabelled);
</pre><pre class="example">                                  BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                   FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;a d - b c&quot;
(%o4)              &quot;sin(%pi x)&quot; + &quot;---------&quot;
                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;    2    &quot;
                                  &quot;   h     &quot;
                                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;

</pre><pre class="example">(%i5) rembox (expr2, FOO);
</pre><pre class="example">                                  BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                       &quot;&quot;&quot;&quot;&quot;&quot;&quot;    &quot;a d - b c&quot;
(%o5)              sin(&quot;%pi x&quot;) + &quot;---------&quot;
                       &quot;&quot;&quot;&quot;&quot;&quot;&quot;    &quot;  &quot;&quot;&quot;&quot;   &quot;
                                  &quot;  &quot; 2&quot;   &quot;
                                  &quot;  &quot;h &quot;   &quot;
                                  &quot;  &quot;&quot;&quot;&quot;   &quot;
                                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;

</pre><pre class="example">(%i6) rembox (expr2, BAR);
</pre><pre class="example">                   FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                   &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   a d - b c
(%o6)              &quot;sin(&quot;%pi x&quot;)&quot; + ---------
                   &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;     &quot;&quot;&quot;&quot;
                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;     &quot; 2&quot;
                                      &quot;h &quot;
                                      &quot;&quot;&quot;&quot;

</pre><pre class="example">(%i7) rembox (expr2);
                                  a d - b c
(%o7)                sin(%pi x) + ---------
                                      2
                                     h
</pre></div>
</dd></dl>

<a name="reveal"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002freveal"></a><dl>
<dt><a name="index-reveal"></a>Funktion: <strong>reveal</strong> <em>(<var>expr</var>, <var>depth</var>)</em></dt>
<dd>
<p>Ersetzt Teile des Ausdrucks <var>expr</var> in der ganzzahligen Tiefe <var>depth</var> 
durch eine beschreibende Zusammenfassung:
</p>
<ul>
<li> Summen und Differenzen werden durch <code>Sum(<var>n</var>)</code> ersetzt, wobei <var>n</var>
die Anzahl der Terme der Summe oder Differenz ist.

</li><li> Produkte werden durch <code>Product(<var>n</var>)</code> ersetzt, wobei <var>n</var> die Anzahl
der Faktoren des Produktes ist.

</li><li> Exponentiationen werden durch <code>Expt</code> ersetzt.

</li><li> Quotienten werden durch <code>Quotient</code> ersetzt.

</li><li> Die Negation wird durch <code>Negterm</code> ersetzt.

</li><li> Listen werden durch <code>List(<var>n</var>)</code> ersetzt, wobei <var>n</var> die Anzahl der 
Elemente der Liste ist.
</li></ul>

<p>Ist <var>depth</var> gr&ouml;&szlig;er oder gleich der maximalen Tiefe des Ausdrucks 
<var>expr</var>, gibt <code>reveal</code> den Ausdruck <var>expr</var> unver&auml;ndert zur&uuml;ck.
</p>
<p><code>reveal</code> wertet die Argumente aus.  <code>reveal</code> gibt die 
Zusammenfassung zur&uuml;ck.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) e: expand ((a - b)^2)/expand ((exp(a) + exp(b))^2);
</pre><pre class="example">                          2            2
                         b  - 2 a b + a
(%o1)               -------------------------
                        b + a     2 b     2 a
                    2 %e      + %e    + %e
</pre><pre class="example">(%i2) reveal (e, 1);
(%o2)                       Quotient
(%i3) reveal (e, 2);
                             Sum(3)
(%o3)                        ------
                             Sum(3)
(%i4) reveal (e, 3);
                     Expt + Negterm + Expt
(%o4)               ------------------------
                    Product(2) + Expt + Expt
(%i5) reveal (e, 4);
                       2                 2
                      b  - Product(3) + a
(%o5)         ------------------------------------
                         Product(2)     Product(2)
              2 Expt + %e           + %e
(%i6) reveal (e, 5);
                         2            2
                        b  - 2 a b + a
(%o6)              --------------------------
                       Sum(2)     2 b     2 a
                   2 %e       + %e    + %e
(%i7) reveal (e, 6);
                          2            2
                         b  - 2 a b + a
(%o7)               -------------------------
                        b + a     2 b     2 a
                    2 %e      + %e    + %e
</pre></div>
</dd></dl>

<a name="sublis"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fsublis"></a><dl>
<dt><a name="index-sublis"></a>Funktion: <strong>sublis</strong> <em>(<var>list</var>, <var>expr</var>)</em></dt>
<dd>
<p>F&uuml;hrt im Unterschied zu der Funktion <code><a href="#subst">subst</a></code> die Substitutionen der
Liste <var>list</var> parallel und nicht nacheinander aus.
</p>
<p>Mit der Optionsvariablen <code><a href="#sublis_005fapply_005flambda">sublis_apply_lambda</a></code> wird die Vereinfachung
von Lamda-Ausdr&uuml;cken kontrolliert, nachdem die Substitution ausgef&uuml;hrt 
wurde.
</p>
<p>Siehe auch die Funktion <code><a href="#psubst">psubst</a></code>, um parallele Substitutionen
auszuf&uuml;hren.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) sublis ([a=b, b=a], sin(a) + cos(b));
(%o1)                    sin(b) + cos(a)
</pre></div>
</dd></dl>

<a name="sublis_005fapply_005flambda"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002fsublis_005fapply_005flambda"></a><dl>
<dt><a name="index-sublis_005fapply_005flambda"></a>Optionsvariable: <strong>sublis_apply_lambda</strong></dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Kontrolliert, ob Lambda-Ausdr&uuml;cke nach einer Substitution ausgewertet werden.
Hat <code>sublis_apply_lambda</code> den Wert <code>true</code> werden Lambda-Ausdr&uuml;cke
ausgewertet.  Ansonsten verbleiben diese nach der Substitution im Ausdruck.
</p></dd></dl>

<a name="subnumsimp"></a><a name="Item_003a-Expressions_002ede_002fdefvr_002fsubnumsimp"></a><dl>
<dt><a name="index-subnumsimp"></a>Option variable: <strong>subnumsimp</strong></dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>true</code> then the functions <code><a href="#subst">subst</a></code> and <code><a href="#psubst">psubst</a></code> can substitute
a subscripted variable <code>f[x]</code> with a number, when only the symbol <code>f</code>
is given.
</p>
<p>See also <code><a href="#subst">subst</a></code>.
</p>
<div class="example">
<pre class="example">(%i1) subst(100,g,g[x]+2);

subst: cannot substitute 100 for operator g in expression g
                                                           x
 -- an error. To debug this try: debugmode(true);

(%i2) subst(100,g,g[x]+2),subnumsimp:true;
(%o2)                          102
</pre></div>
</dd></dl>

<a name="subst"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fsubst"></a><dl>
<dt><a name="index-subst"></a>Funktion: <strong>subst</strong> <em>(<var>a</var>, <var>b</var>, <var>c</var>)</em></dt>
<dd>
<p>Substituiert <var>a</var> f&uuml;r <var>b</var> in den Ausdruck <var>c</var>.  Das Argument 
<var>b</var> muss ein Atom oder ein vollst&auml;ndiger Teilausdruck von <var>c</var> sein.
Zum Beispiel ist <code>x+y+z</code> ein vollst&auml;ndiger Teilausdruck von
<code>2*(x+y+z)/w</code>, nicht aber <code>x+y</code>.  Hat <var>b</var> nicht diese Eigenschaft,
dann k&ouml;nnen m&ouml;glicherweise die Funktionen <code><a href="#substpart">substpart</a></code> oder 
<code><a href="maxima_101.html#ratsubst">ratsubst</a></code> angewendet werden.
</p>
<p>Hat <var>b</var> die Form <code>e/f</code>, kann <code>subst(a*f, e, c)</code> verwendet werden.
Ist <code>b</code> von der Form <code>e^(1/f)</code>, dann kann <code>subst(a^f, e, c)</code>
verwendet werden.  Die Funktion <code>subst</code> erkennt auch den Ausdruck 
<code>x^y</code> in <code>x^-y</code>, so dass <code>subst(a, sqrt(x), 1/sqrt(x))</code> das
Ergebnis <code>1/a</code> hat.  <var>a</var> und <var>b</var> k&ouml;nnen auch die Namen von 
Operatoren oder Funktionen sein.  Soll die unabh&auml;ngige Variable in
Ausdr&uuml;cken mit Ableitungen substituiert werden, sollte die Funktion
<code><a href="maxima_90.html#at">at</a></code> verwendet werden.
</p>
<p><code>subst</code> ist der Alias-Name f&uuml;r <code>substitute</code>.
</p>
<p><code>subst(<var>eq_1</var>, <var>expr</var>)</code> und <code>subst([<var>eq_1</var>, ..., 
<var>eq_k</var>], <var>expr</var>)</code> sind weitere m&ouml;gliche Formen.  <var>eq_i</var> sind
Gleichungen, die angeben, welche Substitutionen auszuf&uuml;hren sind.  F&uuml;r 
jede Gleichung wird die rechte Seite der Gleichung f&uuml;r die linke Seite in den
Ausdruck <var>expr</var> substituiert.
</p>
<p>Hat die Optionsvariable <code><a href="#exptsubst">exptsubst</a></code> den Wert <code>true</code>, wird eine
Substitution wie <code>y</code> f&uuml;r <code>%e^x</code> in einem Ausdruck der Form 
<code>%e^(a*x)</code> nicht ausgef&uuml;hrt.
</p>
<p>Hat die Optionsvariable <code><a href="#option_005fopsubst">opsubst</a></code> den Wert <code>false</code>,
f&uuml;hrt die Funktion <code>subst</code> keine Substitution in einen Operator eines
Ausdrucks aus.  Zum Beispiel hat <code>(opsubst: false, subst(x^2, r, r+r[0]))</code>
das Ergebnis <code>x^2+r[0]</code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) subst (a, x+y, x + (x+y)^2 + y);
                                    2
(%o1)                      y + x + a
(%i2) subst (-%i, %i, a + b*%i);
(%o2)                       a - %i b
</pre></div>

<p>Weitere Beispiele werden mit <code>example(subst)</code> angezeigt.
</p></dd></dl>

<a name="substinpart"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fsubstinpart"></a><dl>
<dt><a name="index-substinpart"></a>Funktion: <strong>substinpart</strong> <em>(<var>x</var>, <var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</em></dt>
<dd>
<p>Die Funktion <code>substinpart</code> ist vergleichbar mit <code><a href="#substpart">substpart</a></code>.<!-- /@w -->
<code>substinpart</code> wirkt jedoch auf die interne Darstellung des Ausdrucks 
<var>expr</var>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) x . 'diff (f(x), x, 2);
</pre><pre class="example">                              2
                             d
(%o1)                   x . (--- (f(x)))
                               2
                             dx
</pre><pre class="example">(%i2) substinpart (d^2, %, 2);
                                  2
(%o2)                        x . d
(%i3) substinpart (f1, f[1](x + 1), 0);
(%o3)                       f1(x + 1)
</pre></div>
</dd></dl>

<a name="substpart"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fsubstpart"></a><dl>
<dt><a name="index-substpart"></a>Funktion: <strong>substpart</strong> <em>(<var>x</var>, <var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</em></dt>
<dd>
<p>Substituiert <var>x</var> f&uuml;r den Teilausdruck, der mit den restlichen Argumenten 
der Funktion <code>substpart</code> ausgew&auml;hlt wird.  Es wird der neue Ausdruck 
<var>expr</var> zur&uuml;ckgegeben.  <var>x</var> kann auch der Name eines Operators sein,
der f&uuml;r einen Operator im Ausdruck <var>expr</var> substituiert wird.  Zum Beispiel
hat <code>substpart(&quot;+&quot;, a*b, 0)</code> das Ergebnis <code>b + a</code>).
</p>
<p>Mit dem Wert <code>true</code> f&uuml;r die Optionsvariable <code><a href="#inflag">inflag</a></code>, verh&auml;lt
sich die Funktion <code>substpart</code> wie <code><a href="#substinpart">substinpart</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) 1/(x^2 + 2);
                               1
(%o1)                        ------
                              2
                             x  + 2
(%i2) substpart (3/2, %, 2, 1, 2);
</pre><pre class="example">                               1
(%o2)                       --------
                             3/2
                            x    + 2
</pre><pre class="example">(%i3) a*x + f(b, y);
(%o3)                     a x + f(b, y)
(%i4) substpart (&quot;+&quot;, %, 1, 0);
(%o4)                    x + f(b, y) + a
</pre></div>
</dd></dl>

<a name="symbolp"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fsymbolp"></a><dl>
<dt><a name="index-symbolp"></a>Funktion: <strong>symbolp</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Gibt <code>true</code> zur&uuml;ck, wenn <var>expr</var> ein Symbol ist, ansonsten 
<code>false</code>.  Das Kommando <code>symbolp(x)</code> ist &auml;quivalent zu
<code>atom(x) and not numberp(x)</code>.
</p>
<p>Siehe auch <a href="maxima_31.html#Bezeichner">Bezeichner</a>.
</p></dd></dl>

<a name="unorder"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002funorder"></a><dl>
<dt><a name="index-unorder"></a>Funktion: <strong>unorder</strong> <em>()</em></dt>
<dd>
<p>L&ouml;scht die Ordnung, die mit dem letzten Aufruf der Funktionen 
<code>ordergreat</code> oder <code>orderless</code> erzeugt wurde.
</p>
<p>Siehe auch <code><a href="#ordergreat">ordergreat</a></code> und <code><a href="#orderless">orderless</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) unorder();
(%o1)                          []
(%i2) b*x + a^2;
                                   2
(%o2)                       b x + a
(%i3) ordergreat (a);
(%o3)                         done
(%i4) b*x + a^2;
 %th(1) - %th(3);
                             2
(%o4)                       a  + b x
(%i5) unorder();
                              2    2
(%o5)                        a  - a
</pre></div>
</dd></dl>

<a name="verbify"></a><a name="Item_003a-Expressions_002ede_002fdeffn_002fverbify"></a><dl>
<dt><a name="index-verbify"></a>Funktion: <strong>verbify</strong> <em>(<var>f</var>)</em></dt>
<dd>
<p>Gibt das Verb des Symbols <var>f</var> zur&uuml;ck.  Siehe auch das Kapitel
<a href="maxima_30.html#Substantive-und-Verben">Substantive und Verben</a>, sowie <code><a href="#noun">noun</a></code> und <code><a href="#nounify">nounify</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) verbify ('foo);
(%o1)                          foo
(%i2) :lisp $%
$FOO
(%i2) nounify (foo);
(%o2)                          foo
(%i3) :lisp $%
%FOO
</pre></div>
</dd></dl>



<hr>
<div class="header">
<p>
Previous: <a href="maxima_31.html#Bezeichner" accesskey="p" rel="previous">Bezeichner</a>, Nach oben: <a href="maxima_28.html#Ausdr_00fccke" accesskey="u" rel="up">Ausdr&uuml;cke</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Inhaltsverzeichnis" rel="contents">Inhalt</a>][<a href="maxima_334.html#Index-der-Variablen-und-Funktionen" title="Index" rel="index">Index</a>]</p>
</div>



</body>
</html>
