<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 5.1, http://www.gnu.org/software/texinfo/ -->
<head>
<title>Maxima Manual: Funktionen und Variablen f&uuml;r Listen</title>

<meta name="description" content="Maxima Manual: Funktionen und Variablen f&uuml;r Listen">
<meta name="keywords" content="Maxima Manual: Funktionen und Variablen f&uuml;r Listen">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="maxima_toc.html#Top" rel="start" title="Top">
<link href="maxima_334.html#Index-der-Variablen-und-Funktionen" rel="index" title="Index der Variablen und Funktionen">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="Inhaltsverzeichnis">
<link href="maxima_19.html#Listen" rel="up" title="Listen">
<link href="maxima_22.html#Arrays" rel="next" title="Arrays">
<link href="maxima_20.html#Einf_00fchrung-in-Listen" rel="previous" title="Einf&uuml;hrung in Listen">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
blockquote.smallquotation {font-size: smaller}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
div.indentedblock {margin-left: 3.2em}
div.lisp {margin-left: 3.2em}
div.smalldisplay {margin-left: 3.2em}
div.smallexample {margin-left: 3.2em}
div.smallindentedblock {margin-left: 3.2em; font-size: smaller}
div.smalllisp {margin-left: 3.2em}
kbd {font-style:oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: inherit; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: inherit; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.nocodebreak {white-space:nowrap}
span.nolinebreak {white-space:nowrap}
span.roman {font-family:serif; font-weight:normal}
span.sansserif {font-family:sans-serif; font-weight:normal}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="figures/favicon.ico">

</head>

<body lang="de" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">
<a name="Funktionen-und-Variablen-f_00fcr-Listen"></a>
<div class="header">
<p>
Previous: <a href="maxima_20.html#Einf_00fchrung-in-Listen" accesskey="p" rel="previous">Einf&uuml;hrung in Listen</a>, Nach oben: <a href="maxima_19.html#Listen" accesskey="u" rel="up">Listen</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Inhaltsverzeichnis" rel="contents">Inhalt</a>][<a href="maxima_334.html#Index-der-Variablen-und-Funktionen" title="Index" rel="index">Index</a>]</p>
</div>
<a name="Funktionen-und-Variablen-fur-Listen"></a>
<h4 class="subsection">5.4.2 Funktionen und Variablen f&uuml;r Listen</h4>

<a name="g_t_005b"></a><a name="g_t_005d"></a><a name="Item_003a-Lists_002ede_002fdefvr_002f_005b"></a><dl>
<dt><a name="index-_005b"></a>Operator: <strong>[</strong></dt>
<dd><a name="Item_003a-Lists_002ede_002fdefvr_002f_005d"></a></dd><dt><a name="index-_005d"></a>Operator: <strong>]</strong></dt>
<dd>
<p>Die Operatoren <code>[</code> und <code>]</code> markieren den Anfang und das Ende einer
Liste.
</p>
<p><code>[</code> und <code>]</code> schlie&szlig;en auch die Indizes von Symbolen, Arrays, 
Hash-Arrays oder Array-Funktionen ein.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) x: [a, b, c];
(%o1)                       [a, b, c]
(%i2) x[3];
(%o2)                           c
(%i3) array (y, fixnum, 3);
(%o3)                           y
(%i4) y[2]: %pi;
(%o4)                          %pi
(%i5) y[2];
(%o5)                          %pi
(%i6) z['foo]: 'bar;
(%o6)                          bar
(%i7) z['foo];
(%o7)                          bar
(%i8) g[k] := 1/(k^2+1);
                                  1
(%o8)                     g  := ------
                           k     2
                                k  + 1
(%i9) g[10];
                                1
(%o9)                          ---
                               101
</pre></div>
</dd></dl>

<a name="append"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fappend"></a><dl>
<dt><a name="index-append"></a>Funktion: <strong>append</strong> <em>(<var>list_1</var>, &hellip;, <var>list_n</var>)</em></dt>
<dd>
<p>Gibt eine Liste mit den Elementen der Listen <var>list_1</var>, &hellip;, <var>list_n</var>
zur&uuml;ck.  Ist eines der Argumente <var>list_1</var>, &hellip;, <var>list_n</var> keine
Liste meldet Maxima einen Fehler.
</p>
<p><code>append</code> kann auch f&uuml;r allgemeine Ausdr&uuml;cke genutzt werden.
So hat zum Beispiel <code>append(f(a,b), f(c,d,e))</code> das Ergebnis
<code>f(a,b,c,d,e)</code>.  In diesem Fall muss der Operator, der hier <code>f</code> ist,
f&uuml;r beide Ausdr&uuml;cke identisch sein, ansonsten meldet Maxima einen Fehler.
</p>
<p>Siehe auch die Funktionen <code><a href="#cons">cons</a></code> und <code><a href="#endcons">endcons</a></code>, um ein Element
einer Liste hinzuzuf&uuml;gen.
</p>
<p>Beispiele:
</p>
<p>In den ersten Beispielen werden jeweils Listen mit verschiedenen Elementen
zusammengef&uuml;gt.  Im letzten Beispiel wird <code>append</code> genutzt, um zwei
Additionen zusammenzusetzen.
</p>
<div class="example">
<pre class="example">(%i1) append([a,b], [x,y,z], [1]);
(%o1)                  [a, b, x, y, z, 1]
(%i2) append([x+y, 0, -3.2], [2.5e+20, x]);
(%o2)             [y + x, 0, - 3.2, 2.5e+20, x]
(%i3) append([2*a+b], [x+y]);
(%o3)                   [b + 2 a, y + x]
(%i4) append(2*a+b, x+y);
(%o4)                    y + x + b + 2 a
</pre></div>
</dd></dl>

<a name="assoc"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fassoc"></a><dl>
<dt><a name="index-assoc"></a>Funktion: <strong>assoc</strong> <em>(<var>key</var>, <var>list</var>, <var>default</var>)</em></dt>
<dt><a name="index-assoc-1"></a>Funktion: <strong>assoc</strong> <em>(<var>key</var>, <var>list</var>)</em></dt>
<dd>
<p>Ist das Argument <code>list</code> eine Liste mit paarweisen Elementen der Form
<code>[[key_1, value_1], [key_2, value_2], ...]</code>, wobei <var>key_i</var> ein
Schl&uuml;ssel und <var>value_i</var> der dazugeh&ouml;rige Wert ist, dann gibt die
Funktion <code>assoc</code> den zum Schl&uuml;ssel <var>key</var> geh&ouml;renden Wert
<code>value</code> zur&uuml;ck.  Wird der Schl&uuml;ssel nicht gefunden, wird das Argument
<code>default</code> zur&uuml;ckgegeben, wenn es vorhanden ist, oder der Wert
<code>false</code>.
</p>
<p>Anstatt Paare <code>[key_i, value_i]</code> k&ouml;nnen auch allgemeine Ausdr&uuml;cke in 
der Liste enthalten sein, die zwei Argumente haben.  Zum Beispiel sind 
Eintr&auml;ge der Form <code>x=1</code> oder <code>a^b</code> m&ouml;glich.  Im ersten Fall ist 
<code>x</code> der Schl&uuml;ssel und im zweiten Fall <code>a</code>.  Die Werte sind jeweils 
<code>1</code> und <code>b</code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) l : [[info, 10], [warn, 20], [err, 30]];
(%o1)          [[info, 10], [warn, 20], [err, 30]]
(%i2) assoc(info, l);
(%o2)                          10
(%i3) assoc(warn, l);
(%o3)                          20
(%i4) assoc(err, l);
(%o4)                          30
(%i5) l : [x+y, a^(2*b), sin(x) = 0.5];
                            2 b
(%o5)              [y + x, a   , sin(x) = 0.5]
(%i6) assoc(x, l);
(%o6)                           y
(%i7) assoc(y, l);
(%o7)                         false
(%i8) assoc(a, l);
(%o8)                          2 b
(%i9) assoc(sin(x), l);
(%o9)                          0.5
</pre></div>
</dd></dl>

<a name="cons"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fcons"></a><dl>
<dt><a name="index-cons"></a>Funktion: <strong>cons</strong> <em>(<var>expr</var>, <var>list</var>)</em></dt>
<dd>
<p>F&uuml;gt den Ausdruck <var>expr</var> als erstes Element der Liste <var>list</var> hinzu.
</p>
<p><code>cons</code> arbeitet auch mit allgemeinen Ausdr&uuml;cken als Argument <var>list</var>.
In diesem Fall wird dem Hauptoperator des Arguments <var>list</var> der Ausdruck
<var>expr</var> als erstes Argument hinzugef&uuml;gt.
</p>
<p>Siehe auch die Funktion <code><a href="#endcons">endcons</a></code>, um ein Element an das Ende einer
Liste anzuh&auml;ngen sowie die Funktion <code><a href="#append">append</a></code>, um zwei Listen
zusammenzuf&uuml;gen.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) cons(x, [a, b, c]);
(%o1)                     [x, a, b, c]
(%i2) cons(x^2+1, [a, b, c]);
                          2
(%o2)                   [x  + 1, a, b, c]
(%i3) cons(x^2+1, a+b+c);
                        2
(%o3)                  x  + c + b + a + 1
(%i4) cons(x^2+1, f(a,b,c));
                          2
(%o4)                  f(x  + 1, a, b, c)
</pre></div>
</dd></dl>

<a name="copylist"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fcopylist"></a><dl>
<dt><a name="index-copylist"></a>Funktion: <strong>copylist</strong> <em>(<var>list</var>)</em></dt>
<dd>
<p>Gibt eine Kopie der Liste <var>list</var> zur&uuml;ck.
</p>
<p>Im Unterschied zur Funktion <code>copylist</code> wird mit dem Zuweisungsoperator
<code><a href="maxima_39.html#g_t_003a">:</a></code> keine Kopie, sondern eine Referenz auf das Original zugewiesen.  Das
folgende Beispiel zeigt den Unterschied f&uuml;r den Fall, dass das Original
modifiziert wird.
</p>
<div class="example">
<pre class="example">(%i1) list : [x,y,z];
(%o1)                       [x, y, z]
(%i2) a: list;
(%o2)                       [x, y, z]
(%i3) b: copylist(list);
(%o3)                       [x, y, z]
(%i4) list[2]:99;
(%o4)                          99
(%i5) list;
(%o5)                      [x, 99, z]
(%i6) a;
(%o6)                      [x, 99, z]
(%i7) b;
(%o7)                       [x, y, z]
</pre></div>
</dd></dl>

<a name="create_005flist"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fcreate_005flist"></a><dl>
<dt><a name="index-create_005flist"></a>Funktion: <strong>create_list</strong> <em>(<var>expr</var>, <var>x_1</var>, <var>list_1</var>, &hellip;, <var>x_n</var>, <var>list_n</var>)</em></dt>
<dd>
<p>Erzeugt eine Liste, indem der Ausdruck <var>expr</var> zun&auml;chst f&uuml;r die Variable
<var>x_1</var> ausgewertet wird.  Der Variablen <var>x_1</var> werden f&uuml;r die Auswertung 
nacheinander die Werte der Liste <var>list_1</var> zugewiesen.  Dann wird der
Ausdruck <var>expr</var> f&uuml;r die Variable <var>x_2</var> mit den Werten der Liste
<var>list_2</var> ausgewertet u.s.w.  Die Anzahl der Elemente der Ergebnisliste ist
das Produkt der Anzahl der Elemente der einzelnen Listen <var>list_i</var>.  Die
Variablen <var>x_i</var> m&uuml;ssen Symbole sein, die nicht ausgewertet werden.  Die 
Elemente der Listen <var>list_i</var> werden vor der Iteration ausgewertet.
</p>
<p>Anstatt einer Liste <var>list_i</var> mit den Elementen f&uuml;r die Iteration kann auch
eine untere und obere Grenze angegeben werden.  Die Grenzen k&ouml;nnen ganze
Zahlen oder Gleitkommazahlen sowie Ausdr&uuml;cke sein, die zu einer Zahl
auswerten.  Die Schrittweite ist immer 1.  Siehe auch das Beispiel weiter unten.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) create_list(x^i, i, [1, 3, 7]);
                 3   7
(%o1)       [x, x , x ]
</pre></div>

<p>In diesem Beispiel wird f&uuml;r zwei Listen iteriert.
</p>
<div class="example">
<pre class="example">(%i1) create_list([i, j], i, [a, b], j, [e, f, h]);
(%o1) [[a, e], [a, f], [a, h], [b, e], [b, f], [b, h]]
</pre></div>

<p>Anstatt einer Liste <var>list_i</var> k&ouml;nnen auch zwei Argumente &uuml;bergeben 
werden, die jedes zu einer Nummer auswerten.  Diese Werte sind die untere und
die obere Grenze f&uuml;r die Iteration.
</p>
<div class="example">
<pre class="example">(%i1) create_list([i,j],i,[1,2,3],j,1,i);
(%o1) [[1, 1], [2, 1], [2, 2], [3, 1], [3, 2], [3, 3]]
</pre></div>
</dd></dl>

<a name="delete"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fdelete"></a><dl>
<dt><a name="index-delete"></a>Funktion: <strong>delete</strong> <em>(<var>expr</var>, <var>list</var>)</em></dt>
<dt><a name="index-delete-1"></a>Funktion: <strong>delete</strong> <em>(<var>expr</var>, <var>list</var>, <var>n</var>)</em></dt>
<dd>
<p><code>delete(<var>expr</var>, <var>list</var>)</code> entfernt aus der Liste <var>list</var> die
Elemente, die gleich dem Ausdruck <var>expr</var> sind.  Mit dem Argument <var>n</var>
kann die Anzahl der Elemente spezifiziert werden, die aus der Liste entfernt
werden sollen.  <code>delete</code> gibt eine neue Liste zur&uuml;ck.  Das Argument
<var>list</var> wird nicht modifiziert.
</p>
<p>Die Gleichheit wird mit dem Operator <code><a href="maxima_38.html#g_t_003d">=</a></code> gepr&uuml;ft.  Daher werden nur
Ausdr&uuml;cke als gleich erkannt, die syntaktisch &uuml;bereinstimmen.  &Auml;quivalente
Ausdr&uuml;cke, die syntaktisch voneinander verschieden sind, werden nicht aus der
Liste entfernt.  Zum Beispiel sind die Ausdr&uuml;cke <code>x^2-1</code> und
<code>(x+1)*(x-1)</code> &auml;quivalent, aber syntaktisch verschieden.
</p>
<p>Das zweite Argument <var>list</var> kann auch ein allgemeiner Ausdruck sein.  In 
diesem Fall werden die Argumente des Hauptoperators als die Elemente einer Liste
angenommen.
</p>
<p>Beispiele:
</p>
<p>Entferne Elemente einer Liste.
</p>
<div class="example">
<pre class="example">(%i1) delete (y, [w, x, y, z, z, y, x, w]);
(%o1)                  [w, x, z, z, x, w]
</pre></div>

<p>Entferne Terme einer Summe.
</p>
<div class="example">
<pre class="example">(%i1) delete (sin(x), x + sin(x) + y);
(%o1)                         y + x
</pre></div>

<p>Entferne Faktoren eines Produkts.
</p>
<div class="example">
<pre class="example">(%i1) delete (u - x, (u - w)*(u - x)*(u - y)*(u - z));
(%o1)                (u - w) (u - y) (u - z)
</pre></div>

<p>Entferne Argumente einer Funktion.
</p>
<div class="example">
<pre class="example">(%i1) delete (a, f(a, b, c, d, a));
(%o1)                     f(b, c, d)
</pre></div>

<p>Das Element <code>a</code> tritt mehrfach auf.  Es werden zwei Elemente entfernt.
</p>
<div class="example">
<pre class="example">(%i1) delete (a, f(a, b, a, c, d, a), 2);
(%o1)                    f(b, c, d, a)
</pre></div>

<p>Die Gleichheit wird mit dem Operator <code>=</code> gepr&uuml;ft.
</p>
<div class="example">
<pre class="example">(%i1) [is(equal (0, 0)), is(equal (0, 0.0)), is(equal (0, 0b0))];

`rat' replaced 0.0 by 0/1 = 0.0
`rat' replaced 0.0B0 by 0/1 = 0.0B0
(%o1)                  [true, true, true]
(%i2) [is (0 = 0), is (0 = 0.0), is (0 = 0b0)];
(%o2)                 [true, false, false]
(%i3) delete (0, [0, 0.0, 0b0]);
(%o3)                     [0.0, 0.0b0]
(%i4) is (equal ((x + y)*(x - y), x^2 - y^2));
(%o4)                         true
(%i5) is ((x + y)*(x - y) = x^2 - y^2);
(%o5)                         false
(%i6) delete ((x + y)*(x - y), [(x + y)*(x - y), x^2 - y^2]);
                              2    2
(%o6)                       [x  - y ]
</pre></div>
</dd></dl>

<a name="endcons"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fendcons"></a><dl>
<dt><a name="index-endcons"></a>Funktion: <strong>endcons</strong> <em>(<var>expr</var>, <var>list</var>)</em></dt>
<dd>
<p>F&uuml;gt den Ausdruck <var>expr</var> als letztes Element der Liste <var>list</var> hinzu.
</p>
<p><code>endcons</code> arbeitet auch mit allgemeinen Ausdr&uuml;cken als Argument
<var>list</var>.  In diesem Fall wird dem Hauptoperator des Arguments <var>list</var> der
Ausdruck <var>expr</var> als letztes Argument hinzugef&uuml;gt.
</p>
<p>Siehe auch die Funktion <code><a href="#cons">cons</a></code>, um ein Element am Anfang einer
Liste einzuf&uuml;gen sowie die Funktion <code><a href="#append">append</a></code>, um zwei Listen
zusammenzuf&uuml;gen.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) endcons(x, [a, b, c]);
(%o1)                     [a, b, c, x]
(%i2) endcons(x^2+1, [a, b, c]);
                                   2
(%o2)                   [a, b, c, x  + 1]
(%i3) endcons(x^2+1, a+b+c);
                        2
(%o3)                  x  + c + b + a + 1
(%i4) endcons(x^2+1, f(a,b,c));
                                   2
(%o4)                  f(a, b, c, x  + 1)
</pre></div>
</dd></dl>

<a name="first"></a><a name="Item_003a-Lists_002ede_002fdeffn_002ffirst"></a><dl>
<dt><a name="index-first"></a>Funktion: <strong>first</strong> <em>(<var>list</var>)</em></dt>
<dd>
<p>Gibt das erste Element der Liste <var>list</var> zur&uuml;ck.
</p>
<p>Das Argument <var>list</var> kann auch ein allgemeiner Ausdruck wie zum Beispiel
der Term einer Summe, der Faktor eines Produktes oder die erste Spalte einer
Matrix sein.  Die Funktion <code>first</code> und verwandte Funktionen wie
<code><a href="#last">last</a></code> oder <code><a href="#rest">rest</a></code> arbeiten mit der externen Darstellung eines
Ausdrucks, wie sie in der Anzeige erscheint.  Dies kann mit der Optionsvariablen
<code><a href="maxima_32.html#inflag">inflag</a></code> kontrolliert werden.  Hat die Optionsvariable <code>inflag</code> den
Wert <code>true</code>, wird von diesen Funktionen die interne Darstellung betrachtet.
</p>
<p>Die Funktionen <code><a href="#second">second</a></code> bis <code><a href="#tenth">tenth</a></code> geben jeweils das 2. bis 10. 
Element zur&uuml;ck.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) l: [a,b,c];
(%o1)                       [a, b, c]
(%i2) first(l);
(%o2)                           a
(%i3) first(x + y);
(%o3)                           y
(%i4) first(x * y);
(%o4)                           x
(%i5) first(f(x, y, z));
(%o5)                           x
</pre></div>
</dd></dl>

<a name="join"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fjoin"></a><dl>
<dt><a name="index-join"></a>Funktion: <strong>join</strong> <em>(<var>list_1</var>, <var>list_2</var>)</em></dt>
<dd>
<p>Erzeugt eine neue Liste aus den Elementen der Listen <var>list_1</var> und
<var>list_2</var>, wobei die Elemente abwechselnd &uuml;bernommen werden.  Das Ergebnis
hat die Form <code>[<var>list_1</var>[1], <var>list_2</var>[1], <var>list_1</var>[2],
<var>list_2</var>[2], ...]</code>.
</p>
<p>Haben die Listen verschiedene L&auml;ngen, werden die zus&auml;tzlichen Elemente der
l&auml;ngeren Liste ignoriert.
</p>
<p>Sind <var>list_1</var> oder <var>list_2</var> keine Listen, gibt Maxima einen Fehler aus.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) L1: [a, sin(b), c!, d - 1];
(%o1)                [a, sin(b), c!, d - 1]
(%i2) join (L1, [1, 2, 3, 4]);
(%o2)          [a, 1, sin(b), 2, c!, 3, d - 1, 4]
(%i3) join (L1, [aa, bb, cc, dd, ee, ff]);
(%o3)        [a, aa, sin(b), bb, c!, cc, d - 1, dd]
</pre></div>
</dd></dl>

<a name="last"></a><a name="Item_003a-Lists_002ede_002fdeffn_002flast"></a><dl>
<dt><a name="index-last"></a>Funktion: <strong>last</strong> <em>(<var>list</var>)</em></dt>
<dd>
<p>Gibt das letzte Element der Liste <var>list</var> zur&uuml;ck.
</p>
<p>Das Argument <var>list</var> kann auch ein allgemeiner Ausdruck sein.  Siehe
<code><a href="#first">first</a></code> f&uuml;r weitere Erl&auml;uterungen.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) l: [a,b,c];
(%o1)                       [a, b, c]
(%i2) last(x + y);
(%o2)                           x
(%i3) last(x * y);
(%o3)                           y
(%i4) last(f(x, y, z));
(%o4)                           z
</pre></div>
</dd></dl>

<a name="length"></a><a name="Item_003a-Lists_002ede_002fdeffn_002flength"></a><dl>
<dt><a name="index-length"></a>Funktion: <strong>length</strong> <em>(<var>list</var>)</em></dt>
<dd>
<p>Gibt die Anzahl der Elemente der Liste <var>list</var> zur&uuml;ck.
</p>
<p>Das Argument <var>list</var> kann auch ein allgemeiner Ausdruck sein.  Wie bei
anderen Funktionen f&uuml;r Listen wird auch von der Funktion <code>length</code> die
externe Darstellung eines Ausdrucks betrachtet, wie sie f&uuml;r die Ausgabe
vorliegt.  Die Optionsvariable <code><a href="maxima_32.html#inflag">inflag</a></code> hat daher Einfluss auf das Ergebnis
der Funktion <code>length</code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) length([a, x^2, sin(x), y+3]);
(%o1)                           4
(%i2) length(a/(b*x));
(%o2)                           2
(%i3) length(a/(b*x)),inflag:true;
(%o3)                           3
</pre></div>
</dd></dl>


<a name="listarith"></a><a name="Item_003a-Lists_002ede_002fdefvr_002flistarith"></a><dl>
<dt><a name="index-listarith"></a>Optionsvariable: <strong>listarith</strong></dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat die Optionsvariable <code>listarith</code> den Wert <code>true</code>, werden 
Rechenoperationen mit Matrizen und Listen elementweise ausgef&uuml;hrt.  Das 
Ergebnis von Rechnungen mit Listen und Matrizen sind wieder Listen und Matrizen.
Hat die Optionsvariable <code>listarith</code> den Wert <code>false</code>, wird die
elementweise Ausf&uuml;hrung der Rechenoperationen unterdr&uuml;ckt.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) listarith: true;
(%o1)                         true
(%i2) 2 + [a, b, c];
(%o2)                 [a + 2, b + 2, c + 2]
(%i3) 2^[a, b, c];
                            a   b   c
(%o3)                     [2 , 2 , 2 ]
(%i4) [1, 2, 3] + [a, b, c];
(%o4)                 [a + 1, b + 2, c + 3]
(%i5) listarith: false;
(%o5)                         false
(%i6) 2 + [a, b, c];
(%o6)                     [a, b, c] + 2
(%i7) 2^[a, b, c];
                            [a, b, c]
(%o7)                      2
(%i8) [1, 2, 3] + [a, b, c];
(%o8)                 [a, b, c] + [1, 2, 3]
</pre></div>
</dd></dl>

<a name="listp"></a><a name="Item_003a-Lists_002ede_002fdeffn_002flistp"></a><dl>
<dt><a name="index-listp"></a>Funktion: <strong>listp</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Gibt <code>true</code> zur&uuml;ck, wenn <var>expr</var> eine Liste ist.  Ansonsten ist der 
R&uuml;ckgabewert <code>false</code>.
</p></dd></dl>

<a name="makelist"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fmakelist"></a><dl>
<dt><a name="index-makelist"></a>Funktion: <strong>makelist</strong> <em>(<var>expr</var>, <var>i</var>, <var>i_0</var>, <var>i_1</var>)</em></dt>
<dt><a name="index-makelist-1"></a>Funktion: <strong>makelist</strong> <em>(<var>expr</var>, <var>x</var>, <var>list</var>)</em></dt>
<dd>
<p>Erzeugt eine Liste, indem der Ausdruck <var>expr</var> f&uuml;r die Variable <var>i</var>
ausgewertet wird.  Die Variable <var>i</var> nimmt nacheinander die Werte von
<var>i_0</var> bis <var>i_1</var> an, wobei die Schrittweite 1 ist.  Alternativ kann eine
Liste <var>list</var> als Argument &uuml;bergeben werden.  In diesem Fall nimmt die
Variable <var>i</var> nacheinander die Werte der Liste <var>list</var> an.
</p>
<p>Siehe auch die Funktion <code><a href="#create_005flist">create_list</a></code>, um eine Liste zu generieren.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) makelist(concat(x, i), i, 1, 6);
(%o1)               [x1, x2, x3, x4, x5, x6]
(%i2) makelist(x = y, y, [a, b, c]);
(%o2)                 [x = a, x = b, x = c]
</pre></div>
</dd></dl>

<a name="member"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fmember"></a><dl>
<dt><a name="index-member"></a>Funktion: <strong>member</strong> <em>(<var>expr</var>, <var>list</var>)</em></dt>
<dd>
<p>Gibt <code>true</code> zur&uuml;ck, wenn der Ausdruck <var>expr</var> gleich einem Element in
der Liste <var>list</var> ist.  Die Gleichheit wird dem Operator
<code><a href="maxima_38.html#g_t_003d">=</a></code> festgestellt.
</p>
<p>Die Gleichheit wird mit dem Operator <code><a href="maxima_38.html#g_t_003d">=</a></code> gepr&uuml;ft.  Daher werden nur
Ausdr&uuml;cke als gleich erkannt, die syntaktisch &uuml;bereinstimmen.  &Auml;quivalente
Ausdr&uuml;cke, die syntaktisch voneinander verschieden sind, werden nicht aus der
Liste entfernt.  Zum Beispiel sind die Ausdr&uuml;cke <code>x^2-1</code> und
<code>(x+1)*(x-1)</code> &auml;quivalent, aber syntaktisch verschieden.
</p>
<p>Das Argument <var>list</var> kann auch ein allgemeiner Ausdruck sein.  Dabei werden
die Argumente des Hauptoperators betrachtet.
</p>
<p>Siehe auch die Funktion <code><a href="maxima_81.html#elementp">elementp</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) member (8, [8, 8.0, 8b0]);
(%o1)                         true
(%i2) member (8, [8.0, 8b0]);
(%o2)                         false
(%i3) member (b, [a, b, c]);
(%o3)                         true
(%i4) member (b, [[a, b], [b, c]]);
(%o4)                         false
(%i5) member ([b, c], [[a, b], [b, c]]);
(%o5)                         true
(%i6) F (1, 1/2, 1/4, 1/8);
                               1  1  1
(%o6)                     F(1, -, -, -)
                               2  4  8
(%i7) member (1/8, %);
(%o7)                         true
(%i8) member (&quot;ab&quot;, [&quot;aa&quot;, &quot;ab&quot;, sin(1), a + b]);
(%o8)                         true
</pre></div>
</dd></dl>

<a name="pop"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fpop"></a><dl>
<dt><a name="index-pop"></a>Funktion: <strong>pop</strong> <em>(<var>list</var>)</em></dt>
<dd>
<p>Die Funktion <code>pop</code> entfernt das erste Element der Liste <var>list</var> und
gibt dieses Element zur&uuml;ck.  <var>list</var> muss ein Symbol sein, dem eine Liste
zugewiesen wurde, und kann nicht selbst eine Liste sein.
</p>
<p>Ist dem Argument <var>list</var> keine Liste zugewiesen, gibt Maxima eine
Fehlermeldung aus.
</p>
<p>Siehe auch die Funktion <code><a href="#push">push</a></code> f&uuml;r Beispiele.
</p>
<p>Mit dem Kommando <code>load(&quot;basic&quot;)</code> wird die Funktion geladen.
</p></dd></dl>

<a name="push"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fpush"></a><dl>
<dt><a name="index-push"></a>Funktion: <strong>push</strong> <em>(<var>item</var>, <var>list</var>)</em></dt>
<dd>
<p>Die Funktion <code>push</code> f&uuml;gt das Argument <var>item</var> als erstes Element der
Liste <var>list</var> hinzu und gibt die neue Liste zur&uuml;ck.  Das Argument
<var>list</var> muss ein Symbol sein, dem eine Liste zugewiesen wurde, und kann nicht
selbst eine Liste sein.  Das Argument <var>item</var> kann ein beliebiger Ausdruck
sein.
</p>
<p>Ist dem Argument <var>list</var> keine Liste zugewiesen, gibt Maxima eine 
Fehlermeldung aus.
</p>
<p>Siehe auch die Funktion <code><a href="#pop">pop</a></code>, um das erste Element einer Liste zu
entfernen.
</p>
<p>Mit dem Kommando <code>load(&quot;basic&quot;)</code> wird die Funktion geladen.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) ll:[];
(%o1)                          []
(%i2) push(x,ll);
(%o2)                          [x]
(%i3) push(x^2+y,ll);
                                 2
(%o3)                      [y + x , x]
(%i4) a:push(&quot;string&quot;,ll);
                                     2
(%o4)                  [string, y + x , x]
(%i5) pop(ll);
(%o5)                        string
(%i6) pop(ll);
                                  2
(%o6)                        y + x
(%i7) pop(ll);
(%o7)                           x
(%i8) ll;
(%o8)                          []
(%i9) a;
                                     2
(%o9)                  [string, y + x , x]
</pre></div>
</dd></dl>

<a name="rest"></a><a name="Item_003a-Lists_002ede_002fdeffn_002frest"></a><dl>
<dt><a name="index-rest"></a>Funktion: <strong>rest</strong> <em>(<var>list</var>, <var>n</var>)</em></dt>
<dt><a name="index-rest-1"></a>Funktion: <strong>rest</strong> <em>(<var>list</var>)</em></dt>
<dd>
<p>Entfernt das erste Element oder, wenn <var>n</var> eine positive ganze Zahl ist, die
ersten <var>n</var> Elemente der Liste <var>list</var> und gibt den Rest der Liste als
Ergebnis zur&uuml;ck.  Ist <var>n</var> eine negative Zahl, werden die letzten <var>n</var>
Elemente von der Liste entfernt und der Rest als Ergebnis zur&uuml;ckgegeben.
</p>
<p>Das Argument <var>list</var> kann auch ein allgemeiner Ausdruck sein.
</p>
<p>Siehe auch die Funktionen <code><a href="#first">first</a></code> und <code><a href="#last">last</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) rest([a,b,c]);
(%o1)                        [b, c]
(%i2) rest(a+b+c);
(%o2)                         b + a
</pre></div>
</dd></dl>

<a name="reverse"></a><a name="Item_003a-Lists_002ede_002fdeffn_002freverse"></a><dl>
<dt><a name="index-reverse"></a>Funktion: <strong>reverse</strong> <em>(<var>list</var>)</em></dt>
<dd>
<p>Kehrt die Anordnung der Elemente einer Liste <var>list</var> um und gibt die
Ergebnisliste zur&uuml;ck.  Das Argument <var>list</var> kann auch ein allgemeiner
Ausdruck sein.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) reverse([a, b, c]);
(%o1)                       [c, b, a]
(%i2) reverse(sin(x)=2*x^2+1);
                           2
(%o2)                   2 x  + 1 = sin(x)
</pre></div>
</dd></dl>

<a name="second"></a><a name="third"></a><a name="fourth"></a><a name="fifth"></a><a name="sixth"></a><a name="seventh"></a><a name="eighth"></a><a name="ninth"></a><a name="tenth"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fsecond"></a><dl>
<dt><a name="index-second"></a>Funktion: <strong>second</strong> <em>(<var>list</var>)</em></dt>
<dd><a name="Item_003a-Lists_002ede_002fdeffn_002fthird"></a></dd><dt><a name="index-third"></a>Funktion: <strong>third</strong> <em>(<var>list</var>)</em></dt>
<dd><a name="Item_003a-Lists_002ede_002fdeffn_002ffourth"></a></dd><dt><a name="index-fourth"></a>Funktion: <strong>fourth</strong> <em>(<var>list</var>)</em></dt>
<dd><a name="Item_003a-Lists_002ede_002fdeffn_002ffifth"></a></dd><dt><a name="index-fifth"></a>Funktion: <strong>fifth</strong> <em>(<var>list</var>)</em></dt>
<dd><a name="Item_003a-Lists_002ede_002fdeffn_002fsixth"></a></dd><dt><a name="index-sixth"></a>Funktion: <strong>sixth</strong> <em>(<var>list</var>)</em></dt>
<dd><a name="Item_003a-Lists_002ede_002fdeffn_002fseventh"></a></dd><dt><a name="index-seventh"></a>Funktion: <strong>seventh</strong> <em>(<var>list</var>)</em></dt>
<dd><a name="Item_003a-Lists_002ede_002fdeffn_002feighth"></a></dd><dt><a name="index-eighth"></a>Funktion: <strong>eighth</strong> <em>(<var>list</var>)</em></dt>
<dd><a name="Item_003a-Lists_002ede_002fdeffn_002fninth"></a></dd><dt><a name="index-ninth"></a>Funktion: <strong>ninth</strong> <em>(<var>list</var>)</em></dt>
<dd><a name="Item_003a-Lists_002ede_002fdeffn_002ftenth"></a></dd><dt><a name="index-tenth"></a>Funktion: <strong>tenth</strong> <em>(<var>list</var>)</em></dt>
<dd>
<p>Die Funktionen <code>second</code> bis <code>tenth</code> geben das 2. bis 10. Element eines
Ausdrucks oder einer Liste <var>list</var> zur&uuml;ck.  Siehe <code><a href="#first">first</a></code>.
</p></dd></dl>

<a name="sort"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fsort"></a><dl>
<dt><a name="index-sort"></a>Funktion: <strong>sort</strong> <em>(<var>L</var>, <var>P</var>)</em></dt>
<dt><a name="index-sort-1"></a>Funktion: <strong>sort</strong> <em>(<var>L</var>)</em></dt>
<dd>
<p>Sortiert eine Liste <var>L</var> und gibt die sortierte Liste zur&uuml;ck.  Das
optionale Argument <var>P</var> ist eine Aussagefunktion mit zwei Argumenten, die
eine Ordnung der Elemente definiert.  Die Aussagefunktion kann eine Funktion,
ein bin&auml;rer Operator oder ein Lambda-Ausdruck sein.  Wird kein Argument
<var>P</var> angegeben, werden die Elemente der Liste mit der Aussagefunktion
<code><a href="maxima_32.html#orderlessp">orderlessp</a></code> geordnet.
</p>
<p>Die Aussagefunktion <code><a href="maxima_32.html#orderlessp">orderlessp</a></code> sortiert eine List aufsteigend.  Mit der
Aussagefunktion <code><a href="maxima_32.html#ordergreatp">ordergreatp</a></code> kann die Liste absteigend sortiert werden.
Die Aussagefunktion <code><a href="maxima_32.html#ordermagnitudep">ordermagnitudep</a></code> sortiert Maxima Zahlen, Konstante 
oder Ausdr&uuml;cke, die zu einer Zahl oder Konstanten ausgewertet werden k&ouml;nnen,
nach der Gr&ouml;&szlig;e.  Mit dem Operator <code><a href="maxima_36.html#g_t_003c">&lt;</a></code> kann auch nach der Gr&ouml;&szlig;e
sortiert werden.  Im Unterschied zur Aussagefunktion <code>ordermagnitudep</code> ist
die Ordnung nicht vollst&auml;ndig, wenn einzelne Elemente der Liste nicht
vergleichbar unter dem Operator <code>&lt;</code> sind.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) sort ([11, -17, 29b0, 7.55, 3, -5/2, b + a, 9 * c,
      19 - 3 * x]);
               5
(%o1) [- 17, - -, 3, 7.55, 11, 2.9b1, b + a, 9 c, 19 - 3 x]
               2
(%i2) sort ([11, -17, 29b0, 7.55, 3, -5/2, b + a, 9*c, 19 - 3*x],
      ordergreatp);
                                                   5
(%o2) [19 - 3 x, 9 c, b + a, 2.9b1, 11, 7.55, 3, - -, - 17]
                                                   2
(%i3) sort ([%pi, 3, 4, %e, %gamma]);
(%o3)                [3, 4, %e, %gamma, %pi]
(%i4) sort ([%pi, 3, 4, %e, %gamma], &quot;&lt;&quot;);
(%o4)                [%gamma, %e, 3, %pi, 4]
(%i5) my_list: [[aa,hh,uu], [ee,cc], [zz,xx,mm,cc], [%pi,%e]];
(%o5) [[aa, hh, uu], [ee, cc], [zz, xx, mm, cc], [%pi, %e]]
(%i6) sort (my_list);
(%o6) [[%pi, %e], [aa, hh, uu], [ee, cc], [zz, xx, mm, cc]]
(%i7) sort (my_list, lambda ([a, b], orderlessp (reverse (a),
      reverse (b))));
(%o7) [[%pi, %e], [ee, cc], [zz, xx, mm, cc], [aa, hh, uu]]
</pre></div>

<p>Ordne Maxima Zahlen, Konstante und konstante Ausdr&uuml;cke nach der Gr&ouml;&szlig;e.
Alle anderen Elemente werden aufsteigend sortiert.
</p>
<div class="example">
<pre class="example">(%i8) sort([%i,1+%i,2*x,minf,inf,%e,sin(1),0,1,2,3,1.0,1.0b0],
           ordermagnitudep);
</pre><pre class="example">(%o8) [minf, 0, sin(1), 1, 1.0, 1.0b0, 2, %e, 3, inf, %i, 
                                                     %i + 1, 2 x]
</pre></div>
</dd></dl>

<a name="sublist"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fsublist"></a><dl>
<dt><a name="index-sublist"></a>Funktion: <strong>sublist</strong> <em>(<var>L</var>, <var>P</var>)</em></dt>
<dd>
<p>Gibt die Elemente der Liste <var>L</var> als eine Liste zur&uuml;ck, f&uuml;r die die
Aussagefunktion <code>P</code> das Ergebnis <code>true</code> hat.  <code>P</code> ist eine
Funktion mit einem Argument wie zum Beispiel die Funktion
<code><a href="maxima_14.html#integerp">integerp</a></code>.  Siehe auch die Funktion <code><a href="#sublist_005findices">sublist_indices</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) L: [1, 2, 3, 4, 5, 6];
(%o1)                  [1, 2, 3, 4, 5, 6]
(%i2) sublist (L, evenp);
(%o2)                       [2, 4, 6]
</pre></div>
</dd></dl>

<a name="sublist_005findices"></a><a name="Item_003a-Lists_002ede_002fdeffn_002fsublist_005findices"></a><dl>
<dt><a name="index-sublist_005findices"></a>Funktion: <strong>sublist_indices</strong> <em>(<var>L</var>, <var>P</var>)</em></dt>
<dd>
<p>Gibt die Indizes der Elemente der Liste <var>L</var> zur&uuml;ck, f&uuml;r die die
Aussagefunktion <code>P</code> das Ergebnis <code>true</code> hat.  <code>P</code> ist eine
Funktion mit einem Argument wie zum Beispiel die Funktion
<code><a href="maxima_14.html#integerp">integerp</a></code>.  Siehe auch die Funktion <code><a href="#sublist">sublist</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) sublist_indices ('[a, b, b, c, 1, 2, b, 3, b],
                       lambda ([x], x='b));
(%o1)                     [2, 3, 7, 9]
(%i2) sublist_indices ('[a, b, b, c, 1, 2, b, 3, b], symbolp);
(%o2)                  [1, 2, 3, 4, 7, 9]
(%i3) sublist_indices ([1 &gt; 0, 1 &lt; 0, 2 &lt; 1, 2 &gt; 1, 2 &gt; 0],
                       identity);
(%o3)                       [1, 4, 5]
(%i4) assume (x &lt; -1);
(%o4)                       [x &lt; - 1]
(%i5) map (maybe, [x &gt; 0, x &lt; 0, x &lt; -2]);
(%o5)                [false, true, unknown]
(%i6) sublist_indices ([x &gt; 0, x &lt; 0, x &lt; -2], identity);
(%o6)                          [2]
</pre></div>
</dd></dl>

<a name="unique"></a><a name="Item_003a-Lists_002ede_002fdeffn_002funique"></a><dl>
<dt><a name="index-unique"></a>Funktion: <strong>unique</strong> <em>(<var>L</var>)</em></dt>
<dd>
<p>Gibt eine Liste mit den Elementen der Liste <var>L</var> zur&uuml;ck, die sich
voneinander unterscheiden.  Sind alle Elemente der Liste <var>L</var> verschieden,
gibt <code>unique</code> eine Kopie der Liste <var>L</var> und nicht die Liste selbst
zur&uuml;ck.  Ist <var>L</var> keine Liste, gibt <code>unique</code> den Ausdruck <var>L</var>
zur&uuml;ck.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) unique ([1, %pi, a + b, 2, 1, %e, %pi, a + b, [1]]);
(%o1)              [1, 2, %e, %pi, [1], b + a]
</pre></div>
</dd></dl>



<a name="Item_003a-Arrays_002ede_002fnode_002fArrays"></a><hr>
<div class="header">
<p>
Previous: <a href="maxima_20.html#Einf_00fchrung-in-Listen" accesskey="p" rel="previous">Einf&uuml;hrung in Listen</a>, Nach oben: <a href="maxima_19.html#Listen" accesskey="u" rel="up">Listen</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Inhaltsverzeichnis" rel="contents">Inhalt</a>][<a href="maxima_334.html#Index-der-Variablen-und-Funktionen" title="Index" rel="index">Index</a>]</p>
</div>



</body>
</html>
