<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 5.1, http://www.gnu.org/software/texinfo/ -->
<head>
<title>Maxima Manual: Funktionen und Variablen f&uuml;r Eigenschaften</title>

<meta name="description" content="Maxima Manual: Funktionen und Variablen f&uuml;r Eigenschaften">
<meta name="keywords" content="Maxima Manual: Funktionen und Variablen f&uuml;r Eigenschaften">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="maxima_toc.html#Top" rel="start" title="Top">
<link href="maxima_334.html#Index-der-Variablen-und-Funktionen" rel="index" title="Index der Variablen und Funktionen">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="Inhaltsverzeichnis">
<link href="maxima_61.html#Maximas-Datenbank" rel="up" title="Maximas Datenbank">
<link href="maxima_64.html#Funktionen-und-Variablen-f_00fcr-Fakten" rel="next" title="Funktionen und Variablen f&uuml;r Fakten">
<link href="maxima_62.html#Einf_00fchrung-in-Maximas-Datenbank" rel="previous" title="Einf&uuml;hrung in Maximas Datenbank">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
blockquote.smallquotation {font-size: smaller}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
div.indentedblock {margin-left: 3.2em}
div.lisp {margin-left: 3.2em}
div.smalldisplay {margin-left: 3.2em}
div.smallexample {margin-left: 3.2em}
div.smallindentedblock {margin-left: 3.2em; font-size: smaller}
div.smalllisp {margin-left: 3.2em}
kbd {font-style:oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: inherit; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: inherit; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.nocodebreak {white-space:nowrap}
span.nolinebreak {white-space:nowrap}
span.roman {font-family:serif; font-weight:normal}
span.sansserif {font-family:sans-serif; font-weight:normal}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="../figures/favicon.ico">

</head>

<body lang="de" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">
<a name="Funktionen-und-Variablen-f_00fcr-Eigenschaften"></a>
<div class="header">
<p>
Next: <a href="maxima_64.html#Funktionen-und-Variablen-f_00fcr-Fakten" accesskey="n" rel="next">Funktionen und Variablen f&uuml;r Fakten</a>, Previous: <a href="maxima_62.html#Einf_00fchrung-in-Maximas-Datenbank" accesskey="p" rel="previous">Einf&uuml;hrung in Maximas Datenbank</a>, Nach oben: <a href="maxima_61.html#Maximas-Datenbank" accesskey="u" rel="up">Maximas Datenbank</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Inhaltsverzeichnis" rel="contents">Inhalt</a>][<a href="maxima_334.html#Index-der-Variablen-und-Funktionen" title="Index" rel="index">Index</a>]</p>
</div>
<a name="Funktionen-und-Variablen-fur-Eigenschaften"></a>
<h3 class="section">11.2 Funktionen und Variablen f&uuml;r Eigenschaften</h3>

<a name="alphabetic"></a><a name="Item_003a-Database_002ede_002fdefvr_002falphabetic"></a><dl>
<dt><a name="index-alphabetic"></a>Eigenschaft: <strong>alphabetic</strong></dt>
<dd>
<p>Das Kommando <code>declare(string, alphabetic)</code> deklariert die Zeichen der 
Zeichenkette <var>string</var> als alphabetisch.  Das Argument <var>string</var> muss eine
Zeichenkette sein.  Zeichen, die als alphabetisch deklariert sind, k&ouml;nnen in
Maxima-Bezeichnern verwendet werden.  Siehe auch <a href="maxima_31.html#Bezeichner">Bezeichner</a>.
</p>
<p>Beispiele:
</p>
<p>Die Zeichen <code>&quot;~&quot;</code>, <code>&quot;@&quot;</code> und <code>`</code> als alphabetisch erkl&auml;rt.
</p>
<div class="example">
<pre class="example">(%i1) xx\~yy\`\@ : 1729;
(%o1)                         1729
(%i2) declare (&quot;~`@&quot;, alphabetic);
(%o2)                         done
(%i3) xx~yy`@ + @yy`xx + `xx@@yy~;
(%o3)               `xx@@yy~ + @yy`xx + 1729
(%i4) listofvars (%);
(%o4)                  [@yy`xx, `xx@@yy~]
</pre></div>
</dd></dl>

<a name="bindtest"></a><a name="Item_003a-Database_002ede_002fdefvr_002fbindtest"></a><dl>
<dt><a name="index-bindtest"></a>Eigenschaft: <strong>bindtest</strong></dt>
<dd>
<p>Hat ein Symbol <var>x</var> die Eigenschaft <code>bindtest</code> und wird es ausgewertet,
ohne das dem Symbol bisher ein Wert zugewiesen wurde, signalisiert Maxima einen 
Fehler.  Siehe auch die Funktion <code><a href="#declare">declare</a></code>.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) aa + bb;
(%o1)                        bb + aa
(%i2) declare (aa, bindtest);
(%o2)                         done
(%i3) aa + bb;
aa unbound variable
 -- an error.  Quitting.  To debug this try debugmode(true);
(%i4) aa : 1234;
(%o4)                         1234
(%i5) aa + bb;
(%o5)                       bb + 1234
</pre></div>
</dd></dl>

<a name="constant"></a><a name="Item_003a-Database_002ede_002fdefvr_002fconstant"></a><dl>
<dt><a name="index-constant"></a>Eigenschaft: <strong>constant</strong></dt>
<dd>
<p>Das Kommando <code>declare(<var>a</var>, constant)</code> deklariert ein Symbol <var>a</var>
als konstant.  Die Funktion <code><a href="#constantp">constantp</a></code> hat f&uuml;r dieses Symbol dann das
Ergebnis <code>true</code>.  Die Deklaration als eine Konstante verhindert nicht, dass
dem Symbol ein Wert zugewiesen werden kann.  Siehe <code><a href="#declare">declare</a></code> und
<code><a href="#constantp">constantp</a></code>.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) declare(c, constant);
(%o1)                         done
(%i2) constantp(c);
(%o2)                         true
(%i3) c : x;
(%o3)                           x
(%i4) constantp(c);
(%o4)                         false
</pre></div>
</dd></dl>

<a name="constantp"></a><a name="Item_003a-Database_002ede_002fdeffn_002fconstantp"></a><dl>
<dt><a name="index-constantp"></a>Funktion: <strong>constantp</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Gibt f&uuml;r einen konstanten Ausdruck <var>expr</var> den Wert <code>true</code> zur&uuml;ck,
andernfalls <code>false</code>.
</p>
<p>Ein Ausdruck wird von Maxima als ein konstanter Ausdruck erkannt, wenn seine 
Argumente Zahlen sind (einschlie&szlig;lich von Zahlen in einer CRE-Darstellung), 
symbolische Konstanten wie <code>%pi</code>, <code>%e</code> und <code>%i</code>, 
Variablen, die einen konstanten Wert haben, Variablen, die mit 
<code>declare</code> als konstant deklariert sind, oder Funktionen, deren Argumente 
konstant sind.
</p>
<p>Die Funktion <code>constantp</code> wertet das Argument aus.
</p>
<p>Siehe auch die Eigenschaft <code><a href="#constant">constant</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) constantp (7 * sin(2));
(%o1)                                true
(%i2) constantp (rat (17/29));
(%o2)                                true
(%i3) constantp (%pi * sin(%e));
(%o3)                                true
(%i4) constantp (exp (x));
(%o4)                                false
(%i5) declare (x, constant);
(%o5)                                done
(%i6) constantp (exp (x));
(%o6)                                true
(%i7) constantp (foo (x) + bar (%e) + baz (2));
(%o7)                                false
(%i8) 
</pre></div>
</dd></dl>

<a name="declare"></a><a name="Item_003a-Database_002ede_002fdeffn_002fdeclare"></a><dl>
<dt><a name="index-declare"></a>Funktion: <strong>declare</strong> <em>(<var>a_1</var>, <var>p_1</var>, <var>a_2</var>, <var>p_2</var>, &hellip;)</em></dt>
<dd>
<p>Weist dem Symbol <var>a_i</var> die Eigenschaft <var>p_i</var> zu.  Die Argumente
<var>a_i</var> und <var>p_i</var> k&ouml;nnen Listen sein.  Ist <var>a_i</var> eine Liste, dann
erh&auml;lt jedes Symbol der Liste die Eigenschaft <var>p_i</var>.  Ist umgekehrt
<var>p_i</var> eine Liste mit Eigenschaften, dann erh&auml;lt das Symbol <var>a_i</var> 
diese Eigenschaften.  Entsprechend erhalten alle Symbole einer Liste <var>a_i</var>
die Eigenschaften einer Liste <var>p_i</var>.
</p>
<p>Die Funktion <code>declare</code> wertet die Argumente nicht aus.  <code>declare</code> gibt
stets <code>done</code> als Ergebnis zur&uuml;ck.
</p>
<p>Hat ein Symbol <var>sym</var> die Eigenschaft <var>prop</var> mit der Funktion 
<code>declare</code> erhalten, dann hat das Kommando <code>featurep(<var>sym</var>, 
<var>prop</var>)</code> das Ergebnis <code>true</code>.  Mit der Funktion <code>properties</code>
k&ouml;nnen alle Eigenschaften eines Symbols angezeigt werden.
</p>
<p>Mit der Funktion <code>declare</code> k&ouml;nnen Symbole die folgenden Eigenschaften
erhalten:
</p>
<dl compact="compact">
<dt><code>additive</code></dt>
<dd><p>Hat eine Funktion <code>f</code> die Eigenschaft <code>additive</code>, wird ein Ausdruck
der Form <code>f(x + y + z + ...)</code> zu <code>f(x) + f(y) + f(z) + ...</code>
vereinfacht.  Siehe <code><a href="maxima_48.html#additive">additive</a></code>.
</p>
</dd>
<dt><code>alphabetic</code></dt>
<dd><p><var>a_i</var> ist eine Zeichenkette, deren Zeichen als alphabetische Zeichen 
deklariert werden.  Die Zeichen k&ouml;nnen dann in Maxima-Bezeichnern verwendet
werden.  Siehe <code><a href="#alphabetic">alphabetic</a></code> f&uuml;r Beispiele.
</p>
</dd>
<dt><code>antisymmetric, commutative, symmetric</code></dt>
<dd><p><var>a_i</var> wird als eine symmetrische, antisymmetrische oder kommutative Funktion
interpretiert.  Die Eigenschaften <code>commutative</code> und <code>symmetric</code> sind
&auml;quivalent.  Siehe <code><a href="maxima_48.html#antisymmetric">antisymmetric</a></code>, <code><a href="maxima_48.html#commutative">commutative</a></code> und
<code><a href="maxima_48.html#symmetric">symmetric</a></code>.
</p>
</dd>
<dt><code>bindtest</code></dt>
<dd><p>Hat ein Symbol die Eigenschaft <code>bindtest</code> und wird es ausgewertet, ohne 
das dem Symbol bisher ein Wert zugewiesen wurde, signalisiert Maxima einen 
Fehler.  Siehe <code><a href="#bindtest">bindtest</a></code> f&uuml;r Beispiele.
</p>
</dd>
<dt><code>constant</code></dt>
<dd><p>Hat ein Symbol die Eigenschaft <code>constant</code>, wird es von Maxima als eine 
Konstante interpretiert.  Siehe auch <code><a href="#constant">constant</a></code>.
</p>
</dd>
<dt><code>even, odd</code></dt>
<dd><p>Erh&auml;lt eine Variable die Eigenschaft <code>even</code> oder <code>odd</code>, wird sie als
gerade oder ungerade interpretiert.
</p>
</dd>
<dt><code>evenfun, oddfun</code></dt>
<dd><p>Erh&auml;lt eine Funktion oder ein Operator die Eigenschaft <code>evenfun</code> oder 
<code>oddfun</code> wird die Funktion oder der Operator von Maxima als gerade und 
ungerade interpretiert.  Diese Eigenschaft wird bei der Vereinfachung von 
Ausdr&uuml;cken von Maxima angewendet.  Siehe <code><a href="maxima_48.html#evenfun">evenfun</a></code> und <code><a href="maxima_48.html#oddfun">oddfun</a></code>.
</p>
</dd>
<dt><code>evflag</code></dt>
<dd><p>Deklariert die Variable <code>a_i</code> als einen Auswertungsschalter.  W&auml;hrend der
Auswertung eines Ausdrucks mit der Funktion <code>ev</code>, erh&auml;lt der 
Auswertungsschalter <code>a_i</code> den Wert <code>true</code>.  Siehe <code><a href="maxima_45.html#evflag">evflag</a></code> f&uuml;r 
Beispiele.
</p>
</dd>
<dt><code>evfun</code></dt>
<dd><p>Deklariert eine Funktion <var>a_i</var> als eine Auswertungsfunktion.  Tritt die 
Funktion <var>a_i</var> als Argument der Funktion <code>ev</code> auf, so wird die Funktion
auf den Ausdruck angewendet.  Siehe <code><a href="maxima_45.html#evfun">evfun</a></code> f&uuml;r Beispiele.
</p>
</dd>
<dt><code>feature</code></dt>
<dd><p><var>a_i</var> wird als eine Eigenschaft <code>feature</code> interpretiert.  Andere
Symbole k&ouml;nnen dann diese vom Nutzer definierte Eigenschaft erhalten.
Siehe <code><a href="#feature">feature</a></code>.
</p>
</dd>
<dt><code>increasing, decreasing</code></dt>
<dd><p>Erh&auml;lt eine Funktion die Eigenschaft <code>decreasing</code> oder <code>increasing</code>, 
wird die Funktion als eine monoton steigende oder fallende Funktion
interpretiert.  Siehe <code><a href="#decreasing">decreasing</a></code> und <code><a href="#increasing">increasing</a></code>.
</p>
</dd>
<dt><code>integer, noninteger</code></dt>
<dd><p><var>a_i</var> wird als eine ganzzahlige oder nicht-ganzzahlige Variable
interpretiert.  Siehe <code><a href="#integer">integer</a></code> und <code><a href="#noninteger">noninteger</a></code>.
</p>
</dd>
<dt><code>integervalued</code></dt>
<dd><p>Erh&auml;lt eine Funktion die Eigenschaft <code>integervalued</code>, nimmt Maxima f&uuml;r
Vereinfachungen an, dass die Funktionen einen ganzzahligen Wertebereich hat.
F&uuml;r ein Beispiel siehe <code><a href="#integervalued">integervalued</a></code>.
</p>
</dd>
<dt><code>lassociative, rassociative</code></dt>
<dd><p><var>a_i</var> wird als eine rechts- oder links-assoziative Funktion interpretiert.
Siehe <code><a href="maxima_48.html#lassociative">lassociative</a></code> und <code><a href="maxima_48.html#rassociative">rassociative</a></code>.
</p>
</dd>
<dt><code>linear</code></dt>
<dd><p>Entspricht der Deklaration einer Funktion als <code>outative</code> und
<code>additive</code>.  Siehe auch <code><a href="maxima_48.html#linear">linear</a></code>.
</p>
</dd>
<dt><code>mainvar</code></dt>
<dd><p>Wird eine Variable als <var>mainvar</var> deklariert, wird sie als eine 
&quot;Hauptvariable&quot; interpretiert.  Eine Hauptvariable wird vor allen Konstanten und
Variablen in einer kanonischen Ordnung eines Maxima-Ausdr&uuml;ckes angeordnet.
Die Anordnung wird durch die Funktion <code>ordergreatp</code> bestimmt.  Siehe auch
<code><a href="maxima_32.html#mainvar">mainvar</a></code>.
</p>
</dd>
<dt><code>multiplicative</code></dt>
<dd><p>Hat eine Funktion <code>f</code> die Eigenschaft <code>multiplicative</code>, werden
Ausdr&uuml;cke der Form <code><var>a_i</var>(x * y * z * ...)</code> zu
<code><var>a_i</var>(x) * <var>a_i</var>(y) * <var>a_i</var>(z) * ...</code> vereinfacht.  Die
Vereinfachung wird nur f&uuml;r das erste Argument der Funktion <var>f</var>
ausgef&uuml;hrt.  Siehe <code><a href="maxima_48.html#multiplicative">multiplicative</a></code>.
</p>
</dd>
<dt><code>nary</code></dt>
<dd><p>Erh&auml;lt eine Funktion oder ein Operator die Eigenschaft <code>nary</code>, wird die
Funktion oder der Operator bei der Vereinfachung als Nary-Funktion oder
Nary-Operator interpretiert.  Verschachtelte Ausdr&uuml;cke wie 
<code>foo(x, foo(y, z))</code> werden zum Beispiel zu <code>foo(x, y, z)</code> vereinfacht.
Die Deklaration <code>nary</code> unterscheidet sich von der Funktion <code>nary</code>.
W&auml;hrend der Funktionsaufruf einen neuen Operator definiert, wirkt sich die 
Deklaration nur auf die Vereinfachung aus.  Siehe auch 
<code><a href="maxima_48.html#property_005fnary">nary</a></code>.
</p>
</dd>
<dt><code>nonarray</code></dt>
<dd><p>Hat ein Symbol <var>a_i</var> die Eigenschaft <code>nonarray</code>, wird es nicht als ein
Array interpretiert, wenn das Symbol einen Index erh&auml;lt.  Diese Deklaration
verhindert die mehrfache Auswertung, wenn <var>a_i</var> als indizierte Variable
genutzt wird.  Siehe  <code><a href="#nonarray">nonarray</a></code>.
</p>
</dd>
<dt><code>nonscalar</code></dt>
<dd><p><var>a_i</var> wird als eine nicht-skalare Variable interpretiert.  Ein Symbol wird
also als ein Vektor oder eine Matrix deklariert.  Siehe <code><a href="#nonscalar">nonscalar</a></code>.
</p>
</dd>
<dt><code>noun</code></dt>
<dd><p><var>a_i</var> wird als Substantivform interpretiert.  Abh&auml;ngig vom Kontext wird 
<var>a_i</var> durch <code>'<var>a_i</var></code> oder <code>nounify(<var>a_i</var>)</code> ersetzt.
Siehe auch <code><a href="maxima_32.html#noun">noun</a></code>. f&uuml;r ein Beispiel.
</p>
</dd>
<dt><code>outative</code></dt>
<dd><p>Ausdr&uuml;cke mit der Funktion <var>a_i</var> werden so vereinfacht, dass konstante 
Faktoren aus dem Argument herausgezogen werden.  Hat die Funktion <var>a_i</var> ein 
Argument, wird ein Faktor dann als konstant angesehen, wenn er ein Symbol oder 
eine deklarierte Konstante ist.  Hat die Funktion <var>a_i</var> zwei oder mehr 
Argumente, wird ein Faktor dann als konstant angesehen, wenn das zweite Argument
ein Symbol und der Faktor unabh&auml;ngig vom zweiten Argument ist.  Siehe auch
<code><a href="maxima_48.html#outative">outative</a></code>.
</p>
</dd>
<dt><code>posfun</code></dt>
<dd><p><var>a_i</var> wird als eine Funktion interpretiert, die nur positive Werte hat.
Siehe <code><a href="#posfun">posfun</a></code>.
</p>
</dd>
<dt><code>rational, irrational</code></dt>
<dd><p><var>a_i</var> wird als eine rationale oder irrationale Zahl interpretiert.  Siehe
<code><a href="#rational">rational</a></code> und <code><a href="#irrational">irrational</a></code>.
</p>
</dd>
<dt><code>real, imaginary, complex</code></dt>
<dd><p><var>a_i</var> wird als eine reelle, imagin&auml;re oder komplexe Zahl interpretiert.
Siehe <code><a href="#real">real</a></code>, <code><a href="#imaginary">imaginary</a></code> und <code><a href="#complex">complex</a></code>.
</p>
</dd>
<dt><code>scalar</code></dt>
<dd><p><var>a_i</var> wird als skalare Variable interpretiert.  Siehe <code><a href="#scalar">scalar</a></code>.
</p></dd>
</dl>
</dd></dl>

<a name="decreasing"></a><a name="increasing"></a><a name="Item_003a-Database_002ede_002fdefvr_002fdecreasing"></a><dl>
<dt><a name="index-decreasing"></a>Eigenschaft: <strong>decreasing</strong></dt>
<dd><a name="Item_003a-Database_002ede_002fdefvr_002fincreasing"></a></dd><dt><a name="index-increasing"></a>Eigenschaft: <strong>increasing</strong></dt>
<dd>
<p>Erh&auml;lt eine Funktion mit der Funktion <code><a href="#declare">declare</a></code> die Eigenschaft 
<code>decreasing</code> oder <code>increasing</code> wird die Funktion als eine steigende 
oder fallende Funktion interpretiert.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) assume(a &gt; b);
(%o1)                        [a &gt; b]
(%i2) is(f(a) &gt; f(b));
(%o2)                        unknown
(%i3) declare(f, increasing);
(%o3)                         done
(%i4) is(f(a) &gt; f(b));
(%o4)                         true
</pre></div>
</dd></dl>

<a name="even"></a><a name="odd"></a><a name="Item_003a-Database_002ede_002fdefvr_002feven"></a><dl>
<dt><a name="index-even"></a>Eigenschaften: <strong>even</strong></dt>
<dd><a name="Item_003a-Database_002ede_002fdefvr_002fodd"></a></dd><dt><a name="index-odd"></a>Eigenschaften: <strong>odd</strong></dt>
<dd>
<p>Hat eine Variable mit der Funktion <code><a href="#declare">declare</a></code> die Eigenschaft <code>even</code>
oder <code>odd</code> erhalten, wird sie von Maxima als gerade oder ungerade
ganze Zahl interpretiert.  Diese Eigenschaften werden jedoch nicht von den
Funktionen <code><a href="maxima_14.html#evenp">evenp</a></code>, <code><a href="maxima_14.html#oddp">oddp</a></code> oder <code><a href="maxima_14.html#integerp">integerp</a></code> erkannt.
</p>
<p>Siehe auch die Funktion <code><a href="maxima_64.html#askinteger">askinteger</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) declare(n, even);
(%o1)                         done
(%i2) askinteger(n, even);
(%o2)                          yes
(%i3) askinteger(n);
(%o3)                          yes
(%i4) evenp(n);
(%o4)                         false
</pre></div>
</dd></dl>

<a name="feature"></a><a name="Item_003a-Database_002ede_002fdefvr_002ffeature"></a><dl>
<dt><a name="index-feature"></a>Eigenschaft: <strong>feature</strong></dt>
<dd>
<p><code>feature</code> ist eine Eigenschaft, die ein Symbol <var>sym</var> mit der Funktion
<code>declare</code> erhalten kann.  In diesem Fall ist das Symbol <var>sym</var> selbst
eine Eigenschaft, so dass das Kommando <code>declare(x, sym)</code> einem Symbol
<var>x</var> die vom Nutzer definierte Eigenschaft <code>sym</code> gibt.
</p>
<p>Maxima unterscheidet Systemeigenschaften und mathematische Eigenschaften, die 
Symbole und Ausdr&uuml;cke haben k&ouml;nnen.  F&uuml;r Systemeigenschaften siehe die 
Funktion <code><a href="maxima_164.html#status">status</a></code>.  F&uuml;r mathematische Eigenschaften siehe die 
Funktionen <code><a href="#declare">declare</a></code> und <code><a href="#featurep">featurep</a></code>.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) declare (FOO, feature);
(%o1)                         done
(%i2) declare (x, FOO);
(%o2)                         done
(%i3) featurep (x, FOO);
(%o3)                         true
</pre></div>
</dd></dl>

<a name="featurep"></a><a name="Item_003a-Database_002ede_002fdeffn_002ffeaturep"></a><dl>
<dt><a name="index-featurep"></a>Funktion: <strong>featurep</strong> <em>(<var>a</var>, <var>p</var>)</em></dt>
<dd>
<p>Stellt fest, ob das Symbol oder der Ausdruck <var>a</var> die Eigenschaft <var>p</var> 
hat.  Maxima nutzt die Fakten der aktiven Kontexte und die definierten
Eigenschaften f&uuml;r Symbole und Funktionen.
</p>
<p><code>featurep</code> gibt sowohl f&uuml;r den Fall <code>false</code> zur&uuml;ck, dass das 
Argument <var>a</var> nicht die Eigenschaft <var>p</var> hat, als auch f&uuml;r den Fall, 
dass Maxima dies nicht anhand der bekannten Fakten und Eigenschaften entscheiden
kann.
</p>
<p><code>featurep</code> wertet die Argumente aus.
</p>
<p>Siehe auch <code><a href="#declare">declare</a></code> und <code><a href="#featurep">featurep</a></code>..
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) declare (j, even)$
(%i2) featurep (j, integer);
(%o2)                           true
</pre></div>
</dd></dl>

<a name="features"></a><a name="Item_003a-Database_002ede_002fdefvr_002ffeatures"></a><dl>
<dt><a name="index-features"></a>Systemvariable: <strong>features</strong></dt>
<dd>
<p>Maxima kennt spezielle mathematische Eigenschaften von Funktionen und 
Variablen.
</p>
<p><code>declare(<var>x</var>)</code>, <var>foo</var> gibt der Funktion oder Variablen <var>x</var> die
Eigenschaft <var>foo</var>.
</p>
<p><code>declare(<var>foo</var>, feature)</code> deklariert die neue Eigenschaft <var>foo</var>.
Zum  Beispiel deklariert <code>declare([red, green, blue], feature)</code> die drei 
neuen Eigenschaften <code>red</code>, <code>green</code> und <code>blue</code>.
</p>
<p><code>featurep(<var>x</var>, <var>foo</var>)</code> hat die R&uuml;ckgabe <code>true</code>, wenn <var>x</var> 
die Eigenschaft <var>foo</var> hat.  Ansonsten wird <code>false</code> zur&uuml;ckgegeben.
</p>
<p>Die Informationsliste <code>features</code> enth&auml;lt eine Liste der Eigenschaften, 
die Funktionen und Variablen erhalten k&ouml;nnen und die in die Datenbank
eingetragen werden:
</p>
<pre class="verbatim">   integer         noninteger       even 
   odd             rational         irrational
   real            imaginary        complex
   analytic        increasing       decreasing
   oddfun          evenfun          posfun
   commutative     lassociative     rassociative
   symmetric       antisymmetric
</pre>
<p>Hinzu kommen die vom Nutzer definierten Eigenschaften.
</p>
<p><code>features</code> ist eine Liste der mathematischen Eigenschaften.  Es gibt 
weitere Eigenschaften.  Siehe <code><a href="#declare">declare</a></code> und <code><a href="maxima_164.html#status">status</a></code>.
</p></dd></dl>

<a name="get"></a><a name="Item_003a-Database_002ede_002fdeffn_002fget"></a><dl>
<dt><a name="index-get"></a>Funktion: <strong>get</strong> <em>(<var>a</var>, <var>i</var>)</em></dt>
<dd>
<p>Gibt die Eigenschaft <var>i</var> des Symbols <var>a</var> zur&uuml;ck.  Hat das Symbol
<var>a</var> nicht die Eigenschaft <var>i</var>, wird <code>false</code> zur&uuml;ckgegeben.
</p>
<p><code>get</code> wertet die Argumente aus.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) put (%e, 'transcendental, 'type);
(%o1)                    transcendental
(%i2) put (%pi, 'transcendental, 'type)$
(%i3) put (%i, 'algebraic, 'type)$
(%i4) typeof (expr) := block ([q],
        if numberp (expr)
        then return ('algebraic),
        if not atom (expr)
        then return (maplist ('typeof, expr)),
        q: get (expr, 'type),
        if q=false
        then errcatch (error(expr,&quot;is not numeric.&quot;)) else q)$
(%i5) typeof (2*%e + x*%pi);
x is not numeric.
(%o5)  [[transcendental, []], [algebraic, transcendental]]
(%i6) typeof (2*%e + %pi);
(%o6)     [transcendental, [algebraic, transcendental]]
</pre></div>
</dd></dl>

<a name="integer"></a><a name="noninteger"></a><a name="Item_003a-Database_002ede_002fdefvr_002finteger"></a><dl>
<dt><a name="index-integer"></a>Eigenschaften: <strong>integer</strong></dt>
<dd><a name="Item_003a-Database_002ede_002fdefvr_002fnoninteger"></a></dd><dt><a name="index-noninteger"></a>Eigenschaften: <strong>noninteger</strong></dt>
<dd>
<p>Hat eine Variable mit der Funktion <code><a href="#declare">declare</a></code> die Eigenschaft <code>integer</code>
oder <code>noninteger</code> erhalten, wird sie von Maxima als eine ganze Zahl oder 
als nicht-ganze Zahl interpretiert.  Siehe auch <code><a href="maxima_64.html#askinteger">askinteger</a></code>.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) declare(n, integer, x, noninteger);
(%o1)                         done
(%i2) askinteger(n);
(%o2)                          yes
(%i3) askinteger(x);
(%o3)                          no
</pre></div>
</dd></dl>

<a name="integervalued"></a><a name="Item_003a-Database_002ede_002fdefvr_002fintegervalued"></a><dl>
<dt><a name="index-integervalued"></a>Eigenschaft: <strong>integervalued</strong></dt>
<dd>
<p>Erh&auml;lt eine Funktion mit <code><a href="#declare">declare</a></code> die Eigenschaft <code>integervalued</code>,
nimmt Maxima f&uuml;r Vereinfachungen an, dass der Wertebereich der Funktion
ganzzahlig ist.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) exp(%i)^f(x);
                              %i f(x)
(%o1)                      (%e  )
(%i2) declare(f, integervalued);
(%o2)                         done
(%i3) exp(%i)^f(x);
                              %i f(x)
(%o3)                       %e
</pre></div>
</dd></dl>

<a name="nonarray"></a><a name="Item_003a-Database_002ede_002fdeffn_002fnonarray"></a><dl>
<dt><a name="index-nonarray"></a>Eigenschaft: <strong>nonarray</strong></dt>
<dd>
<p><code>declare(a, nonarray)</code> gibt dem Symbol <var>a</var> die Eigenschaft nicht ein
Array zu sein.  Dies verhindert die mehrfache Auswertung, wenn das Symbol
<var>a</var> als indizierte Variable genutzt wird.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) a:'b$ b:'c$ c:'d$

(%i4) a[x];
(%o4)                          d
                                x
(%i5) declare(a, nonarray);
(%o5)                         done
(%i6) a[x];
(%o6)                          a
                                x
</pre></div>
</dd></dl>

<a name="nonscalar"></a><a name="Item_003a-Database_002ede_002fdefvr_002fnonscalar"></a><dl>
<dt><a name="index-nonscalar"></a>Eigenschaft: <strong>nonscalar</strong></dt>
<dd>
<p>Hat ein Symbol die Eigenschaft <code>nonscalar</code>, verh&auml;lt es sich wie eine
Matrix oder Liste bei nicht-kommutativen Rechenoperationen.
</p></dd></dl>

<a name="nonscalarp"></a><a name="Item_003a-Database_002ede_002fdeffn_002fnonscalarp"></a><dl>
<dt><a name="index-nonscalarp"></a>Funktion: <strong>nonscalarp</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Gibt <code>true</code> zur&uuml;ck, wenn der Ausdruck <var>expr</var> kein Skalar ist.  Der
Ausdruck enth&auml;lt dann Matrizen, Listen oder Symbole, die als <code>nonscalar</code>
deklariert wurden.
</p></dd></dl>

<a name="posfun"></a><a name="Item_003a-Database_002ede_002fdefvr_002fposfun"></a><dl>
<dt><a name="index-posfun"></a>Eigenschaft: <strong>posfun</strong></dt>
<dd>
<p><code>declare(f, posfun)</code> deklariert die Funktion <code>f</code> als eine Funktion,
die nur positive Werte annimmt.  <code>is(f(x) &gt; 0)</code> gibt dann <code>true</code>
zur&uuml;ck.
</p></dd></dl>

<a name="printprops"></a><a name="Item_003a-Database_002ede_002fdeffn_002fprintprops"></a><dl>
<dt><a name="index-printprops"></a>Funktion: <strong>printprops</strong> <em>(<var>a</var>, <var>i</var>)</em></dt>
<dt><a name="index-printprops-1"></a>Funktion: <strong>printprops</strong> <em>([<var>a_1</var>, &hellip;, <var>a_n</var>], <var>i</var>)</em></dt>
<dt><a name="index-printprops-2"></a>Funktion: <strong>printprops</strong> <em>(all, <var>i</var>)</em></dt>
<dd>
<p>Zeigt die zum Kennzeichen <var>i</var> zugeordnete Eigenschaft des Atoms <var>a</var> an.
<var>i</var> kann einer der Werte <code>gradef</code>, <code>atvalue</code>, <code>atomgrad</code> oder
<code>matchdeclare</code> sein.  <var>a</var> kann sowohl eine Liste von Atomen, als auch
das Atom <code>all</code> sein.  In diesem Fall werden alle Atome angezeigt, die eine
Eigenschaft zum Kennzeichen <var>i</var> haben.
</p>
<p>Beispiel:
</p>
<div class="example">
<pre class="example">(%i1) gradef(f(x), 2*g(x));
(%o1)                         f(x)
(%i2) printprops(f,gradef);
                       d
                       -- (f(x)) = 2 g(x)
                       dx

(%o2)                         done
</pre></div>
</dd></dl>

<a name="properties"></a><a name="Item_003a-Database_002ede_002fdeffn_002fproperties"></a><dl>
<dt><a name="index-properties"></a>Funktion: <strong>properties</strong> <em>(<var>a</var>)</em></dt>
<dd>
<p>Gibt eine Liste mit den Eigenschaften zur&uuml;ck, die das Symbol <var>a</var> von
Maxima oder dem Nutzer erhalten hat.  Die R&uuml;ckgabe kann jede Eigenschaft
enthalten, die mit der Funktion <code><a href="#declare">declare</a></code> einem Symbol zugewiesen ist.
Diese Eigenschaften sind:
</p>
<pre class="verbatim">   linear         additive       multiplicative
   outative       commutative    symmetric      
   antisymmetric  nary           lassociativ
   rassociative   evenfun        oddfun
   bindtest       feature        alphabetic
   scalar         nonscalar      nonarray
   constant       integer        noninteger
   even           odd            rational
   irrational     real           imaginary
   complex        increasing     decreasing
   posfun         integervalued
</pre>
<p>Die folgenden Eintr&auml;ge beschreiben Eigenschaften, die Variablen haben
k&ouml;nnen:
</p>
<dl compact="compact">
<dt><code>value</code></dt>
<dd><p>Der Variable ist mit dem Operatoren <code><a href="maxima_39.html#g_t_003a">:</a></code> oder <code><a href="maxima_39.html#g_t_003a_003a">::</a></code> ein Wert zugewiesen.
</p></dd>
<dt><code>system value</code></dt>
<dd><p>Die Variable ist eine Optionsvariable oder Systemvariable, die von Maxima
definiert ist.
</p></dd>
<dt><code>numer</code></dt>
<dd><p>Die Variable hat einen numerischen Wert auf der Eigenschaftsliste, der mit
der Funktion <code><a href="maxima_14.html#numerval">numerval</a></code> zugewiesen ist.
</p></dd>
<dt><code>assign property</code></dt>
<dd><p>Die Variable hat eine eine Funktion auf der Eigenschaftsliste, die die Zuweisung
eines Wertes kontrolliert.
</p></dd>
</dl>

<p>Eintr&auml;ge, die die Eigenschaften von Funktionen beschreiben:
</p>
<dl compact="compact">
<dt><code>function</code></dt>
<dd><p>Eine mit dem Operator <code><a href="maxima_39.html#g_t_003a_003d">:=</a></code> oder der Funktion <code><a href="maxima_160.html#define">define</a></code> definierte
Nutzerfunktion.
</p></dd>
<dt><code>macro</code></dt>
<dd><p>Eine mit dem Operator <code><a href="maxima_39.html#g_t_003a_003a_003d">::=</a></code> definierte Makrofunktion.
</p></dd>
<dt><code>system function</code></dt>
<dd><p>Ein interne Maxima-Funktion.
</p></dd>
<dt><code>special evaluation form</code></dt>
<dd><p>Eine Maxima-Spezialform, die die Argumente nicht auswertet.
</p></dd>
<dt><code>transfun</code></dt>
<dd><p>Wird eine Nutzerfunktion mit <code><a href="maxima_171.html#translate">translate</a></code> &uuml;bersetzt oder mit der Funktion
<code><a href="maxima_171.html#compile">compile</a></code> kompiliert, erh&auml;lt sie die Eigenschaft <code>transfun</code>.
Interne Maxima-Funktionen, die mit dem Lisp-Makro <code>defmfun</code> definiert
werden, haben ebenfalls diese Eigenschaft.
</p></dd>
<dt><code>deftaylor</code></dt>
<dd><p>F&uuml;r die Funktion ist eine Taylorreihenentwicklung definiert.
</p></dd>
<dt><code>gradef</code></dt>
<dd><p>Die Funktion hat eine Ableitung.
</p></dd>
<dt><code>integral</code></dt>
<dd><p>Die Funktion hat eine Stammfunktion.
</p></dd>
<dt><code>distribute over bags</code></dt>
<dd><p>Ist das Argument der Funktion eine Liste, Matrix oder Gleichung so wird die
Funktion auf die Elemente oder beide Seiten der Gleichung angewendet.
</p></dd>
<dt><code>limit function</code></dt>
<dd><p>Es existiert eine Funktion f&uuml;r die Behandlung spezieller Grenzwerte.
</p></dd>
<dt><code>conjugate function</code></dt>
<dd><p>Es existiert eine Funktion, um die konjugiert komplexe Funktion f&uuml;r spezielle
Wertebereiche zu ermitteln.
</p></dd>
<dt><code>mirror symmetry</code></dt>
<dd><p>Die Funktion hat die Eigenschaft der Spiegelsymmetrie.
</p></dd>
<dt><code>complex characteristic</code></dt>
<dd><p>Es existiert eine Funktion, um den Realteil und den Imagin&auml;rteil der Funktion
f&uuml;r spezielle Wertebereiche zu ermitteln.
</p></dd>
<dt><code>user autoload function</code></dt>
<dd><p>Die Funktion wird automatisch beim ersten Aufruf aus einer Datei geladen.  Der
Nutzer kann mit dem Funktion <code><a href="maxima_179.html#setup_005fautoload">setup_autoload</a></code> eine solche Funktion
definieren.
</p></dd>
</dl>

<p>Weitere Eigenschaften, die Symbole erhalten k&ouml;nnen:
</p>
<dl compact="compact">
<dt><code>operator</code></dt>
<dd><p>Das Symbol ist ein Maxima-Operator oder ein nutzerdefinierte Operator.
</p>
</dd>
<dt><code>rule</code></dt>
<dd><p>Die Funktion oder der Operator haben eine Regel f&uuml;r die Vereinfachung.
</p>
</dd>
<dt><code>alias</code></dt>
<dt><code>database info</code></dt>
<dd><p>Das Symbol hat Eintr&auml;ge in Maximas Datenbank.
</p>
</dd>
<dt><code>hashed array, declared array, complete array</code></dt>
<dd><p>Ein Hashed-Array, ein deklariertes Array oder ein Array dessen Elemente
einen bestimmten Typ haben.
</p>
</dd>
<dt><code>array function</code></dt>
<dd><p>Eine Array-Funktion die mit dem Operator <code><a href="maxima_39.html#g_t_003a_003d">:=</a></code> definiert ist.
</p>
</dd>
<dt><code>atvalue</code></dt>
<dd><p>Dem Symbol ist mit der Funktion <code><a href="maxima_90.html#atvalue">atvalue</a></code> ein Wert an einer Stelle
zugewiesen.
</p>
</dd>
<dt><code>atomgrad</code></dt>
<dd><p>F&uuml;r das Symbol ist mit der Funktion <code><a href="maxima_90.html#gradef">gradef</a></code> eine Ableitung definiert.
</p>
</dd>
<dt><code>dependency</code></dt>
<dd><p>F&uuml;r das Symbol ist eine Abh&auml;ngigkeit mit der Funktion <code><a href="maxima_90.html#depends">depends</a></code>
definiert.
</p>
</dd>
<dt><code>matchdeclare</code></dt>
<dd><p>Das Symbol ist eine mit <code><a href="maxima_156.html#matchdeclare">matchdeclare</a></code> definierte Mustervariable, der eine
Aussagefunktion zugeordnet ist.
</p>
</dd>
<dt><code>modedeclare</code></dt>
<dd><p>F&uuml;r das Symbol ist mit der Funktion <code><a href="maxima_171.html#mode_005fdeclare">mode_declare</a></code> ein Typ definiert.
</p>
</dd>
<dt><code>user properties</code></dt>
<dt><code>context</code></dt>
<dd><p>Das Symbol bezeichnet einen Kontext.
</p>
</dd>
<dt><code>activecontext</code></dt>
<dd><p>Das Symbol bezeichnet einen aktiven Kontextes.
</p></dd>
</dl>
</dd></dl>

<a name="props"></a><a name="Item_003a-Database_002ede_002fdefvr_002fprops"></a><dl>
<dt><a name="index-props"></a>Systemvariable: <strong>props</strong></dt>
<dd><p>Standardwert: <code>[]</code>
</p>
<p><code>props</code> ist eine Liste der Symbole, die vom Nutzer eine Eigenschaft
erhalten haben, die in die Lisp-Eigenschaftsliste des Symbols eingetragen wird.
Neben den Funktionen <code><a href="#put">put</a></code> und <code><a href="#qput">qput</a></code>, mit denen der Nutzer
direkt eine Eigenschaft zu einem Symbol in die Lisp-Eigenschaftsliste eintragen
kann, legen auch Maxima-Funktionen Eigenschaften zu Symbolen in der 
Eigenschaftsliste ab und tragen diese Symbole in die Systemvariable <code>props</code>
ein.  Zu diesen Funktionen geh&ouml;ren zum Beispiel <code><a href="#declare">declare</a></code>,<!-- /@w -->
<code><a href="maxima_14.html#numerval">numerval</a></code>, <code><a href="maxima_156.html#matchdeclare">matchdeclare</a></code>, <code><a href="maxima_171.html#mode_005fdeclare">mode_declare</a></code>,<!-- /@w -->
<code><a href="maxima_90.html#gradef">gradef</a></code> oder <code><a href="maxima_179.html#setup_005fautoload">setup_autoload</a></code>.
</p>
<p>Nach dem Start von Maxima sollte die Systemvariable <code>props</code> keine Symbole
enthalten.  Das ist jedoch nicht der Fall und kann als ein Fehler betrachtet
werden, der in Zukunft zu beheben ist.
</p></dd></dl>

<a name="propvars"></a><a name="Item_003a-Database_002ede_002fdeffn_002fpropvars"></a><dl>
<dt><a name="index-propvars"></a>Funktion: <strong>propvars</strong> <em>(<var>prop</var>)</em></dt>
<dd>
<p>Gibt eine Liste mit den Atomen zur&uuml;ck, die in der Informationsliste 
<code>props</code> eingetragen sind und die die Eigenschaft <var>prop</var> haben.  Zum 
Beispiel gibt <code>propvars(atvalue)</code> eine Liste der Atome zur&uuml;ck, die die 
Eigenschaft <code>atvalue</code> haben.
</p></dd></dl>

<a name="put"></a><a name="Item_003a-Database_002ede_002fdeffn_002fput"></a><dl>
<dt><a name="index-put"></a>Funktion: <strong>put</strong> <em>(<var>atom</var>, <var>value</var>, <var>indicator</var>)</em></dt>
<dd>
<p>Weist den Wert <var>value</var> der Eigenschaft <var>indicator</var> des Atoms <var>atom</var>
zu.  <var>indicator</var> kann eine beliebige Eigenschaft sein und beschr&auml;nkt sich
nicht auf die vom System definierten Eigenschaften.  <code>put</code> wertet die 
Argumente aus.  <code>put</code> gibt <var>value</var> zur&uuml;ck.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) put (foo, (a+b)^5, expr);
                                   5
(%o1)                       (b + a)
(%i2) put (foo, &quot;Hello&quot;, str);
(%o2)                         Hello
(%i3) properties (foo);
(%o3)            [[user properties, str, expr]]
(%i4) get (foo, expr);
</pre><pre class="example">                                   5
(%o4)                       (b + a)
</pre><pre class="example">(%i5) get (foo, str);
(%o5)                         Hello
</pre></div>
</dd></dl>

<a name="qput"></a><a name="Item_003a-Database_002ede_002fdeffn_002fqput"></a><dl>
<dt><a name="index-qput"></a>Funktion: <strong>qput</strong> <em>(<var>atom</var>, <var>value</var>, <var>indicator</var>)</em></dt>
<dd>
<p>Entspricht der Funktion <code>put</code> mit dem Unterschied, dass <code>qput</code> die
Argumente nicht auswertet.
</p>
<p>Beispiele:
</p>
<div class="example">
<pre class="example">(%i1) foo: aa$ 
(%i2) bar: bb$
(%i3) baz: cc$
(%i4) put (foo, bar, baz);
(%o4)                          bb
(%i5) properties (aa);
(%o5)                [[user properties, cc]]
(%i6) get (aa, cc);
(%o6)                          bb
(%i7) qput (foo, bar, baz);
(%o7)                          bar
(%i8) properties (foo);
(%o8)            [value, [user properties, baz]]
(%i9) get ('foo, 'baz);
(%o9)                          bar
</pre></div>
</dd></dl>

<a name="rational"></a><a name="irrational"></a><a name="Item_003a-Database_002ede_002fdefvr_002frational"></a><dl>
<dt><a name="index-rational-1"></a>Eigenschaft: <strong>rational</strong></dt>
<dd><a name="Item_003a-Database_002ede_002fdefvr_002firrational"></a></dd><dt><a name="index-irrational"></a>Eigenschaft: <strong>irrational</strong></dt>
<dd>
<p>Hat eine Variable mit der Funktion <code><a href="#declare">declare</a></code> die Eigenschaft 
<code>rational</code> oder <code>irrational</code> erhalten, wird sie von Maxima als eine 
rationale Zahl oder als eine nicht rationale Zahl interpretiert.
</p></dd></dl>

<a name="real"></a><a name="imaginary"></a><a name="complex"></a><a name="Item_003a-Database_002ede_002fdefvr_002freal"></a><dl>
<dt><a name="index-real"></a>Eigenschaft: <strong>real</strong></dt>
<dd><a name="Item_003a-Database_002ede_002fdefvr_002fimaginary"></a></dd><dt><a name="index-imaginary"></a>Eigenschaft: <strong>imaginary</strong></dt>
<dd><a name="Item_003a-Database_002ede_002fdefvr_002fcomplex"></a></dd><dt><a name="index-complex"></a>Eigenschaft: <strong>complex</strong></dt>
<dd>
<p>Hat eine Variable mit der Funktion <code><a href="#declare">declare</a></code> die Eigenschaft <code>real</code>,
<code>imaginary</code> oder <code>complex</code> erhalten, wird sie von Maxima als eine 
reelle Zahl, imagin&auml;re Zahl oder als eine komplexe Zahl interpretiert.
</p></dd></dl>

<a name="rem"></a><a name="Item_003a-Database_002ede_002fdeffn_002frem"></a><dl>
<dt><a name="index-rem"></a>Funktion: <strong>rem</strong> <em>(<var>atom</var>, <var>indicator</var>)</em></dt>
<dd>
<p>Entfernt die Eigenschaft <var>indicator</var> vom Atom <var>atom</var>.
</p></dd></dl>

<a name="remove"></a><a name="Item_003a-Database_002ede_002fdeffn_002fremove"></a><dl>
<dt><a name="index-remove"></a>Funktion: <strong>remove</strong> <em>(<var>a_1</var>, <var>p_1</var>, &hellip;, <var>a_n</var>, <var>p_n</var>)</em></dt>
<dt><a name="index-remove-1"></a>Funktion: <strong>remove</strong> <em>([<var>a_1</var>, &hellip;, <var>a_m</var>], [<var>p_1</var>, &hellip;, <var>p_n</var>], &hellip;)</em></dt>
<dt><a name="index-remove-2"></a>Funktion: <strong>remove</strong> <em>(&quot;<var>a</var>&quot;, operator)</em></dt>
<dt><a name="index-remove-3"></a>Funktion: <strong>remove</strong> <em>(<var>a</var>, transfun)</em></dt>
<dt><a name="index-remove-4"></a>Funktion: <strong>remove</strong> <em>(all, <var>p</var>)</em></dt>
<dd>
<p>Entfernt Eigenschaften von Atomen.
</p>
<p><code>remove(<var>a_1</var>, <var>p_1</var>, ..., <var>a_n</var>, <var>p_n</var>)</code> entfernt die
Eigenschaft <code>p_k</code> von dem Atom <code>a_k</code>.
</p>
<p><code>remove([<var>a_1</var>, ..., <var>a_m</var>], [<var>p_1</var>, ..., <var>p_n</var>], ...)</code>
entfernt die Eigenschaften <var>p_1</var>, &hellip;, <var>p_n</var> von den Atomen 
<var>a_1</var>, &hellip;, <var>a_m</var>.  Es k&ouml;nnen mehrere Paare an Listen angegeben 
werden.
</p>
<p><code>remove(all, <var>p</var>)</code> entfernt die Eigenschaft <var>p</var> von allen Atomen, 
die diese Eigenschaft aufweisen.
</p>
<p>Die zu entfernenden Eigenschaften k&ouml;nnen vom System definierte Eigenschaften
wie <code>function</code>, <code>macro</code>, <code>mode_declare</code> oder nutzerdefinierte
Eigenschaften sein.
</p>
<p><code>remove(&quot;<var>a</var>&quot;, operator)</code> oder <code>remove(&quot;<var>a</var>&quot;, op)</code>
entfernen vom Atom <var>a</var> die Operatoreigenschaften, die mit den Funktionen
<code><a href="maxima_42.html#prefix">prefix</a></code>, <code><a href="maxima_42.html#infix">infix</a></code>, <code><a href="maxima_42.html#nary">nary</a></code>, <code><a href="maxima_42.html#postfix">postfix</a></code>,<!-- /@w -->
<code><a href="maxima_42.html#matchfix">matchfix</a></code> oder <code><a href="maxima_42.html#nofix">nofix</a></code> definiert wurden.  Die Namen von Operatoren
m&uuml;ssen als eine Zeichenkette angegeben werden.
</p>
<p><code>remove</code> gibt immer <code>done</code> zur&uuml;ck.
</p></dd></dl>

<a name="scalar"></a><a name="Item_003a-Database_002ede_002fdefvr_002fscalar"></a><dl>
<dt><a name="index-scalar"></a>Eigenschaft: <strong>scalar</strong></dt>
<dd>
<p>Hat ein Symbol die Eigenschaft <code>scalar</code>, verh&auml;lt es sich wie ein Skalar 
bei nicht-kommutativen Rechenoperationen.
</p></dd></dl>

<a name="scalarp"></a><a name="Item_003a-Database_002ede_002fdeffn_002fscalarp"></a><dl>
<dt><a name="index-scalarp"></a>Funktion: <strong>scalarp</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Gibt <code>true</code> zur&uuml;ck, wenn der Ausdruck <var>expr</var> eine Zahl, Konstante, 
ein als Skalar definiertes Symbol oder ein aus diesen Objekten zusammengesetzter
Ausdruck ist.  Der Ausdruck darf jedoch keine Liste oder eine Matrix sein.
</p></dd></dl>

<a name="Item_003a-Database_002ede_002fnode_002fFunktionen-und-Variablen-f_00fcr-Fakten"></a><hr>
<div class="header">
<p>
Next: <a href="maxima_64.html#Funktionen-und-Variablen-f_00fcr-Fakten" accesskey="n" rel="next">Funktionen und Variablen f&uuml;r Fakten</a>, Previous: <a href="maxima_62.html#Einf_00fchrung-in-Maximas-Datenbank" accesskey="p" rel="previous">Einf&uuml;hrung in Maximas Datenbank</a>, Nach oben: <a href="maxima_61.html#Maximas-Datenbank" accesskey="u" rel="up">Maximas Datenbank</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Inhaltsverzeichnis" rel="contents">Inhalt</a>][<a href="maxima_334.html#Index-der-Variablen-und-Funktionen" title="Index" rel="index">Index</a>]</p>
</div>



</body>
</html>
