<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 5.1, http://www.gnu.org/software/texinfo/ -->
<head>
<title>Manual do Maxima 5.46.0: Definições para distribuições contínuas</title>

<meta name="description" content="Manual do Maxima 5.46.0: Definições para distribuições contínuas">
<meta name="keywords" content="Manual do Maxima 5.46.0: Definições para distribuições contínuas">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="maxima_toc.html#Top" rel="start" title="Top">
<link href="maxima_218.html#g_t_00cdndice-de-Fun_00e7_00f5es-e-Vari_00e1veis" rel="index" title="Índice de Funções e Variáveis">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="Sum&aacute;rio">
<link href="maxima_145.html#distrib" rel="up" title="distrib">
<link href="maxima_148.html#Defini_00e7_00f5es-para-distribui_00e7_00f5es-discretas" rel="next" title="Definições para distribuições discretas">
<link href="maxima_146.html#Introdu_00e7_00e3o-a-distrib" rel="previous" title="Introdução a distrib">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
blockquote.smallquotation {font-size: smaller}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
div.indentedblock {margin-left: 3.2em}
div.lisp {margin-left: 3.2em}
div.smalldisplay {margin-left: 3.2em}
div.smallexample {margin-left: 3.2em}
div.smallindentedblock {margin-left: 3.2em; font-size: smaller}
div.smalllisp {margin-left: 3.2em}
kbd {font-style:oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: inherit; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: inherit; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.nocodebreak {white-space:nowrap}
span.nolinebreak {white-space:nowrap}
span.roman {font-family:serif; font-weight:normal}
span.sansserif {font-family:sans-serif; font-weight:normal}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="../figures/favicon.ico">

</head>

<body lang="pt" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">
<a name="Defini_00e7_00f5es-para-distribui_00e7_00f5es-cont_00ednuas"></a>
<div class="header">
<p>
Pr&oacute;ximo: <a href="maxima_148.html#Defini_00e7_00f5es-para-distribui_00e7_00f5es-discretas" accesskey="n" rel="next">Definições para distribuições discretas</a>, Previous: <a href="maxima_146.html#Introdu_00e7_00e3o-a-distrib" accesskey="p" rel="previous">Introdução a distrib</a>, Acima: <a href="maxima_145.html#distrib" accesskey="u" rel="up">distrib</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Sum&aacute;rio" rel="contents">Conte&uacute;do</a>][<a href="maxima_218.html#g_t_00cdndice-de-Fun_00e7_00f5es-e-Vari_00e1veis" title="&Iacute;ndice" rel="index">&Iacute;ndice</a>]</p>
</div>
<a name="Definicoes-para-distribuicoes-continuas"></a>
<h3 class="section">46.2 Definições para distribuições contínuas</h3>

<a name="Item_003a-distrib_002fdeffn_002fpdf_005fnormal"></a><dl>
<dt><a name="index-pdf_005fnormal"></a>Função: <strong>pdf_normal</strong> <em>(<var>x</var>,<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade
de uma  variável aleatória <em>Normal(m,s)</em>, com <em>s&gt;0</em>. Para fazer
uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005fnormal"></a><dl>
<dt><a name="index-cdf_005fnormal"></a>Função: <strong>cdf_normal</strong> <em>(<var>x</var>,<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade
de uma  variável aleatória <em>Normal(m,s)</em>, com <em>s&gt;0</em>. Essa
função é definida em termos de funções de erro internas do
Maxima,
<code>erf</code>.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) assume(s&gt;0)$ cdf_normal(x,m,s);
                             x - m
                       erf(---------)
                           sqrt(2) s    1
(%o3)                  -------------- + -
                             2          2
</pre></div>

<p>Veja também <code>erf</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005fnormal"></a><dl>
<dt><a name="index-quantile_005fnormal"></a>Função: <strong>quantile_normal</strong> <em>(<var>q</var>,<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantil de uma variável aleatória <em>Normal(m,s)</em>, com
<em>s&gt;0</em>; em outras palavras, isso é o inverso de <code>cdf_normal</code>. O argumento
<var>q</var> deve ser um elemento de <em>[0,1]</em>. Para fazer uso dessa função,
escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmean_005fnormal"></a><dl>
<dt><a name="index-mean_005fnormal"></a>Função: <strong>mean_normal</strong> <em>(<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna a média de uma  variável aleatória <em>Normal(m,s)</em>, com
<em>s&gt;0</em>, a saber <var>m</var>. Para fazer uso dessa função, escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005fnormal"></a><dl>
<dt><a name="index-var_005fnormal"></a>Função: <strong>var_normal</strong> <em>(<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna a variância de uma  variável aleatória <em>Normal(m,s)</em>, com
<em>s&gt;0</em>, a saber <var>s^2</var>. Para fazer uso dessa função, escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>

<a name="Item_003a-distrib_002fdeffn_002fstd_005fnormal"></a><dl>
<dt><a name="index-std_005fnormal"></a>Função: <strong>std_normal</strong> <em>(<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma  variável aleatória <em>Normal(m,s)</em>,
com <em>s&gt;0</em>, a saber <var>s</var>. Para fazer uso dessa função, escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fskewness_005fnormal"></a><dl>
<dt><a name="index-skewness_005fnormal"></a>Função: <strong>skewness_normal</strong> <em>(<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma  variável aleatória <em>Normal(m,s)</em>,
com <em>s&gt;0</em>, que é sempre igual  a 0. Para fazer uso dessa função,escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005fnormal"></a><dl>
<dt><a name="index-kurtosis_005fnormal"></a>Função: <strong>kurtosis_normal</strong> <em>(<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma  variável aleatória <em>Normal(m,s)</em>,
com <em>s&gt;0</em>, que é sempre igual  a 0. Para fazer uso dessa função,
escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdefvr_002frandom_005fnormal_005falgorithm"></a><dl>
<dt><a name="index-random_005fnormal_005falgorithm"></a>Variável de opção: <strong>random_normal_algorithm</strong></dt>
<dd><p>Valor por omissão: <code>box_mueller</code>
</p>
<p>Esse é o algoritmo seleccionado para simular variáveis aleatórias normais.
O algoritmos implementados são <code>box_mueller</code> e <code>inverse</code>:
</p><ul>
<li> <code>box_mueller</code>, Baseado no algoritmo descrito em Knuth, D.E. (1981)
<var>Seminumerical Algorithms. The Art of Computer Programming.</var> Addison-Wesley.

</li><li> <code>inverse</code>, baseado no método inverso genérico.
</li></ul>

<p>Veja também <code>random_normal</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005fnormal"></a><dl>
<dt><a name="index-random_005fnormal"></a>Função: <strong>random_normal</strong> <em>(<var>m</var>,<var>s</var>)</em></dt>
<dt><a name="index-random_005fnormal-1"></a>Função: <strong>random_normal</strong> <em>(<var>m</var>,<var>s</var>,<var>n</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória <em>Normal(m,s)</em>,
com <em>s&gt;0</em>. Chamando <code>random_normal</code> com um terceiro argumento
<var>n</var>, uma amostra aleatória de tamanho <var>n</var> será simulada.
</p>
<p>Existem dois algoritmos implementados para essa função, e o algoritmo
a ser usado pode ser seleccionado fornecendo um certo valor para a variável global
<code>random_normal_algorithm</code>, cujo valor padrão é
<code>box_mueller</code>.
</p>
<p>Veja também <code>random_normal_algorithm</code>. Para fazer uso
dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fpdf_005fstudent_005ft"></a><dl>
<dt><a name="index-pdf_005fstudent_005ft"></a>Função: <strong>pdf_student_t</strong> <em>(<var>x</var>,<var>n</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade de uma
variável aleatória de Student <em>t(n)</em>, com <em>n&gt;0</em>. Para fazer uso dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005fstudent_005ft"></a><dl>
<dt><a name="index-cdf_005fstudent_005ft"></a>Função: <strong>cdf_student_t</strong> <em>(<var>x</var>,<var>n</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade de
uma variável aleatória de Student <em>t(n)</em>, com <em>n&gt;0</em>. Essa função
não tem uma forma definitiva e é calculada numericamente
se a
variável global
<code>numer</code> for igual a <code>true</code>,  de outra froma <code>cdf_student_t</code> retorna uma
expressão nominal.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) cdf_student_t(1/2, 7/3);
                                     1  7
(%o2)                  cdf_student_t(-, -)
                                     2  3
(%i3) %,numer;
(%o3)                   .6698450596140417
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005fstudent_005ft"></a><dl>
<dt><a name="index-quantile_005fstudent_005ft"></a>Função: <strong>quantile_student_t</strong> <em>(<var>q</var>,<var>n</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantil de uma variável aleatória de Student <em>t(n)</em>,
com <em>n&gt;0</em>; em outras palavras, <code>quantile_student_t</code> é o inverso de
<code>cdf_student_t</code>. O argumento <var>q</var> deve ser um elemento de
<em>[0,1]</em>. Para fazer uso dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmean_005fstudent_005ft"></a><dl>
<dt><a name="index-mean_005fstudent_005ft"></a>Função: <strong>mean_student_t</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Retorna a média de uma variável aleatória de Student <em>t(n)</em>, com
<em>n&gt;0</em>, que é sempre igual a 0. Para fazer uso dessa função, escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005fstudent_005ft"></a><dl>
<dt><a name="index-var_005fstudent_005ft"></a>Função: <strong>var_student_t</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Retorna a variância de uma variável aleatória de Student <em>t(n)</em>, com <em>n&gt;2</em>.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) assume(n&gt;2)$  var_student_t(n);
                                n
(%o3)                         -----
                              n - 2
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fstd_005fstudent_005ft"></a><dl>
<dt><a name="index-std_005fstudent_005ft"></a>Função: <strong>std_student_t</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma variável aleatória de Student <em>t(n)</em>,
com <em>n&gt;2</em>. Para fazer uso dessa função, escreva primeiramente
<code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fskewness_005fstudent_005ft"></a><dl>
<dt><a name="index-skewness_005fstudent_005ft"></a>Função: <strong>skewness_student_t</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma variável aleatória de Student <em>t(n)</em>,
com <em>n&gt;3</em>, que é sempre igual a 0. Para fazer uso dessa função, escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005fstudent_005ft"></a><dl>
<dt><a name="index-kurtosis_005fstudent_005ft"></a>Função: <strong>kurtosis_student_t</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma variável aleatória de Student <em>t(n)</em>,
com <em>n&gt;4</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdefvr_002frandom_005fstudent_005ft_005falgorithm"></a><dl>
<dt><a name="index-random_005fstudent_005ft_005falgorithm"></a>Variável de opção: <strong>random_student_t_algorithm</strong></dt>
<dd><p>Valor por omissão: <code>ratio</code>
</p>
<p>Esse é o  algoritmo seleccionado para simular variáveis estatísticas pseudo-aleatórias
de Student. Algorítmos implementados são <code>inverse</code> e <code>ratio</code>:
</p><ul>
<li> <code>inverse</code>, baseado no método inverso genérico.


</li><li> <code>ratio</code>, baseado no facto que se <var>Z</var> for uma variável aleatória normal <em>N(0,1)</em> e
<em>S^2</em> for uma variável aleatória chi quadrada com <var>n</var> graus de liberdade,
<em>Chi^2(n)</em>, então
<div class="example">
<pre class="example">                           Z
                 X = -------------
                     /   2  \ 1/2
                     |  S   |
                     | ---  |
                     \  n   /
</pre></div>
<p>é uma variável aleatória de Student com <var>n</var> graus de liberdade, <em>t(n)</em>.
</p></li></ul>

<p>Veja também <code>random_student_t</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005fstudent_005ft"></a><dl>
<dt><a name="index-random_005fstudent_005ft"></a>Função: <strong>random_student_t</strong> <em>(<var>n</var>)</em></dt>
<dt><a name="index-random_005fstudent_005ft-1"></a>Função: <strong>random_student_t</strong> <em>(<var>n</var>,<var>m</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória de Student <em>t(n)</em>,
com <em>n&gt;0</em>. Chamando <code>random_student_t</code> com um segundo argumento
<var>m</var>, uma amostra aleatória de tamanho <var>m</var> será simulada.
</p>
<p>Existem dois algoritmos implementados para essa função, se pode
seleccionar o algoritmo a ser usado fornecendo um certo valor à variável
global <code>random_student_t_algorithm</code>, cujo valor padrão é <code>ratio</code>.
</p>
<p>Veja também <code>random_student_t_algorithm</code>. Para fazer uso dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fpdf_005fchi2"></a><dl>
<dt><a name="index-pdf_005fchi2"></a>Função: <strong>pdf_chi2</strong> <em>(<var>x</var>,<var>n</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade de uma
variável aleatória Chi-quadrada <em>Chi^2(n)</em>, com <em>n&gt;0</em>.
</p>
<p>A  variável aleatória <em>Chi^2(n)</em> é equivalente a <em>Gamma(n/2,2)</em>,
portanto quando Maxima não tiver informação para pegar o resultado, uma
forma nomial baseada na função de densidade densidade de probabilidade da
função  gama é
retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) pdf_chi2(x,n);
                                    n
(%o2)                  pdf_gamma(x, -, 2)
                                    2
(%i3) assume(x&gt;0, n&gt;0)$  pdf_chi2(x,n);
                         n/2 - 1   - x/2
                        x        %e
(%o4)                   ----------------
                          n/2       n
                         2    gamma(-)
                                    2
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005fchi2"></a><dl>
<dt><a name="index-cdf_005fchi2"></a>Função: <strong>cdf_chi2</strong> <em>(<var>x</var>,<var>n</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade
de uma variável aleatória Chi-quadrada <em>Chi^2(n)</em>, com <em>n&gt;0</em>.
</p>
<p>Essa função não possui uma forma fechada e é calculada numericamante
se a variável global <code>numer</code> for igual a <code>true</code>,  de outra forma essa
função retorna uma expressão nominal baseada na 
distribuição gama, uma vez
que a variável aleatória <em>Chi^2(n)</em>
é equivalente a    é equivalente a <em>Gamma(n/2,2)</em>.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) cdf_chi2(3,4);
(%o2)                  cdf_gamma(3, 2, 2)
(%i3) cdf_chi2(3,4),numer;
(%o3)                   .4421745996289249
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005fchi2"></a><dl>
<dt><a name="index-quantile_005fchi2"></a>Função: <strong>quantile_chi2</strong> <em>(<var>q</var>,<var>n</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantilede uma variável aleatória Chi-quadrada <em>Chi^2(n)</em>,
com <em>n&gt;0</em>; em outras palavras, essa função é a inversa da função
<code>cdf_chi2</code>. O argumento <var>q</var> deve ser um elemento
de
<em>[0,1]</em>.
</p>
<p>This função não possui uma forma fechada e é calculada numericamante se
a variável global <code>numer</code> for igual a <code>true</code>,  de outra forma essa
função retorna uma expressão nominal baseada no quantil da função
gama, uma vez que a variável aleatória <em>Chi^2(n)</em> é equivalente a <em>Gamma(n/2,2)</em>.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) quantile_chi2(0.99,9);
(%o2)                   21.66599433346194
(%i3) quantile_chi2(0.99,n);
                                        n
(%o3)              quantile_gamma(0.99, -, 2)
                                        2
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmean_005fchi2"></a><dl>
<dt><a name="index-mean_005fchi2"></a>Função: <strong>mean_chi2</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Retorna a média de uma variável aleatória Chi-quadrada <em>Chi^2(n)</em>, com <em>n&gt;0</em>.
</p>
<p>A variável aleatória <em>Chi^2(n)</em> é equivalente a <em>Gamma(n/2,2)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada na média da função gama é
retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) mean_chi2(n);
                                   n
(%o2)                   mean_gamma(-, 2)
                                   2
(%i3) assume(n&gt;0)$ mean_chi2(n);
(%o4)                           n
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005fchi2"></a><dl>
<dt><a name="index-var_005fchi2"></a>Função: <strong>var_chi2</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Retorna a variância de uma variável aleatória Chi-quadrada <em>Chi^2(n)</em>, com <em>n&gt;0</em>.
</p>
<p>A variável aleatória <em>Chi^2(n)</em> é equivalente a <em>Gamma(n/2,2)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada na variância da função gama
é retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) var_chi2(n);
                                   n
(%o2)                    var_gamma(-, 2)
                                   2
(%i3) assume(n&gt;0)$ var_chi2(n);
(%o4)                          2 n
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fstd_005fchi2"></a><dl>
<dt><a name="index-std_005fchi2"></a>Função: <strong>std_chi2</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma variável aleatória Chi-quadrada
<em>Chi^2(n)</em>, com <em>n&gt;0</em>.
</p>
<p>A variável aleatória <em>Chi^2(n)</em> é equivalente a <em>Gamma(n/2,2)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada no desvio padrão da função
gama é retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) std_chi2(n);
                                   n
(%o2)                    std_gamma(-, 2)
                                   2
(%i3) assume(n&gt;0)$ std_chi2(n);
(%o4)                    sqrt(2) sqrt(n)
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fskewness_005fchi2"></a><dl>
<dt><a name="index-skewness_005fchi2"></a>Função: <strong>skewness_chi2</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma variável aleatória Chi-quadrada
<em>Chi^2(n)</em>, com <em>n&gt;0</em>.
</p>
<p>A variável aleatória <em>Chi^2(n)</em> é equivalente a <em>Gamma(n/2,2)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada no coeficiente de assimetria da
função gama é
retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) skewness_chi2(n);
                                     n
(%o2)                 skewness_gamma(-, 2)
                                     2
(%i3) assume(n&gt;0)$ skewness_chi2(n);
                            2 sqrt(2)
(%o4)                       ---------
                             sqrt(n)
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005fchi2"></a><dl>
<dt><a name="index-kurtosis_005fchi2"></a>Função: <strong>kurtosis_chi2</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma variável aleatória Chi-quadrada
<em>Chi^2(n)</em>, com <em>n&gt;0</em>.
</p>
<p>A variável aleatória <em>Chi^2(n)</em> é equivalente a <em>Gamma(n/2,2)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada no coeficiente de curtose da função gama é retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) kurtosis_chi2(n);
                                     n
(%o2)                 kurtosis_gamma(-, 2)
                                     2
(%i3) assume(n&gt;0)$ kurtosis_chi2(n);
                               12
(%o4)                          --
                               n
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdefvr_002frandom_005fchi2_005falgorithm"></a><dl>
<dt><a name="index-random_005fchi2_005falgorithm"></a>Variável de opção: <strong>random_chi2_algorithm</strong></dt>
<dd><p>Valor por omissão: <code>ahrens_cheng</code>
</p>
<p>Esse é o algoritmo seleccionado para simular variáveis estatística pseudo-aleatórias
Chi-quadradas. Os algoritmos implementados são <code>ahrens_cheng</code> e <code>inverse</code>:
</p><ul>
<li> <code>ahrens_cheng</code>, baseado na simulação aleatória de variáveis gama.
Veja <code>random_gamma_algorithm</code> para mais detalhes.

</li><li> <code>inverse</code>, baseado no método inverso genérico.

</li></ul>

<p>Veja também <code>random_chi2</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005fchi2"></a><dl>
<dt><a name="index-random_005fchi2"></a>Função: <strong>random_chi2</strong> <em>(<var>n</var>)</em></dt>
<dt><a name="index-random_005fchi2-1"></a>Função: <strong>random_chi2</strong> <em>(<var>n</var>,<var>m</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória Chi-square <em>Chi^2(n)</em>,
com <em>n&gt;0</em>. Chamando <code>random_chi2</code> com um segundo argumento <var>m</var>,
uma amostra aleatória de tamanho <var>m</var> será simulada.
</p>
<p>Existem dois algoritmos implementados para essa função, se pode seleccionar o
algoritmo a ser usado fornecendo um certo valor à variável global
<code>random_chi2_algorithm</code>, cujo valor padrão é
<code>ahrens_cheng</code>.
</p>
<p>Veja também <code>random_chi2_algorithm</code>. Para fazer uso dessa função,
escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fpdf_005ff"></a><dl>
<dt><a name="index-pdf_005ff"></a>Função: <strong>pdf_f</strong> <em>(<var>x</var>,<var>m</var>,<var>n</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade de uma
variável aleatória F, <em>F(m,n)</em>, com <em>m,n&gt;0</em>. Para fazer uso dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005ff"></a><dl>
<dt><a name="index-cdf_005ff"></a>Função: <strong>cdf_f</strong> <em>(<var>x</var>,<var>m</var>,<var>n</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade de
uma variável aleatória F, <em>F(m,n)</em>, com <em>m,n&gt;0</em>. Essa função
não possui uma forma definitiva e é calculada numericamente se
a
variável global
<code>numer</code> for igual a <code>true</code>,  de outra forma retorna uma expressão nominal.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) cdf_f(2,3,9/4);
                                     9
(%o2)                    cdf_f(2, 3, -)
                                     4
(%i3) %,numer;
(%o3)                   0.66756728179008
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005ff"></a><dl>
<dt><a name="index-quantile_005ff"></a>Função: <strong>quantile_f</strong> <em>(<var>q</var>,<var>m</var>,<var>n</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantil de uma variável aleatória F, <em>F(m,n)</em>, com <em>m,n&gt;0</em>;
em outras palavras, essa função é o inverso de <code>cdf_f</code>. O argumento <var>q</var> deve ser um elemento de <em>[0,1]</em>.
</p>
<p>Essa função não possui uma forma fechada e é calculada numericamante se a
variável global <code>numer</code> for igual a <code>true</code>,  de outra forma essa função
retorna uma expressão nominal.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) quantile_f(2/5,sqrt(3),5);
                               2
(%o2)               quantile_f(-, sqrt(3), 5)
                               5
(%i3) %,numer;
(%o3)                   0.518947838573693
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmean_005ff"></a><dl>
<dt><a name="index-mean_005ff"></a>Função: <strong>mean_f</strong> <em>(<var>m</var>,<var>n</var>)</em></dt>
<dd><p>Retorna a média de uma variável aleatória F, <em>F(m,n)</em>, com <em>m&gt;0, n&gt;2</em>.
Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005ff"></a><dl>
<dt><a name="index-var_005ff"></a>Função: <strong>var_f</strong> <em>(<var>m</var>,<var>n</var>)</em></dt>
<dd><p>Retorna a variância de uma variável aleatória F, <em>F(m,n)</em>, com <em>m&gt;0, n&gt;4</em>.
Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fstd_005ff"></a><dl>
<dt><a name="index-std_005ff"></a>Função: <strong>std_f</strong> <em>(<var>m</var>,<var>n</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma variável aleatória F, <em>F(m,n)</em>, com <em>m&gt;0, n&gt;4</em>.
Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fskewness_005ff"></a><dl>
<dt><a name="index-skewness_005ff"></a>Função: <strong>skewness_f</strong> <em>(<var>m</var>,<var>n</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma variável aleatória F, <em>F(m,n)</em>,
com <em>m&gt;0, n&gt;6</em>. Para fazer uso dessa função, escreva primeiramente
<code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005ff"></a><dl>
<dt><a name="index-kurtosis_005ff"></a>Função: <strong>kurtosis_f</strong> <em>(<var>m</var>,<var>n</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma variável aleatória F, <em>F(m,n)</em>,
com <em>m&gt;0, n&gt;8</em>. Para fazer uso dessa função, escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdefvr_002frandom_005ff_005falgorithm"></a><dl>
<dt><a name="index-random_005ff_005falgorithm"></a>Variável de opção: <strong>random_f_algorithm</strong></dt>
<dd><p>Valor por omissão: <code>inverse</code>
</p>
<p>Esse é o algoritmo seleccionado para simular variáveis estatísticas
pseudo-aleatórias F. Os algoritmos implementados são <code>ratio</code>
e <code>inverse</code>:
</p><ul>
<li> <code>ratio</code>, baseado no facto de que se <var>X</var> for uma variável aleatória
<em>Chi^2(m)</em> e <em>Y</em> for uma variável aleatória <em>Chi^2(n)</em>,
então
<div class="example">
<pre class="example">                        n X
                    F = ---
                        m Y
</pre></div>
<p>é uma variável aleatória F com <var>m</var> e <var>n</var> graus de liberdade, <em>F(m,n)</em>.
</p>
</li><li> <code>inverse</code>, baseado no método inverso genérico.

</li></ul>

<p>Veja também <code>random_f</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005ff"></a><dl>
<dt><a name="index-random_005ff"></a>Função: <strong>random_f</strong> <em>(<var>m</var>,<var>n</var>)</em></dt>
<dt><a name="index-random_005ff-1"></a>Função: <strong>random_f</strong> <em>(<var>m</var>,<var>n</var>,<var>k</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória F, <em>F(m,n)</em>,
com <em>m,n&gt;0</em>. Chamando <code>random_f</code> com um terceiro argumento
<var>k</var>, uma amostra aleatória de tamanho <var>k</var> será simulada.
</p>
<p>Existem dois algoritmos implementados para essa função, se pode seleccionar
o algoritmo a ser usado fornecendo um certo valor à variável global
<code>random_f_algorithm</code>, cujo valor padrão é <code>inverse</code>.
</p>
<p>Veja também <code>random_f_algorithm</code>. Para fazer uso dessa função,
escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>

<a name="Item_003a-distrib_002fdeffn_002fpdf_005fexp"></a><dl>
<dt><a name="index-pdf_005fexp"></a>Função: <strong>pdf_exp</strong> <em>(<var>x</var>,<var>m</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade
variável aleatória <em>Exponential(m)</em>, com <em>m&gt;0</em>.
</p>
<p>A variável aleatória <em>Exponential(m)</em> é equivalente a
<em>Weibull(1,1/m)</em>, embora quando Maxima não tiver informação
disponível para pegar o resultado, uma forma nominal baseada na função
de densidade de probabilidade de Weibull éretornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) pdf_exp(x,m);
                                        1
(%o2)                 pdf_weibull(x, 1, -)
                                        m
(%i3) assume(x&gt;0,m&gt;0)$  pdf_exp(x,m);
                                - m x
(%o4)                       m %e
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005fexp"></a><dl>
<dt><a name="index-cdf_005fexp"></a>Função: <strong>cdf_exp</strong> <em>(<var>x</var>,<var>m</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade
variável aleatória <em>Exponential(m)</em>, com <em>m&gt;0</em>.
</p>
<p>A variável aleatória <em>Exponential(m)</em> é equivalente a <em>Weibull(1,1/m)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada na distribuição de
Weibull é
retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) cdf_exp(x,m);
                                        1
(%o2)                 cdf_weibull(x, 1, -)
                                        m
(%i3) assume(x&gt;0,m&gt;0)$  cdf_exp(x,m);
                                 - m x
(%o4)                      1 - %e
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005fexp"></a><dl>
<dt><a name="index-quantile_005fexp"></a>Função: <strong>quantile_exp</strong> <em>(<var>q</var>,<var>m</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantil variável aleatória <em>Exponential(m)</em>, com <em>m&gt;0</em>;
em outras palavras, essa função é inversa da função <code>cdf_exp</code>.
O argumento <var>q</var> deve ser um elemento de <em>[0,1]</em>.
</p>
<p>A variável aleatória <em>Exponential(m)</em> é equivalente a <em>Weibull(1,1/m)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada no qualtil de Weibull é
retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) quantile_exp(0.56,5);
(%o2)                   .1641961104139661
(%i3) quantile_exp(0.56,m);
                                            1
(%o3)             quantile_weibull(0.56, 1, -)
                                            m
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmean_005fexp"></a><dl>
<dt><a name="index-mean_005fexp"></a>Função: <strong>mean_exp</strong> <em>(<var>m</var>)</em></dt>
<dd><p>Retorna a média de uma variável aleatória <em>Exponential(m)</em>, com <em>m&gt;0</em>.
</p>
<p>A variável aleatória <em>Exponential(m)</em> é equivalente a <em>Weibull(1,1/m)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada na média de Weibull é
reornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) mean_exp(m);
                                       1
(%o2)                  mean_weibull(1, -)
                                       m
(%i3) assume(m&gt;0)$  mean_exp(m);
                                1
(%o4)                           -
                                m
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005fexp"></a><dl>
<dt><a name="index-var_005fexp"></a>Função: <strong>var_exp</strong> <em>(<var>m</var>)</em></dt>
<dd><p>Retorna a variância de uma variável aleatória <em>Exponential(m)</em>, com <em>m&gt;0</em>.
</p>
<p>A variável aleatória <em>Exponential(m)</em> é equivalente a <em>Weibull(1,1/m)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada na variância de Weibull
é retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) var_exp(m);
                                       1
(%o2)                   var_weibull(1, -)
                                       m
(%i3) assume(m&gt;0)$  var_exp(m);
                               1
(%o4)                          --
                                2
                               m
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fstd_005fexp"></a><dl>
<dt><a name="index-std_005fexp"></a>Função: <strong>std_exp</strong> <em>(<var>m</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma variável aleatória <em>Exponential(m)</em>, com <em>m&gt;0</em>.
</p>
<p>A variável aleatória <em>Exponential(m)</em> é equivalente a <em>Weibull(1,1/m)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada no desvio padrão de
Weibull é retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) std_exp(m);
                                       1
(%o2)                   std_weibull(1, -)
                                       m
(%i3) assume(m&gt;0)$  std_exp(m);
                                1
(%o4)                           -
                                m
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fskewness_005fexp"></a><dl>
<dt><a name="index-skewness_005fexp"></a>Função: <strong>skewness_exp</strong> <em>(<var>m</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma variável aleatória <em>Exponential(m)</em>, com <em>m&gt;0</em>.
</p>
<p>A variável aleatória <em>Exponential(m)</em> é equivalente a <em>Weibull(1,1/m)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada no coeficiente de assimetria
de Weibull
é retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) skewness_exp(m);
                                         1
(%o2)                skewness_weibull(1, -)
                                         m
(%i3) assume(m&gt;0)$  skewness_exp(m);
(%o4)                           2
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005fexp"></a><dl>
<dt><a name="index-kurtosis_005fexp"></a>Função: <strong>kurtosis_exp</strong> <em>(<var>m</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma variável aleatória <em>Exponential(m)</em>, com <em>m&gt;0</em>.
</p>
<p>A variável aleatória <em>Exponential(m)</em> é equivalente a <em>Weibull(1,1/m)</em>, embora
quando Maxima não tiver informação disponível para pegar o resultado, uma forma nominal
baseada no coeficiente de curtose de Weibull é retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) kurtosis_exp(m);
                                         1
(%o2)                kurtosis_weibull(1, -)
                                         m
(%i3) assume(m&gt;0)$  kurtosis_exp(m);
(%o4)                           6
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdefvr_002frandom_005fexp_005falgorithm"></a><dl>
<dt><a name="index-random_005fexp_005falgorithm"></a>Variável de opção: <strong>random_exp_algorithm</strong></dt>
<dd><p>Valor por omissão: <code>inverse</code>
</p>
<p>Esse é o algoritmo seleccionado para simular variáveis exponenciais estatística
pseudo-aleatórias. Os algoritmos implementados são <code>inverse</code>,
<code>ahrens_cheng</code> e <code>ahrens_dieter</code>
</p><ul>
<li> <code>inverse</code>, baseado no método inverso genérico.

</li><li> <code>ahrens_cheng</code>, baseado no facto de que a variável aleatória <em>Exp(m)</em>
é equivalente a <em>Gamma(1,1/m)</em>. Veja <code>random_gamma_algorithm</code>
para maiores detalhes.

</li><li> <code>ahrens_dieter</code>, baseado no algoritmo descrito em Ahrens, J.H. e Dieter, U. (1972)
<var>Computer methods for sampling from the exponential and normal distributions.</var>
Comm, ACM, 15, Oct.,  873-882.

</li></ul>

<p>Veja também <code>random_exp</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005fexp"></a><dl>
<dt><a name="index-random_005fexp"></a>Função: <strong>random_exp</strong> <em>(<var>m</var>)</em></dt>
<dt><a name="index-random_005fexp-1"></a>Função: <strong>random_exp</strong> <em>(<var>m</var>,<var>k</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória <em>Exponential(m)</em>,
com <em>m&gt;0</em>. Chamando <code>random_exp</code> com um segundo argumento
<var>k</var>, uma amostra aleatória de tamanho <var>k</var> será simulada.
</p>
<p>Existem três algoritmos implementados para essa função, se pode
seleccionar o algoritmo a ser usado fornecendo um certo valor à variável global
<code>random_exp_algorithm</code>, cujo valor padrão é <code>inverse</code>.
</p>
<p>Veja também <code>random_exp_algorithm</code>. Para fazer uso dessa função,
escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fpdf_005flognormal"></a><dl>
<dt><a name="index-pdf_005flognormal"></a>Função: <strong>pdf_lognormal</strong> <em>(<var>x</var>,<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade de uma
variável aleatória <em>Lognormal(m,s)</em>, com <em>s&gt;0</em>. Para fazer uso
dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005flognormal"></a><dl>
<dt><a name="index-cdf_005flognormal"></a>Função: <strong>cdf_lognormal</strong> <em>(<var>x</var>,<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade
de uma variável aleatória <em>Lognormal(m,s)</em>, com <em>s&gt;0</em>. Essa
função é definida em termos de funções <code>erf</code>de erro
internas do Maxima.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) assume(x&gt;0, s&gt;0)$  cdf_lognormal(x,m,s);
                           log(x) - m
                       erf(----------)
                           sqrt(2) s     1
(%o3)                  --------------- + -
                              2          2
</pre></div>

<p>Veja também <code>erf</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005flognormal"></a><dl>
<dt><a name="index-quantile_005flognormal"></a>Função: <strong>quantile_lognormal</strong> <em>(<var>q</var>,<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantil de uma variável aleatória <em>Lognormal(m,s)</em>,
com <em>s&gt;0</em>; em outras palavras, essa função é a inversa da função
<code>cdf_lognormal</code>. O argumento <var>q</var> deve ser um elemento de <em>[0,1]</em>.
Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmean_005flognormal"></a><dl>
<dt><a name="index-mean_005flognormal"></a>Função: <strong>mean_lognormal</strong> <em>(<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna a média de uma variável aleatória <em>Lognormal(m,s)</em>, com <em>s&gt;0</em>.
Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005flognormal"></a><dl>
<dt><a name="index-var_005flognormal"></a>Função: <strong>var_lognormal</strong> <em>(<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna a variância de uma variável aleatória <em>Lognormal(m,s)</em>,
com <em>s&gt;0</em>. Para fazer uso dessa função, escreva primeiramente
<code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>

<a name="Item_003a-distrib_002fdeffn_002fstd_005flognormal"></a><dl>
<dt><a name="index-std_005flognormal"></a>Função: <strong>std_lognormal</strong> <em>(<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma variável aleatória <em>Lognormal(m,s)</em>,
com <em>s&gt;0</em>. Para fazer uso dessa função, escreva primeiramente
<code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fskewness_005flognormal"></a><dl>
<dt><a name="index-skewness_005flognormal"></a>Função: <strong>skewness_lognormal</strong> <em>(<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma variável aleatória <em>Lognormal(m,s)</em>,
com <em>s&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005flognormal"></a><dl>
<dt><a name="index-kurtosis_005flognormal"></a>Função: <strong>kurtosis_lognormal</strong> <em>(<var>m</var>,<var>s</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma variável aleatória <em>Lognormal(m,s)</em>,
com <em>s&gt;0</em>. Para fazer uso dessa função, escreva primeiramente
<code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005flognormal"></a><dl>
<dt><a name="index-random_005flognormal"></a>Função: <strong>random_lognormal</strong> <em>(<var>m</var>,<var>s</var>)</em></dt>
<dt><a name="index-random_005flognormal-1"></a>Função: <strong>random_lognormal</strong> <em>(<var>m</var>,<var>s</var>,<var>n</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória <em>Lognormal(m,s)</em>,
com <em>s&gt;0</em>. Chamando <code>random_lognormal</code> com um terceiro argumento
<var>n</var>, uma amostra aleatória de tamanho <var>n</var> será simulada.
</p>
<p>Variáveis Log-normal são simuladas por meio de variáveis estatísticas normais
pseudo-aleatórias. Existem dois algoritmos implementados para essa função, se
pode seleccionar o algoritmo a ser usado fornecendo um certo valor
à variável global
<code>random_normal_algorithm</code>, cujo valor padrão é <code>box_mueller</code>.
</p>
<p>Veja também <code>random_normal_algorithm</code>. Para fazer uso dessa função, escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fpdf_005fgamma"></a><dl>
<dt><a name="index-pdf_005fgamma"></a>Função: <strong>pdf_gamma</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade de uma
variável aleatória <em>Gamma(a,b)</em>, com <em>a,b&gt;0</em>. Para fazer uso dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005fgamma"></a><dl>
<dt><a name="index-cdf_005fgamma"></a>Função: <strong>cdf_gamma</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade de
uma variável aleatória <em>Gamma(a,b)</em>, com <em>a,b&gt;0</em>. 
</p>
<p>Essa função não possui uma forma fechada e é calculada numericamante se
a variável global <code>numer</code> for igual a <code>true</code>,  de outra forma essa função
retorna uma expressão nominal.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) cdf_gamma(3,5,21);
(%o2)                  cdf_gamma(3, 5, 21)
(%i3) %,numer;
(%o3)                 4.402663157135039E-7
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005fgamma"></a><dl>
<dt><a name="index-quantile_005fgamma"></a>Função: <strong>quantile_gamma</strong> <em>(<var>q</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantil de uma variável aleatória <em>Gamma(a,b)</em>,
com <em>a,b&gt;0</em>; em outras palavras, essa função é a inversa da
função <code>cdf_gamma</code>. O argumento <var>q</var> deve ser um elemento de
<em>[0,1]</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmean_005fgamma"></a><dl>
<dt><a name="index-mean_005fgamma"></a>Função: <strong>mean_gamma</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a média de uma variável aleatória <em>Gamma(a,b)</em>,
com <em>a,b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente
<code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005fgamma"></a><dl>
<dt><a name="index-var_005fgamma"></a>Função: <strong>var_gamma</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a variância de uma variável aleatória <em>Gamma(a,b)</em>, com
<em>a,b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>

<a name="Item_003a-distrib_002fdeffn_002fstd_005fgamma"></a><dl>
<dt><a name="index-std_005fgamma"></a>Função: <strong>std_gamma</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma variável aleatória <em>Gamma(a,b)</em>,
com <em>a,b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente
<code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fskewness_005fgamma"></a><dl>
<dt><a name="index-skewness_005fgamma"></a>Função: <strong>skewness_gamma</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma variável aleatória <em>Gamma(a,b)</em>,
com <em>a,b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005fgamma"></a><dl>
<dt><a name="index-kurtosis_005fgamma"></a>Função: <strong>kurtosis_gamma</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma variável aleatória <em>Gamma(a,b)</em>,
com <em>a,b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdefvr_002frandom_005fgamma_005falgorithm"></a><dl>
<dt><a name="index-random_005fgamma_005falgorithm"></a>Variável de opção: <strong>random_gamma_algorithm</strong></dt>
<dd><p>Valor por omissão: <code>ahrens_cheng</code>
</p>
<p>Esse é o algoritmo seleccionado para simular variáveis estatística gama
pseudo-aleatórias. Os algoritmos implementados são <code>ahrens_cheng</code>
e <code>inverse</code>
</p><ul>
<li> <code>ahrens_cheng</code>, essa é uma combinação de dois processos, dependendo
do valor do parâmetro <var>a</var>:

<p>For <em>a&gt;=1</em>, Cheng, R.C.H. e Feast, G.M. (1979). <var>Some simple gamma variate
generators</var>. Appl. Stat., 28, 3, 290-295.
</p>
<p>For <em>0&lt;a&lt;1</em>, Ahrens, J.H. e Dieter, U. (1974). <var>Computer methods for sampling
from gamma, beta, poisson and binomial cdf_tributions</var>. Computing, 12, 223-246.
</p>
</li><li> <code>inverse</code>, baseado no método inverso genérico.

</li></ul>

<p>Veja também <code>random_gamma</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005fgamma"></a><dl>
<dt><a name="index-random_005fgamma"></a>Função: <strong>random_gamma</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dt><a name="index-random_005fgamma-1"></a>Função: <strong>random_gamma</strong> <em>(<var>a</var>,<var>b</var>,<var>n</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória <em>Gamma(a,b)</em>,
com <em>a,b&gt;0</em>. Chamando <code>random_gamma</code> com um terceiro argumento
<var>n</var>, uma amostra aleatória de tamanho <var>n</var> será simulada.
</p>
<p>Existem dois algoritmos implementados para essa função, se pode seleccionar
o algoritmo a ser usado fornecendo um certo valor à variável global <code>random_gamma_algorithm</code>, cujo valor padrão é
<code>ahrens_cheng</code>.
</p>
<p>Veja também <code>random_gamma_algorithm</code>. Para fazer uso dessa função,
escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fpdf_005fbeta"></a><dl>
<dt><a name="index-pdf_005fbeta"></a>Função: <strong>pdf_beta</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade de uma variável
aleatória <em>Beta(a,b)</em>, com <em>a,b&gt;0</em>. Para fazer uso dessa função, escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>



<a name="Item_003a-distrib_002fdeffn_002fcdf_005fbeta"></a><dl>
<dt><a name="index-cdf_005fbeta"></a>Função: <strong>cdf_beta</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade de
uma variável aleatória <em>Beta(a,b)</em>, com <em>a,b&gt;0</em>. 
</p>
<p>Essa função não possui uma forma fechada e é calculada numericamante se a
variável global <code>numer</code> for igual a <code>true</code>,  de outra forma essa função
retorna uma expressão nominal.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) cdf_beta(1/3,15,2);
                                 1
(%o2)                   cdf_beta(-, 15, 2)
                                 3
(%i3) %,numer;
(%o3)                 7.666089131388224E-7
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005fbeta"></a><dl>
<dt><a name="index-quantile_005fbeta"></a>Função: <strong>quantile_beta</strong> <em>(<var>q</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantil de uma variável aleatória <em>Beta(a,b)</em>, com
<em>a,b&gt;0</em>; em outras palavras, essa função é a inversa da função
<code>cdf_beta</code>. O argumento <var>q</var> deve ser um elemento de
<em>[0,1]</em>. Para
fazer uso dessa
função,
escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmean_005fbeta"></a><dl>
<dt><a name="index-mean_005fbeta"></a>Função: <strong>mean_beta</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a média de uma variável aleatória <em>Beta(a,b)</em>, com <em>a,b&gt;0</em>.
Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005fbeta"></a><dl>
<dt><a name="index-var_005fbeta"></a>Função: <strong>var_beta</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a variância de uma variável aleatória <em>Beta(a,b)</em>, com <em>a,b&gt;0</em>.
Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>

<a name="Item_003a-distrib_002fdeffn_002fstd_005fbeta"></a><dl>
<dt><a name="index-std_005fbeta"></a>Função: <strong>std_beta</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma variável aleatória <em>Beta(a,b)</em>, com <em>a,b&gt;0</em>.
Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fskewness_005fbeta"></a><dl>
<dt><a name="index-skewness_005fbeta"></a>Função: <strong>skewness_beta</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma variável aleatória <em>Beta(a,b)</em>,
com <em>a,b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005fbeta"></a><dl>
<dt><a name="index-kurtosis_005fbeta"></a>Função: <strong>kurtosis_beta</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma variável aleatória <em>Beta(a,b)</em>,
com <em>a,b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdefvr_002frandom_005fbeta_005falgorithm"></a><dl>
<dt><a name="index-random_005fbeta_005falgorithm"></a>Variável de opção: <strong>random_beta_algorithm</strong></dt>
<dd><p>Valor por omissão: <code>cheng</code>
</p>
<p>Esse é o algoritmo seleccionado para simular variáveis estatísticas beta
pseudo-aleatórias. Os algoritmos implementados são <code>cheng</code>,
<code>inverse</code> e <code>ratio</code>
</p><ul>
<li> <code>cheng</code>, esse é o algoritmo definido em Cheng, R.C.H.  (1978). 
<var>Generating Beta Variates with Nonintegral Shape Parameters</var>.
Communications of the ACM, 21:317-322

</li><li> <code>inverse</code>, baseado no método inverso genérico.

</li><li> <code>ratio</code>, baseado no facto de que se <var>X</var> for uma variável aleatória
<em>Gamma(a,1)</em> e <var>Y</var> for <em>Gamma(b,1)</em>, então a razão <em>X/(X+Y)</em>
está distribuída como <em>Beta(a,b)</em>.

</li></ul>

<p>Veja também <code>random_beta</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005fbeta"></a><dl>
<dt><a name="index-random_005fbeta"></a>Função: <strong>random_beta</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dt><a name="index-random_005fbeta-1"></a>Função: <strong>random_beta</strong> <em>(<var>a</var>,<var>b</var>,<var>n</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória <em>Beta(a,b)</em>,
com <em>a,b&gt;0</em>. Chamando <code>random_beta</code> com um terceiro argumento <var>n</var>,
uma amostra aleatória de tamanho <var>n</var> será simulada.
</p>
<p>Existem três algoritmos implementados para essa função, se pode seleccionar
o algoritmo a ser usado fornecendo um certo valor à variável global
<code>random_beta_algorithm</code>, cujo valor padrão é <code>cheng</code>.
</p>
<p>Veja também <code>random_beta_algorithm</code>. Para fazer uso dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>

<a name="Item_003a-distrib_002fdeffn_002fpdf_005fcontinuous_005funiform"></a><dl>
<dt><a name="index-pdf_005fcontinuous_005funiform"></a>Função: <strong>pdf_continuous_uniform</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade
de uma variável aleatória <em>Continuous Uniform(a,b)</em>, com <em>a&lt;b</em>.
Para fazer uso dessa função, escreva primeiramente
<code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005fcontinuous_005funiform"></a><dl>
<dt><a name="index-cdf_005fcontinuous_005funiform"></a>Função: <strong>cdf_continuous_uniform</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade
de uma variável aleatória <em>Continuous Uniform(a,b)</em>, com <em>a&lt;b</em>.
Para fazer uso dessa função, escreva primeiramente
<code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005fcontinuous_005funiform"></a><dl>
<dt><a name="index-quantile_005fcontinuous_005funiform"></a>Função: <strong>quantile_continuous_uniform</strong> <em>(<var>q</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantil de uma variável aleatória <em>Continuous Uniform(a,b)</em>,
com <em>a&lt;b</em>; em outras palavras, essa função é a inversa da função
<code>cdf_continuous_uniform</code>. O argumento <var>q</var> deve
ser um elemento
de <em>[0,1]</em>.
Para
fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmean_005fcontinuous_005funiform"></a><dl>
<dt><a name="index-mean_005fcontinuous_005funiform"></a>Função: <strong>mean_continuous_uniform</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a média de uma variável aleatória <em>Continuous Uniform(a,b)</em>,
com <em>a&lt;b</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005fcontinuous_005funiform"></a><dl>
<dt><a name="index-var_005fcontinuous_005funiform"></a>Função: <strong>var_continuous_uniform</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a variância de uma variável aleatória <em>Continuous Uniform(a,b)</em>,
com <em>a&lt;b</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>

<a name="Item_003a-distrib_002fdeffn_002fstd_005fcontinuous_005funiform"></a><dl>
<dt><a name="index-std_005fcontinuous_005funiform"></a>Função: <strong>std_continuous_uniform</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma variável aleatória <em>Continuous Uniform(a,b)</em>,
com <em>a&lt;b</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fskewness_005fcontinuous_005funiform"></a><dl>
<dt><a name="index-skewness_005fcontinuous_005funiform"></a>Função: <strong>skewness_continuous_uniform</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma variável aleatória <em>Continuous Uniform(a,b)</em>,
com <em>a&lt;b</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005fcontinuous_005funiform"></a><dl>
<dt><a name="index-kurtosis_005fcontinuous_005funiform"></a>Função: <strong>kurtosis_continuous_uniform</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma variável aleatória <em>Continuous Uniform(a,b)</em>,
com <em>a&lt;b</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005fcontinuous_005funiform"></a><dl>
<dt><a name="index-random_005fcontinuous_005funiform"></a>Função: <strong>random_continuous_uniform</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dt><a name="index-random_005fcontinuous_005funiform-1"></a>Função: <strong>random_continuous_uniform</strong> <em>(<var>a</var>,<var>b</var>,<var>n</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória <em>Continuous Uniform(a,b)</em>,
com <em>a&lt;b</em>. Chamando <code>random_continuous_uniform</code> com um terceiro
argumento <var>n</var>, uma amostra aleatória de tamanho <var>n</var> será simulada.
</p>
<p>Essa é uma aplicação directa da função <code>random</code> interna do Maxima.
</p>
<p>Veja também <code>random</code>. Para fazer uso dessa função, escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fpdf_005flogistic"></a><dl>
<dt><a name="index-pdf_005flogistic"></a>Função: <strong>pdf_logistic</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade de
uma variável aleatória <em>Logistic(a,b)</em> , com <em>b&gt;0</em>. Para fazer
uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005flogistic"></a><dl>
<dt><a name="index-cdf_005flogistic"></a>Função: <strong>cdf_logistic</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade
de uma variável aleatória <em>Logistic(a,b)</em>, com <em>b&gt;0</em>. Para fazer
uso dessa função, escreva primeiramente
<code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005flogistic"></a><dl>
<dt><a name="index-quantile_005flogistic"></a>Função: <strong>quantile_logistic</strong> <em>(<var>q</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantil de uma variável aleatória <em>Logistic(a,b)</em> , com
<em>b&gt;0</em>; em outras palavras, essa função é a inversa da função
<code>cdf_logistic</code>. O argumento <var>q</var> deve ser um elemento de
<em>[0,1]</em>.
Para fazer uso
dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmeanlog"></a><dl>
<dt><a name="index-meanlog"></a>Função: <strong>meanlog</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a média de uma <em>Logistic(a,b)</em> variável aleatória , com <em>b&gt;0</em>.
Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005flogistic"></a><dl>
<dt><a name="index-var_005flogistic"></a>Função: <strong>var_logistic</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a variância de uma variável aleatória <em>Logistic(a,b)</em> , com <em>b&gt;0</em>.
Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fstd_005flogistic"></a><dl>
<dt><a name="index-std_005flogistic"></a>Função: <strong>std_logistic</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma variável aleatória <em>Logistic(a,b)</em> ,
com <em>b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente
<code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fskewness_005flogistic"></a><dl>
<dt><a name="index-skewness_005flogistic"></a>Função: <strong>skewness_logistic</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma variável aleatória <em>Logistic(a,b)</em> ,
com <em>b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005flogistic"></a><dl>
<dt><a name="index-kurtosis_005flogistic"></a>Função: <strong>kurtosis_logistic</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma variável aleatória <em>Logistic(a,b)</em> ,
com <em>b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005flogistic"></a><dl>
<dt><a name="index-random_005flogistic"></a>Função: <strong>random_logistic</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dt><a name="index-random_005flogistic-1"></a>Função: <strong>random_logistic</strong> <em>(<var>a</var>,<var>b</var>,<var>n</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória <em>Logistic(a,b)</em>, com <em>b&gt;0</em>.
Chamando <code>random_logistic</code> com um terceiro argumento <var>n</var>, uma
amostra aleatória de tamanho <var>n</var> será simulada.
</p>
<p>Somente o método inverso genérico está implementado. Para fazer uso dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fpdf_005fpareto"></a><dl>
<dt><a name="index-pdf_005fpareto"></a>Função: <strong>pdf_pareto</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade de uma
variável aleatória <em>Pareto(a,b)</em>, com <em>a,b&gt;0</em>. Para fazer uso
dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005fpareto"></a><dl>
<dt><a name="index-cdf_005fpareto"></a>Função: <strong>cdf_pareto</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade
de uma variável aleatória <em>Pareto(a,b)</em>, com <em>a,b&gt;0</em>. Para fazer
uso dessa função, escreva primeiramente
<code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005fpareto"></a><dl>
<dt><a name="index-quantile_005fpareto"></a>Função: <strong>quantile_pareto</strong> <em>(<var>q</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantile de uma variável aleatória <em>Pareto(a,b)</em>,
com <em>a,b&gt;0</em>; em outras palavras, essa função é a inversa da
função <code>cdf_pareto</code>. O argumento <var>q</var> deve ser um elemento de
<em>[0,1]</em>. Para
fazer uso dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmean_005fpareto"></a><dl>
<dt><a name="index-mean_005fpareto"></a>Função: <strong>mean_pareto</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a média de uma variável aleatória <em>Pareto(a,b)</em>, com
<em>a&gt;1,b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente
<code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005fpareto"></a><dl>
<dt><a name="index-var_005fpareto"></a>Função: <strong>var_pareto</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a variância de uma variável aleatória <em>Pareto(a,b)</em>,
com <em>a&gt;2,b&gt;0</em>. Para fazer uso dessa função, escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>

<a name="Item_003a-distrib_002fdeffn_002fstd_005fpareto"></a><dl>
<dt><a name="index-std_005fpareto"></a>Função: <strong>std_pareto</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma variável aleatória <em>Pareto(a,b)</em>,
com <em>a&gt;2,b&gt;0</em>. Para fazer uso dessa função, escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>



<a name="Item_003a-distrib_002fdeffn_002fskewness_005fpareto"></a><dl>
<dt><a name="index-skewness_005fpareto"></a>Função: <strong>skewness_pareto</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma variável aleatória
<em>Pareto(a,b)</em>, com <em>a&gt;3,b&gt;0</em>. Para fazer uso dessa função,
escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005fpareto"></a><dl>
<dt><a name="index-kurtosis_005fpareto"></a>Função: <strong>kurtosis_pareto</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma variável aleatória <em>Pareto(a,b)</em>,
com <em>a&gt;4,b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente
<code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005fpareto"></a><dl>
<dt><a name="index-random_005fpareto"></a>Função: <strong>random_pareto</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dt><a name="index-random_005fpareto-1"></a>Função: <strong>random_pareto</strong> <em>(<var>a</var>,<var>b</var>,<var>n</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória <em>Pareto(a,b)</em>, com
<em>a&gt;0,b&gt;0</em>. Chamando <code>random_pareto</code> com um terceiro
argumento <var>n</var>, uma amostra aleatória de tamanho <var>n</var> será simulada.
</p>
<p>Somente o método inverso genérico está implementado. Para fazer uso
dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fpdf_005fweibull"></a><dl>
<dt><a name="index-pdf_005fweibull"></a>Função: <strong>pdf_weibull</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade de uma
variável aleatória <em>Weibull(a,b)</em>, com <em>a,b&gt;0</em>. Para fazer uso dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005fweibull"></a><dl>
<dt><a name="index-cdf_005fweibull"></a>Função: <strong>cdf_weibull</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade de uma
variável aleatória <em>Weibull(a,b)</em>, com <em>a,b&gt;0</em>. Para fazer uso dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005fweibull"></a><dl>
<dt><a name="index-quantile_005fweibull"></a>Função: <strong>quantile_weibull</strong> <em>(<var>q</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantil de uma variável aleatória <em>Weibull(a,b)</em>,
com <em>a,b&gt;0</em>; em outras palavras, essa função é a inversa da
função <code>cdf_weibull</code>. O argumento <var>q</var> deve ser um elemento de
<em>[0,1]</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmean_005fweibull"></a><dl>
<dt><a name="index-mean_005fweibull"></a>Função: <strong>mean_weibull</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a média de uma variável aleatória <em>Weibull(a,b)</em>, com
<em>a,b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005fweibull"></a><dl>
<dt><a name="index-var_005fweibull"></a>Função: <strong>var_weibull</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a variância de uma variável aleatória <em>Weibull(a,b)</em>,
com <em>a,b&gt;0</em>. Para fazer uso dessa função, escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>

<a name="Item_003a-distrib_002fdeffn_002fstd_005fweibull"></a><dl>
<dt><a name="index-std_005fweibull"></a>Função: <strong>std_weibull</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma variável aleatória <em>Weibull(a,b)</em>,
com <em>a,b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>



<a name="Item_003a-distrib_002fdeffn_002fskewness_005fweibull"></a><dl>
<dt><a name="index-skewness_005fweibull"></a>Função: <strong>skewness_weibull</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma variável aleatória <em>Weibull(a,b)</em>,
com <em>a,b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005fweibull"></a><dl>
<dt><a name="index-kurtosis_005fweibull"></a>Função: <strong>kurtosis_weibull</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma variável aleatória <em>Weibull(a,b)</em>,
com <em>a,b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005fweibull"></a><dl>
<dt><a name="index-random_005fweibull"></a>Função: <strong>random_weibull</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dt><a name="index-random_005fweibull-1"></a>Função: <strong>random_weibull</strong> <em>(<var>a</var>,<var>b</var>,<var>n</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória <em>Weibull(a,b)</em>,
com <em>a,b&gt;0</em>. Chamando <code>random_weibull</code> com um terceiro argumento
<var>n</var>, uma amostra aleatória de tamanho <var>n</var> será simulada.
</p>
<p>Somente o método inverso genérico está implementado. Para fazer uso dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>



<a name="Item_003a-distrib_002fdeffn_002fpdf_005frayleigh"></a><dl>
<dt><a name="index-pdf_005frayleigh"></a>Função: <strong>pdf_rayleigh</strong> <em>(<var>x</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade de uma
variável aleatória <em>Rayleigh(b)</em>, com <em>b&gt;0</em>.
</p>
<p>A variável aleatória <em>Rayleigh(b)</em> é equivalente a <em>Weibull(2,1/b)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada na função densidade de probabilidade de Weibull é retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) pdf_rayleigh(x,b);
                                        1
(%o2)                 pdf_weibull(x, 2, -)
                                        b
(%i3) assume(x&gt;0,b&gt;0)$ pdf_rayleigh(x,b);
                                    2  2
                           2     - b  x
(%o4)                   2 b  x %e
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005frayleigh"></a><dl>
<dt><a name="index-cdf_005frayleigh"></a>Função: <strong>cdf_rayleigh</strong> <em>(<var>x</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade
de uma variável aleatória <em>Rayleigh(b)</em>, com <em>b&gt;0</em>.
</p>
<p>A variável aleatória <em>Rayleigh(b)</em> é equivalente a <em>Weibull(2,1/b)</em>,
embora quando Maxima não tiver informação disponível para pegar o
resultado, uma forma nominal baseada na distribuição de Weibull é retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) cdf_rayleigh(x,b);
                                        1
(%o2)                 cdf_weibull(x, 2, -)
                                        b
(%i3) assume(x&gt;0,b&gt;0)$ cdf_rayleigh(x,b);
                                   2  2
                                - b  x
(%o4)                     1 - %e
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005frayleigh"></a><dl>
<dt><a name="index-quantile_005frayleigh"></a>Função: <strong>quantile_rayleigh</strong> <em>(<var>q</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantil de uma variável aleatória <em>Rayleigh(b)</em>, com
<em>b&gt;0</em>; em outras palavras, essa função é a inversa da função
<code>cdf_rayleigh</code>. O argumento <var>q</var> deve ser um elemento de
<em>[0,1]</em>.
</p>
<p>A variável aleatória <em>Rayleigh(b)</em> é equivalente a <em>Weibull(2,1/b)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada no quantil de Weibull é
retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) quantile_rayleigh(0.99,b);
                                            1
(%o2)             quantile_weibull(0.99, 2, -)
                                            b
(%i3) assume(x&gt;0,b&gt;0)$ quantile_rayleigh(0.99,b);
                        2.145966026289347
(%o4)                   -----------------
                                b
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmean_005frayleigh"></a><dl>
<dt><a name="index-mean_005frayleigh"></a>Função: <strong>mean_rayleigh</strong> <em>(<var>b</var>)</em></dt>
<dd><p>Retorna a média de uma variável aleatória <em>Rayleigh(b)</em>, com <em>b&gt;0</em>.
</p>
<p>A variável aleatória <em>Rayleigh(b)</em> é equivalente a <em>Weibull(2,1/b)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada na meia de Weibull é retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) mean_rayleigh(b);
                                       1
(%o2)                  mean_weibull(2, -)
                                       b
(%i3) assume(b&gt;0)$ mean_rayleigh(b);
                            sqrt(%pi)
(%o4)                       ---------
                               2 b
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005frayleigh"></a><dl>
<dt><a name="index-var_005frayleigh"></a>Função: <strong>var_rayleigh</strong> <em>(<var>b</var>)</em></dt>
<dd><p>Retorna a variância de uma variável aleatória <em>Rayleigh(b)</em>, com <em>b&gt;0</em>.
</p>
<p>A variável aleatória <em>Rayleigh(b)</em> é equivalente a <em>Weibull(2,1/b)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada na variância de Weibull é retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) var_rayleigh(b);
                                       1
(%o2)                   var_weibull(2, -)
                                       b
(%i3) assume(b&gt;0)$ var_rayleigh(b);
                                 %pi
                             1 - ---
                                  4
(%o4)                        -------
                                2
                               b
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fstd_005frayleigh"></a><dl>
<dt><a name="index-std_005frayleigh"></a>Função: <strong>std_rayleigh</strong> <em>(<var>b</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma variável aleatória <em>Rayleigh(b)</em>, com <em>b&gt;0</em>.
</p>
<p>A variável aleatória <em>Rayleigh(b)</em> é equivalente a <em>Weibull(2,1/b)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada na Weibull desvio padrão é retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) std_rayleigh(b);
                                       1
(%o2)                   std_weibull(2, -)
                                       b
(%i3) assume(b&gt;0)$ std_rayleigh(b);
                                   %pi
                          sqrt(1 - ---)
                                    4
(%o4)                     -------------
                                b
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fskewness_005frayleigh"></a><dl>
<dt><a name="index-skewness_005frayleigh"></a>Função: <strong>skewness_rayleigh</strong> <em>(<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma variável aleatória <em>Rayleigh(b)</em>, com <em>b&gt;0</em>.
</p>
<p>A variável aleatória <em>Rayleigh(b)</em> é equivalente a <em>Weibull(2,1/b)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada no coeficiente de assimetria de Weibull  é retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) skewness_rayleigh(b);
                                         1
(%o2)                skewness_weibull(2, -)
                                         b
(%i3) assume(b&gt;0)$ skewness_rayleigh(b);
                         3/2
                      %pi      3 sqrt(%pi)
                      ------ - -----------
                        4           4
(%o4)                 --------------------
                               %pi 3/2
                          (1 - ---)
                                4
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005frayleigh"></a><dl>
<dt><a name="index-kurtosis_005frayleigh"></a>Função: <strong>kurtosis_rayleigh</strong> <em>(<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma variável aleatória <em>Rayleigh(b)</em>, com <em>b&gt;0</em>.
</p>
<p>A variável aleatória <em>Rayleigh(b)</em> é equivalente a <em>Weibull(2,1/b)</em>,
embora quando Maxima não tiver informação disponível para pegar o resultado,
uma forma nominal baseada no coeficiente de curtose de Weibull é retornada.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) kurtosis_rayleigh(b);
                                         1
(%o2)                kurtosis_weibull(2, -)
                                         b
(%i3) assume(b&gt;0)$ kurtosis_rayleigh(b);
                                  2
                             3 %pi
                         2 - ------
                               16
(%o4)                    ---------- - 3
                              %pi 2
                         (1 - ---)
                               4
</pre></div>
</dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005frayleigh"></a><dl>
<dt><a name="index-random_005frayleigh"></a>Função: <strong>random_rayleigh</strong> <em>(<var>b</var>)</em></dt>
<dt><a name="index-random_005frayleigh-1"></a>Função: <strong>random_rayleigh</strong> <em>(<var>b</var>,<var>n</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória <em>Rayleigh(b)</em>, com <em>b&gt;0</em>.
Chamando <code>random_rayleigh</code> com um segundo argumento <var>n</var>, uma amostra aleatória
de tamanho <var>n</var> será simulada.
</p>
<p>Somente o método inverso genérico está implementado. Para fazer uso dessa função,
escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>



<a name="Item_003a-distrib_002fdeffn_002fpdf_005flaplace"></a><dl>
<dt><a name="index-pdf_005flaplace"></a>Função: <strong>pdf_laplace</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade de uma
variável aleatória <em>Laplace(a,b)</em>, com <em>b&gt;0</em>. Para fazer uso dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005flaplace"></a><dl>
<dt><a name="index-cdf_005flaplace"></a>Função: <strong>cdf_laplace</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade
de uma variável aleatória <em>Laplace(a,b)</em>, com <em>b&gt;0</em>. Para fazer uso
dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005flaplace"></a><dl>
<dt><a name="index-quantile_005flaplace"></a>Função: <strong>quantile_laplace</strong> <em>(<var>q</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantil de uma variável aleatória <em>Laplace(a,b)</em>, com
<em>b&gt;0</em>; em outras palavras, essa função é a inversa da função
<code>cdf_laplace</code>. O argumento <var>q</var> deve ser um elemento de
<em>[0,1]</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmean_005flaplace"></a><dl>
<dt><a name="index-mean_005flaplace"></a>Função: <strong>mean_laplace</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a média de uma variável aleatória <em>Laplace(a,b)</em>,
com <em>b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005flaplace"></a><dl>
<dt><a name="index-var_005flaplace"></a>Função: <strong>var_laplace</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a variância de uma variável aleatória <em>Laplace(a,b)</em>,
com <em>b&gt;0</em>. Para fazer uso dessa função, escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fstd_005flaplace"></a><dl>
<dt><a name="index-std_005flaplace"></a>Função: <strong>std_laplace</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma variável aleatória <em>Laplace(a,b)</em>,
com <em>b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fskewness_005flaplace"></a><dl>
<dt><a name="index-skewness_005flaplace"></a>Função: <strong>skewness_laplace</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma variável aleatória <em>Laplace(a,b)</em>,
com <em>b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005flaplace"></a><dl>
<dt><a name="index-kurtosis_005flaplace"></a>Função: <strong>kurtosis_laplace</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma variável aleatória <em>Laplace(a,b)</em>,
com <em>b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005flaplace"></a><dl>
<dt><a name="index-random_005flaplace"></a>Função: <strong>random_laplace</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dt><a name="index-random_005flaplace-1"></a>Função: <strong>random_laplace</strong> <em>(<var>a</var>,<var>b</var>,<var>n</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória <em>Laplace(a,b)</em>, com <em>b&gt;0</em>.
Chamando <code>random_laplace</code> com um terceiro argumento <var>n</var>, uma
amostra aleatória de tamanho <var>n</var> será simulada.
</p>
<p>Somente o método inverso genérico está implementado. Para fazer uso dessa função,
escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>



<a name="Item_003a-distrib_002fdeffn_002fpdf_005fcauchy"></a><dl>
<dt><a name="index-pdf_005fcauchy"></a>Função: <strong>pdf_cauchy</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade de uma
variável aleatória <em>Cauchy(a,b)</em>, com <em>b&gt;0</em>. Para fazer uso dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005fcauchy"></a><dl>
<dt><a name="index-cdf_005fcauchy"></a>Função: <strong>cdf_cauchy</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade
de uma variável aleatória <em>Cauchy(a,b)</em>, com <em>b&gt;0</em>. Para fazer uso
dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005fcauchy"></a><dl>
<dt><a name="index-quantile_005fcauchy"></a>Função: <strong>quantile_cauchy</strong> <em>(<var>q</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantil de uma variável aleatória <em>Cauchy(a,b)</em>, com
<em>b&gt;0</em>; em outras palavras, essa função é a inversa da função
<code>cdf_cauchy</code>. O argumento <var>q</var> deve ser um elemento de <em>[0,1]</em>. Para
fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005fcauchy"></a><dl>
<dt><a name="index-random_005fcauchy"></a>Função: <strong>random_cauchy</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dt><a name="index-random_005fcauchy-1"></a>Função: <strong>random_cauchy</strong> <em>(<var>a</var>,<var>b</var>,<var>n</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo aleatória <em>Cauchy(a,b)</em>, com <em>b&gt;0</em>.
Chamando <code>random_cauchy</code> com um terceiro argumento <var>n</var>, uma amostra
aleatória de tamanho <var>n</var> será simulada.
</p>
<p>Somente o método inverso genérico está implementado. Para fazer uso dessa função,
escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>



<a name="Item_003a-distrib_002fdeffn_002fpdf_005fgumbel"></a><dl>
<dt><a name="index-pdf_005fgumbel"></a>Função: <strong>pdf_gumbel</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função densidade de probabilidade de uma variável
aleatória <em>Gumbel(a,b)</em>, com <em>b&gt;0</em>. Para fazer uso dessa função, escreva
primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fcdf_005fgumbel"></a><dl>
<dt><a name="index-cdf_005fgumbel"></a>Função: <strong>cdf_gumbel</strong> <em>(<var>x</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o valor em <var>x</var> da função distribuição de probabilidade de uma
variável aleatória <em>Gumbel(a,b)</em>, com <em>b&gt;0</em>. Para fazer uso dessa
função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fquantile_005fgumbel"></a><dl>
<dt><a name="index-quantile_005fgumbel"></a>Função: <strong>quantile_gumbel</strong> <em>(<var>q</var>,<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o <var>q</var>-quantil de uma variável aleatória <em>Gumbel(a,b)</em>, com
<em>b&gt;0</em>; em outras palavras, essa função é a inversa da função
<code>cdf_gumbel</code>. O argumento <var>q</var> deve ser um elemento de <em>[0,1]</em>. Para
fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fmean_005fgumbel"></a><dl>
<dt><a name="index-mean_005fgumbel"></a>Função: <strong>mean_gumbel</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a média de uma variável aleatória <em>Gumbel(a,b)</em>, com <em>b&gt;0</em>.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) assume(b&gt;0)$  mean_gumbel(a,b);
(%o3)                     %gamma b + a
</pre></div>
<p>onde o símbolol <code>%gamma</code> representa a constante de Euler-Mascheroni.
Veja também <code>%gamma</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fvar_005fgumbel"></a><dl>
<dt><a name="index-var_005fgumbel"></a>Função: <strong>var_gumbel</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna a variância de uma variável aleatória <em>Gumbel(a,b)</em>,
com <em>b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fstd_005fgumbel"></a><dl>
<dt><a name="index-std_005fgumbel"></a>Função: <strong>std_gumbel</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o desvio padrão de uma variável aleatória <em>Gumbel(a,b)</em>,
com <em>b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fskewness_005fgumbel"></a><dl>
<dt><a name="index-skewness_005fgumbel"></a>Função: <strong>skewness_gumbel</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de assimetria de uma variável aleatória <em>Gumbel(a,b)</em>, com <em>b&gt;0</em>.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;distrib&quot;)$
(%i2) assume(b&gt;0)$ skewness_gumbel(a,b);
                       12 sqrt(6) zeta(3)
(%o3)                  ------------------
                                 3
                              %pi
(%i4) numer:true$ skewness_gumbel(a,b);
(%o5)                   1.139547099404649
</pre></div>
<p>onde <code>zeta</code> representa a função zeta de Riemann.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002fkurtosis_005fgumbel"></a><dl>
<dt><a name="index-kurtosis_005fgumbel"></a>Função: <strong>kurtosis_gumbel</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dd><p>Retorna o coeficiente de curtose de uma variável aleatória <em>Gumbel(a,b)</em>,
com <em>b&gt;0</em>. Para fazer uso dessa função, escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fdeffn_002frandom_005fgumbel"></a><dl>
<dt><a name="index-random_005fgumbel"></a>Função: <strong>random_gumbel</strong> <em>(<var>a</var>,<var>b</var>)</em></dt>
<dt><a name="index-random_005fgumbel-1"></a>Função: <strong>random_gumbel</strong> <em>(<var>a</var>,<var>b</var>,<var>n</var>)</em></dt>
<dd><p>Retorna uma variável estatística pseudo-aleatória <em>Gumbel(a,b)</em>,
com <em>b&gt;0</em>. Chamando <code>random_gumbel</code> com um terceiro argumento <var>n</var>,
uma amostra aleatória de tamanho <var>n</var> será simulada.
</p>
<p>Somente o método inverso genérico está implementado. Para fazer uso dessa função,
escreva primeiramente <code>load(&quot;distrib&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-distrib_002fnode_002fDefini_00e7_00f5es-para-distribui_00e7_00f5es-discretas"></a><hr>
<div class="header">
<p>
Pr&oacute;ximo: <a href="maxima_148.html#Defini_00e7_00f5es-para-distribui_00e7_00f5es-discretas" accesskey="n" rel="next">Definições para distribuições discretas</a>, Previous: <a href="maxima_146.html#Introdu_00e7_00e3o-a-distrib" accesskey="p" rel="previous">Introdução a distrib</a>, Acima: <a href="maxima_145.html#distrib" accesskey="u" rel="up">distrib</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Sum&aacute;rio" rel="contents">Conte&uacute;do</a>][<a href="maxima_218.html#g_t_00cdndice-de-Fun_00e7_00f5es-e-Vari_00e1veis" title="&Iacute;ndice" rel="index">&Iacute;ndice</a>]</p>
</div>



</body>
</html>
