<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 5.1, http://www.gnu.org/software/texinfo/ -->
<head>
<title>Manual de Maxima 5.46.0: Funciones y variables para las series</title>

<meta name="description" content="Manual de Maxima 5.46.0: Funciones y variables para las series">
<meta name="keywords" content="Manual de Maxima 5.46.0: Funciones y variables para las series">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="maxima_toc.html#Top" rel="start" title="Top">
<link href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" rel="index" title="Índice de Funciones y Variables">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="&Iacute;ndice General">
<link href="maxima_130.html#Sumas-productos-y-series" rel="up" title="Sumas productos y series">
<link href="maxima_134.html#Introducci_00f3n-a-las-series-de-Fourier" rel="next" title="Introducción a las series de Fourier">
<link href="maxima_132.html#Introducci_00f3n-a-las-series" rel="previous" title="Introducción a las series">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
blockquote.smallquotation {font-size: smaller}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
div.indentedblock {margin-left: 3.2em}
div.lisp {margin-left: 3.2em}
div.smalldisplay {margin-left: 3.2em}
div.smallexample {margin-left: 3.2em}
div.smallindentedblock {margin-left: 3.2em; font-size: smaller}
div.smalllisp {margin-left: 3.2em}
kbd {font-style:oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: inherit; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: inherit; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.nocodebreak {white-space:nowrap}
span.nolinebreak {white-space:nowrap}
span.roman {font-family:serif; font-weight:normal}
span.sansserif {font-family:sans-serif; font-weight:normal}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="../figures/favicon.ico">

</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">
<a name="Funciones-y-variables-para-las-series"></a>
<div class="header">
<p>
Siguiente: <a href="maxima_134.html#Introducci_00f3n-a-las-series-de-Fourier" accesskey="n" rel="next">Introducción a las series de Fourier</a>, Previous: <a href="maxima_132.html#Introducci_00f3n-a-las-series" accesskey="p" rel="previous">Introducción a las series</a>, Subir: <a href="maxima_130.html#Sumas-productos-y-series" accesskey="u" rel="up">Sumas productos y series</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="&Iacute;ndice general" rel="contents">&Iacute;ndice general</a>][<a href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" title="&Iacute;ndice" rel="index">&Iacute;ndice</a>]</p>
</div>
<a name="Funciones-y-variables-para-las-series-1"></a>
<h3 class="section">28.3 Funciones y variables para las series</h3>

<a name="Item_003a-Series_002ees_002fdefvr_002fcauchysum"></a><dl>
<dt><a name="index-cauchysum"></a>Variable opcional: <strong>cauchysum</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando se multiplican sumatorios infinitos, si <code>sumexpand</code> vale <code>true</code> y <code>cauchysum</code> vale <code>true</code>, entonces se utilizará el producto  de Cauchy en lugar del usual. En el producto de Cauchy  el índice de la suma interna es función del índice de la exterior en lugar de variar de forma independiente. Un ejemplo aclara esta idea:
</p>
<div class="example">
<pre class="example">(%i1) sumexpand: false$
(%i2) cauchysum: false$
(%i3) s: sum (f(i), i, 0, inf) * sum (g(j), j, 0, inf);
                      inf         inf
                      ====        ====
                      \           \
(%o3)                ( &gt;    f(i))  &gt;    g(j)
                      /           /
                      ====        ====
                      i = 0       j = 0
(%i4) sumexpand: true$
(%i5) cauchysum: true$
(%i6) ''s;
                 inf     i1
                 ====   ====
                 \      \
(%o6)             &gt;      &gt;     g(i1 - i2) f(i2)
                 /      /
                 ====   ====
                 i1 = 0 i2 = 0
</pre></div>

</dd></dl>



<a name="Item_003a-Series_002ees_002fdeffn_002fdeftaylor"></a><dl>
<dt><a name="index-deftaylor"></a>Función: <strong>deftaylor</strong> <em>(<var>f_1</var>(<var>x_1</var>), <var>expr_1</var>, ..., <var>f_n</var>(<var>x_n</var>), <var>expr_n</var>)</em></dt>
<dd><p>Para cada función <var>f_i</var> de variable <var>x_i</var>,  <code>deftaylor</code> define <var>expr_i</var> como una serie de Taylor alrededor de cero. La expresión <var>expr_i</var> será un polinomio en  <var>x_i</var> o una suma; <code>deftaylor</code> admite también expresiones más generales.
</p>
<p>La llamada <code>powerseries (<var>f_i</var>(<var>x_i</var>), <var>x_i</var>, 0)</code> devuelve la serie definida por  <code>deftaylor</code>.
</p>
<p>La función <code>deftaylor</code> evalúa sus argumentos y devuelve la lista de las funciones <var>f_1</var>, ..., <var>f_n</var>. 
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) deftaylor (f(x), x^2 + sum(x^i/(2^i*i!^2), i, 4, inf));
(%o1)                          [f]
(%i2) powerseries (f(x), x, 0);
                      inf
                      ====      i1
                      \        x         2
(%o2)                  &gt;     -------- + x
                      /       i1    2
                      ====   2   i1!
                      i1 = 4
(%i3) taylor (exp (sqrt (f(x))), x, 0, 4);
                      2         3          4
                     x    3073 x    12817 x
(%o3)/T/     1 + x + -- + ------- + -------- + . . .
                     2     18432     307200
</pre></div>

</dd></dl>



<a name="Item_003a-Series_002ees_002fdefvr_002fmaxtayorder"></a><dl>
<dt><a name="index-maxtayorder"></a>Variable opcional: <strong>maxtayorder</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Si <code>maxtayorder</code> vale <code>true</code>, entonces durante la manipulación algebraica de series truncadas de Taylor, la función <code>taylor</code> trata de retener tantos términos correctos como sea posible.
</p>
</dd></dl>




<a name="Item_003a-Series_002ees_002fdeffn_002fniceindices"></a><dl>
<dt><a name="index-niceindices"></a>Función: <strong>niceindices</strong> <em>(<var>expr</var>)</em></dt>
<dd><p>Cambia las etiquetas de los índices de sumas y productos de <var>expr</var>. La función <code>niceindices</code> trata de cambiar cada índice al valor de <code>niceindicespref[1]</code>, a menos que esa etiqueta aparezca ya en el sumando o factor, en cuyo caso  <code>niceindices</code> realiza intentos con los siguientes elementos de  <code>niceindicespref</code>, hasta que encuentre una variable que que no esté en uso. Si todas las variables de la lista han sido ya revisadas, se formarán nuevos ínices añadiendo números enteros al valor de <code>niceindicespref[1]</code>, como <code>i0</code>, <code>i1</code>, <code>i2</code>, ....
</p>
<p>La función <code>niceindices</code> evalúa sus argumentos y devuelve una expresión.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) niceindicespref;
(%o1)                  [i, j, k, l, m, n]
(%i2) product (sum (f (foo + i*j*bar), foo, 1, inf), bar, 1, inf);
                 inf    inf
                /===\   ====
                 ! !    \
(%o2)            ! !     &gt;      f(bar i j + foo)
                 ! !    /
                bar = 1 ====
                        foo = 1
(%i3) niceindices (%);
                     inf  inf
                    /===\ ====
                     ! !  \
(%o3)                ! !   &gt;    f(i j l + k)
                     ! !  /
                    l = 1 ====
                          k = 1
</pre></div>

</dd></dl>




<a name="Item_003a-Series_002ees_002fdefvr_002fniceindicespref"></a><dl>
<dt><a name="index-niceindicespref"></a>Variable opcional: <strong>niceindicespref</strong></dt>
<dd><p>Valor por defecto: <code>[i, j, k, l, m, n]</code>
</p>
<p>La variable <code>niceindicespref</code> es la lista de la que la función <code>niceindices</code> va tomando nombres de etiquetas para índices de sumatorios y productos.
</p>
<p>En <code>niceindicespref</code> se guardan normalmente nombres de variables.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) niceindicespref: [p, q, r, s, t, u]$
(%i2) product (sum (f (foo + i*j*bar), foo, 1, inf), bar, 1, inf);
                 inf    inf
                /===\   ====
                 ! !    \
(%o2)            ! !     &gt;      f(bar i j + foo)
                 ! !    /
                bar = 1 ====
                        foo = 1
(%i3) niceindices (%);
                     inf  inf
                    /===\ ====
                     ! !  \
(%o3)                ! !   &gt;    f(i j q + p)
                     ! !  /
                    q = 1 ====
                          p = 1
</pre></div>

</dd></dl>




<a name="Item_003a-Series_002ees_002fdeffn_002fnusum"></a><dl>
<dt><a name="index-nusum"></a>Función: <strong>nusum</strong> <em>(<var>expr</var>, <var>x</var>, <var>i_0</var>, <var>i_1</var>)</em></dt>
<dd><p>Calcula la suma hipergeométrica indefinida de  <var>expr</var> con respecto a la variable  <var>x</var> utilizando una procedimiento de decisión debido a R.W. Gosper. La expresión <var>expr</var> y el resultado deben poder ser escritos como productos de potencias enteras, factoriales, coeficientes binomiales y funciones racionales.
</p>
<p>Los términos suma &quot;definida&quot; e &quot;indefinida&quot; se usan de forma análoga a integración &quot;definida&quot; e &quot;indefinida&quot;. La suma indefinida significa dar un resultado simbólico.
</p>
<p>Las funciones <code>nusum</code> y <code>unsum</code> disponen de cierta información sobre sumas y diferencias de productos finitos. Véase también <code>unsum</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) nusum (n*n!, n, 0, n);

Dependent equations eliminated:  (1)
(%o1)                     (n + 1)! - 1
(%i2) nusum (n^4*4^n/binomial(2*n,n), n, 0, n);
                     4        3       2              n
      2 (n + 1) (63 n  + 112 n  + 18 n  - 22 n + 3) 4      2
(%o2) ------------------------------------------------ - ------
                    693 binomial(2 n, n)                 3 11 7
(%i3) unsum (%, n);
                              4  n
                             n  4
(%o3)                   ----------------
                        binomial(2 n, n)
(%i4) unsum (prod (i^2, i, 1, n), n);
                    n - 1
                    /===\
                     ! !   2
(%o4)              ( ! !  i ) (n - 1) (n + 1)
                     ! !
                    i = 1
(%i5) nusum (%, n, 1, n);

Dependent equations eliminated:  (2 3)
                            n
                          /===\
                           ! !   2
(%o5)                      ! !  i  - 1
                           ! !
                          i = 1
</pre></div>

</dd></dl>





<a name="Item_003a-Series_002ees_002fdeffn_002fpade"></a><dl>
<dt><a name="index-pade"></a>Función: <strong>pade</strong> <em>(<var>taylor_series</var>, <var>numer_deg_bound</var>, <var>denom_deg_bound</var>)</em></dt>
<dd><p>Devuelve la lista de todas las funciones racionales que tienen el desarrollo de Taylor dado, en las que la suma de los grados del numerador y denominador es menor o igual que el nivel de truncamiento de la serie de potencias.
</p>
<p>La expresión <var>taylor_series</var> es una serie de Taylor univariante. Los argumentos <var>numer_deg_bound</var> y <var>denom_deg_bound</var> son enteros positivos que indican las cotas para numerador y denominador.
</p>
<p>La expresión <var>taylor_series</var> también puede ser una serie de Laurent, y las cotas de los grados pueden ser <code>inf</code>. El grado total se define como <code><var>numer_deg_bound</var> + <var>denom_deg_bound</var></code>. La longitud de una serie de potencias se define como <code>&quot;truncation level&quot; + 1 - min(0, &quot;order of series&quot;)</code>.
</p>
<div class="example">
<pre class="example">(%i1) taylor (1 + x + x^2 + x^3, x, 0, 3);
                              2    3
(%o1)/T/             1 + x + x  + x  + . . .
(%i2) pade (%, 1, 1);
                                 1
(%o2)                       [- -----]
                               x - 1
(%i3) t: taylor(-(83787*x^10 - 45552*x^9 - 187296*x^8
                   + 387072*x^7 + 86016*x^6 - 1507328*x^5
                   + 1966080*x^4 + 4194304*x^3 - 25165824*x^2
                   + 67108864*x - 134217728)
       /134217728, x, 0, 10);
                    2    3       4       5       6        7
             x   3 x    x    15 x    23 x    21 x    189 x
(%o3)/T/ 1 - - + ---- - -- - ----- + ----- - ----- - ------
             2    16    32   1024    2048    32768   65536

                                  8         9          10
                            5853 x    2847 x    83787 x
                          + ------- + ------- - --------- + . . .
                            4194304   8388608   134217728
(%i4) pade (t, 4, 4);
(%o4)                          []
</pre></div>

<p>No hay ninguna función racional de grado 4 en numerador y denominador con este desarrollo en serie de potencias. Es necesario dar un número de grados al numerador y denominador cuya suma sea al menos el grado del desarrollo de la serie, a fin de disponer de un número suficiente de coeficientes desconocidos para calcular.
</p>
<div class="example">
<pre class="example">(%i5) pade (t, 5, 5);
                     5                4                 3
(%o5) [- (520256329 x  - 96719020632 x  - 489651410240 x

                  2
 - 1619100813312 x  - 2176885157888 x - 2386516803584)

               5                 4                  3
/(47041365435 x  + 381702613848 x  + 1360678489152 x

                  2
 + 2856700692480 x  + 3370143559680 x + 2386516803584)]
</pre></div>

</dd></dl>




<a name="Item_003a-Series_002ees_002fdeffn_002fpowerseries"></a><dl>
<dt><a name="index-powerseries"></a>Función: <strong>powerseries</strong> <em>(<var>expr</var>, <var>x</var>, <var>a</var>)</em></dt>
<dd><p>Devuelve la forma general del desarrollo en serie de potencias 
de <var>expr</var> para la variable <var>x</var> alrededor del punto 
<var>a</var> (que puede ser <code>inf</code>, de infinito):
</p><div class="example">
<pre class="example">           inf
           ====
           \               n
            &gt;    b  (x - a)
           /      n
           ====
           n = 0
</pre></div>

<p>Si <code>powerseries</code> no es capaz de desarrollar <var>expr</var>,
la función <code>taylor</code> puede calcular los primeros términos de la serie.
</p>
<p>Si <code>verbose</code> vale <code>true</code>, <code>powerseries</code> va 
mostrando mensajes mientras progresa el cálculo. 
</p>
<div class="example">
<pre class="example">(%i1) verbose: true$
(%i2) powerseries (log(sin(x)/x), x, 0);
can't expand 
                                 log(sin(x))
so we'll try again after applying the rule:
                                        d
                                      / -- (sin(x))
                                      [ dx
                        log(sin(x)) = i ----------- dx
                                      ]   sin(x)
                                      /
in the first simplification we have returned:
                             /
                             [
                             i cot(x) dx - log(x)
                             ]
                             /
                    inf
                    ====        i1  2 i1             2 i1
                    \      (- 1)   2     bern(2 i1) x
                     &gt;     ------------------------------
                    /                i1 (2 i1)!
                    ====
                    i1 = 1
(%o2)                -------------------------------------
                                      2
</pre></div>

</dd></dl>





<a name="Item_003a-Series_002ees_002fdefvr_002fpsexpand"></a><dl>
<dt><a name="index-psexpand"></a>Variable opcional: <strong>psexpand</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>psexpand</code> vale <code>true</code>, toda expresi&rsquo;on racional se muestra completamente expandida. La variable <code>ratexpand</code> tiene el mismo efecto.
</p>
<p>Si <code>psexpand</code> vale <code>false</code>, las expresines multivariantes se presentan tal como lo hace el paquete de funciones racionales.
</p>
<p>Si <code>psexpand</code> vale  <code>multi</code>, los términos de igual grado son agrupados.
</p>
</dd></dl>





<a name="Item_003a-Series_002ees_002fdeffn_002frevert"></a><dl>
<dt><a name="index-revert"></a>Función: <strong>revert</strong> <em>(<var>expr</var>, <var>x</var>)</em></dt>
<dd><a name="Item_003a-Series_002ees_002fdeffn_002frevert2"></a></dd><dt><a name="index-revert2"></a>Función: <strong>revert2</strong> <em>(<var>expr</var>, <var>x</var>, <var>n</var>)</em></dt>
<dd>
<p>Estas funciones devuelven el recíproco de <var>expr</var> en forma de desarrollo de Taylor alrededor de cero respecto de la variable <var>x</var>. La función <code>revert</code> devuelve un polinomio de grado igual a la mayor potencia en <var>expr</var>.
La función <code>revert2</code> devuelve un polinomio de grado <var>n</var>, el cual puede ser mayor, igual o menor que el grado de  <var>expr</var>.
</p>
<p>Para utilizar estas funciones es necesario cargarlas en memoria mediante <code>load (&quot;revert&quot;)</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;revert&quot;)$
(%i2) t: taylor (exp(x) - 1, x, 0, 6);
                   2    3    4    5     6
                  x    x    x    x     x
(%o2)/T/      x + -- + -- + -- + --- + --- + . . .
                  2    6    24   120   720
(%i3) revert (t, x);
               6       5       4       3       2
           10 x  - 12 x  + 15 x  - 20 x  + 30 x  - 60 x
(%o3)/R/ - --------------------------------------------
                                60
(%i4) ratexpand (%);
                     6    5    4    3    2
                    x    x    x    x    x
(%o4)             - -- + -- - -- + -- - -- + x
                    6    5    4    3    2
(%i5) taylor (log(x+1), x, 0, 6);
                    2    3    4    5    6
                   x    x    x    x    x
(%o5)/T/       x - -- + -- - -- + -- - -- + . . .
                   2    3    4    5    6
(%i6) ratsimp (revert (t, x) - taylor (log(x+1), x, 0, 6));
(%o6)                           0
(%i7) revert2 (t, x, 4);
                          4    3    2
                         x    x    x
(%o7)                  - -- + -- - -- + x
                         4    3    2
</pre></div>

</dd></dl>






<a name="Item_003a-Series_002ees_002fdeffn_002ftaylor"></a><dl>
<dt><a name="index-taylor"></a>Función: <strong>taylor</strong> <em>(<var>expr</var>, <var>x</var>, <var>a</var>, <var>n</var>)</em></dt>
<dt><a name="index-taylor-1"></a>Función: <strong>taylor</strong> <em>(<var>expr</var>, [<var>x_1</var>, <var>x_2</var>, ...], <var>a</var>, <var>n</var>)</em></dt>
<dt><a name="index-taylor-2"></a>Función: <strong>taylor</strong> <em>(<var>expr</var>, [<var>x</var>, <var>a</var>, <var>n</var>, 'asymp])</em></dt>
<dt><a name="index-taylor-3"></a>Función: <strong>taylor</strong> <em>(<var>expr</var>, [<var>x_1</var>, <var>x_2</var>, ...], [<var>a_1</var>, <var>a_2</var>, ...], [<var>n_1</var>, <var>n_2</var>, ...])</em></dt>
<dt><a name="index-taylor-4"></a>Función: <strong>taylor</strong> <em>(<var>expr</var>, [<var>x_1</var>, <var>a_1</var>, <var>n_1</var>], [<var>x_2</var>, <var>a_2</var>, <var>n_2</var>], ...)</em></dt>
<dd>
<p>La llamada <code>taylor (<var>expr</var>, <var>x</var>, <var>a</var>, <var>n</var>)</code> expande la expresión <var>expr</var> en un desarrollo  de 
 Taylor o de  Laurent respecto de la variable <var>x</var> alrededor del punto <var>a</var>, con términos hasta <code>(<var>x</var> - <var>a</var>)^<var>n</var></code>.
</p>
<p>Si <var>expr</var> es de la forma <code><var>f</var>(<var>x</var>)/<var>g</var>(<var>x</var>)</code> y <code><var>g</var>(<var>x</var>)</code> no tiene términos hasta de grado <var>n</var>, entonces <code>taylor</code> intenta expandir <code><var>g</var>(<var>x</var>)</code> hasta el grado  <code>2 <var>n</var></code>. Si aún así no hay términos no nulos, <code>taylor</code> dobla el grado de la expansión de <code><var>g</var>(<var>x</var>)</code> hasta que el grado de la expansión sea menor o igual que <code><var>n</var> 2^taylordepth</code>.
</p>
<p>La llamada <code>taylor (<var>expr</var>, [<var>x_1</var>, <var>x_2</var>, ...], <var>a</var>, <var>n</var>)</code> devuelve la serie en potencias truncada de grado  <var>n</var> en todas las variables <var>x_1</var>, <var>x_2</var>, ... alrededor del punto <code>(<var>a</var>, <var>a</var>, ...)</code>.
</p>
<p>La llamada <code>taylor (<var>expr</var>, [<var>x_1</var>, <var>a_1</var>, <var>n_1</var>], [<var>x_2</var>, <var>a_2</var>, <var>n_2</var>], ...)</code>
devuelve la serie en potencias truncada en las variables <var>x_1</var>, <var>x_2</var>, ... alrededor del punto <code>(<var>a_1</var>, <var>a_2</var>, ...)</code>; el truncamiento se realiza, respectivamente, en los grados <var>n_1</var>, <var>n_2</var>, ....
</p>
<p>La llamada <code>taylor (<var>expr</var>, [<var>x_1</var>, <var>x_2</var>, ...], [<var>a_1</var>, <var>a_2</var>, ...], [<var>n_1</var>, <var>n_2</var>, ...])</code>
devuelve la serie en potencias truncada en las variables <var>x_1</var>, <var>x_2</var>, ... alrededor del punto <code>(<var>a_1</var>, <var>a_2</var>, ...)</code>, el truncamiento se realiza, respectivamente, en los grados <var>n_1</var>, <var>n_2</var>, ....
</p>
<p>La llamada <code>taylor (<var>expr</var>, [<var>x</var>, <var>a</var>, <var>n</var>, 'asymp])</code> devuelve el desarrollo de  <var>expr</var> en potencias negativas de <code><var>x</var> - <var>a</var></code>. El término de mayor orden es <code>(<var>x</var> - <var>a</var>)^<var>-n</var></code>.
</p>
<p>Si <code>maxtayorder</code> vale <code>true</code>, entonces durante la manipulación algebraica de las series (truncadas) de Taylor, la función <code>taylor</code> intenta mantener tantos términos correctos como sea posible.
</p>
<p>Si <code>psexpand</code> vale <code>true</code>, una expresión racional desarrollada se muestra completamente expandida. La variable  <code>ratexpand</code> tiene el mismo efecto. Si <code>psexpand</code> vale <code>false</code>, una expresión multivariante se mostrará tal como lo hace el paquete de funciones racionales. Si  <code>psexpand</code> vale  <code>multi</code>, los términos del mismo grado 
son agrupados.
</p>
<p>Véase también la variable <code>taylor_logexpand</code> para el control del desarrollo.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) taylor (sqrt (sin(x) + a*x + 1), x, 0, 3);
                           2             2
             (a + 1) x   (a  + 2 a + 1) x
(%o1)/T/ 1 + --------- - -----------------
                 2               8

                                   3      2             3
                               (3 a  + 9 a  + 9 a - 1) x
                             + -------------------------- + . . .
                                           48
(%i2) %^2;
                                    3
                                   x
(%o2)/T/           1 + (a + 1) x - -- + . . .
                                   6
(%i3) taylor (sqrt (x + 1), x, 0, 5);
                       2    3      4      5
                  x   x    x    5 x    7 x
(%o3)/T/      1 + - - -- + -- - ---- + ---- + . . .
                  2   8    16   128    256
(%i4) %^2;
(%o4)/T/                  1 + x + . . .
(%i5) product ((1 + x^i)^2.5, i, 1, inf)/(1 + x^2);
                         inf
                        /===\
                         ! !    i     2.5
                         ! !  (x  + 1)
                         ! !
                        i = 1
(%o5)                   -----------------
                              2
                             x  + 1
(%i6) ev (taylor(%, x,  0, 3), keepfloat);
                               2           3
(%o6)/T/    1 + 2.5 x + 3.375 x  + 6.5625 x  + . . .
(%i7) taylor (1/log (x + 1), x, 0, 3);
                               2       3
                 1   1   x    x    19 x
(%o7)/T/         - + - - -- + -- - ----- + . . .
                 x   2   12   24    720
(%i8) taylor (cos(x) - sec(x), x, 0, 5);
                                4
                           2   x
(%o8)/T/                - x  - -- + . . .
                               6
(%i9) taylor ((cos(x) - sec(x))^3, x, 0, 5);
(%o9)/T/                    0 + . . .
(%i10) taylor (1/(cos(x) - sec(x))^3, x, 0, 5);
                                               2          4
            1     1       11      347    6767 x    15377 x
(%o10)/T/ - -- + ---- + ------ - ----- - ------- - --------
             6      4        2   15120   604800    7983360
            x    2 x    120 x

                                                          + . . .
(%i11) taylor (sqrt (1 - k^2*sin(x)^2), x, 0, 6);
               2  2       4      2   4
              k  x    (3 k  - 4 k ) x
(%o11)/T/ 1 - ----- - ----------------
                2            24

                                    6       4       2   6
                               (45 k  - 60 k  + 16 k ) x
                             - -------------------------- + . . .
                                          720
(%i12) taylor ((x + 1)^n, x, 0, 4);
                      2       2     3      2         3
                    (n  - n) x    (n  - 3 n  + 2 n) x
(%o12)/T/ 1 + n x + ----------- + --------------------
                         2                 6

                               4      3       2         4
                             (n  - 6 n  + 11 n  - 6 n) x
                           + ---------------------------- + . . .
                                          24
(%i13) taylor (sin (y + x), x, 0, 3, y, 0, 3);
               3                 2
              y                 y
(%o13)/T/ y - -- + . . . + (1 - -- + . . .) x
              6                 2

                    3                       2
               y   y            2      1   y            3
          + (- - + -- + . . .) x  + (- - + -- + . . .) x  + . . .
               2   12                  6   12
(%i14) taylor (sin (y + x), [x, y], 0, 3);
                     3        2      2      3
                    x  + 3 y x  + 3 y  x + y
(%o14)/T/   y + x - ------------------------- + . . .
                                6
(%i15) taylor (1/sin (y + x), x, 0, 3, y, 0, 3);
          1   y              1    1               1            2
(%o15)/T/ - + - + . . . + (- -- + - + . . .) x + (-- + . . .) x
          y   6               2   6                3
                             y                    y

                                           1            3
                                      + (- -- + . . .) x  + . . .
                                            4
                                           y
(%i16) taylor (1/sin (y + x), [x, y], 0, 3);
                             3         2       2        3
            1     x + y   7 x  + 21 y x  + 21 y  x + 7 y
(%o16)/T/ ----- + ----- + ------------------------------- + . . .
          x + y     6                   360
</pre></div>

</dd></dl>




<a name="Item_003a-Series_002ees_002fdefvr_002ftaylordepth"></a><dl>
<dt><a name="index-taylordepth"></a>Variable opcional: <strong>taylordepth</strong></dt>
<dd><p>Valor por defecto: 3
</p>
<p>Si todavía no hay términos no nulos, la función <code>taylor</code> dobla el grado del desarrollo de <code><var>g</var>(<var>x</var>)</code>
tantas veces como sea necesario para que el grado del desarrollo sea menor o igual que <code><var>n</var> 2^taylordepth</code>.
</p>
</dd></dl>




<a name="Item_003a-Series_002ees_002fdeffn_002ftaylorinfo"></a><dl>
<dt><a name="index-taylorinfo"></a>Función: <strong>taylorinfo</strong> <em>(<var>expr</var>)</em></dt>
<dd><p>Devuelve información sobre el desarrollo de Taylor <var>expr</var>. El valor devuelto por esta función es una lista de listas. Cada lista contiene el nombre de una variable, el punto de expansión y el grado del desarrollo.
</p>
<p>La función <code>taylorinfo</code> devuelve <code>false</code> si <var>expr</var> no es un desarrollo de Taylor.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) taylor ((1 - y^2)/(1 - x), x, 0, 3, [y, a, inf]);
                  2                       2
(%o1)/T/ - (y - a)  - 2 a (y - a) + (1 - a )

         2                        2
 + (1 - a  - 2 a (y - a) - (y - a) ) x

         2                        2   2
 + (1 - a  - 2 a (y - a) - (y - a) ) x

         2                        2   3
 + (1 - a  - 2 a (y - a) - (y - a) ) x  + . . .
(%i2) taylorinfo(%);
(%o2)               [[y, a, inf], [x, 0, 3]]
</pre></div>

</dd></dl>




<a name="Item_003a-Series_002ees_002fdeffn_002ftaylorp"></a><dl>
<dt><a name="index-taylorp"></a>Función: <strong>taylorp</strong> <em>(<var>expr</var>)</em></dt>
<dd><p>Devuelve <code>true</code> si <var>expr</var> es un desarrollo de Taylor y <code>false</code> en caso contrario.
</p>
</dd></dl>




<a name="Item_003a-Series_002ees_002fdefvr_002ftaylor_005flogexpand"></a><dl>
<dt><a name="index-taylor_005flogexpand"></a>Variable opcional: <strong>taylor_logexpand</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>La variable <code>taylor_logexpand</code> controla los desarrollos de logaritmos en la función <code>taylor</code>.
</p>
<p>Si <code>taylor_logexpand</code> vale <code>true</code>, todos los logaritmos se expanden completamente de manera que algunos problemas que se plantean debido a ciertas identidades logarítmicas no interfieran con el proceso del cálculo del desarrollo de Taylor. Sin embargo, este proceder no es del todo correcto.
</p>
</dd></dl>





<a name="Item_003a-Series_002ees_002fdefvr_002ftaylor_005forder_005fcoefficients"></a><dl>
<dt><a name="index-taylor_005forder_005fcoefficients"></a>Variable opcional: <strong>taylor_order_coefficients</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>La variable <code>taylor_order_coefficients</code> controla la ordenación de los coeficientes en un desarrollo de Taylor.
</p>
<p>Si <code>taylor_order_coefficients</code> vale <code>true</code>, los coeficientes del desarrollo de Taylor se ordenan de la forma canónica.
</p>
</dd></dl>





<a name="Item_003a-Series_002ees_002fdeffn_002ftaylor_005fsimplifier"></a><dl>
<dt><a name="index-taylor_005fsimplifier"></a>Función: <strong>taylor_simplifier</strong> <em>(<var>expr</var>)</em></dt>
<dd><p>Simplifica los coeficientes de la serie de potencias <var>expr</var>. Esta función es llamada desde la función <code>taylor</code>.
</p>
</dd></dl>




<a name="Item_003a-Series_002ees_002fdefvr_002ftaylor_005ftruncate_005fpolynomials"></a><dl>
<dt><a name="index-taylor_005ftruncate_005fpolynomials"></a>Variable opcional: <strong>taylor_truncate_polynomials</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Si <code>taylor_truncate_polynomials</code> vale <code>true</code>, los polinomios quedan truncados en base a los niveles de truncamiento de entrada.
</p>
<p>En otro caso, aquellos polinomios que se utilicen como entrada a la función  <code>taylor</code> se consideran que tienen precisión infinita.
</p>
</dd></dl>


<a name="Item_003a-Series_002ees_002fdeffn_002ftaytorat"></a><dl>
<dt><a name="index-taytorat"></a>Función: <strong>taytorat</strong> <em>(<var>expr</var>)</em></dt>
<dd><p>Convierte <var>expr</var> del formato de <code>taylor</code> al formato CRE (Canonical Rational Expression). El efecto es el mismo que haciendo  <code>rat (ratdisrep (<var>expr</var>))</code>, pero más rápido.
</p>
</dd></dl>



<a name="Item_003a-Series_002ees_002fdeffn_002ftrunc"></a><dl>
<dt><a name="index-trunc"></a>Función: <strong>trunc</strong> <em>(<var>expr</var>)</em></dt>
<dd><p>Devuelve la representación interna de la expresión <var>expr</var> de tal forma como si sus sumas fuesen una serie truncada de Taylor. La expresión <var>expr</var> no sufre ninguna otra modificación.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) expr: x^2 + x + 1;
                            2
(%o1)                      x  + x + 1
(%i2) trunc (expr);
                                2
(%o2)                  1 + x + x  + . . .
(%i3) is (expr = trunc (expr));
(%o3)                         true
</pre></div>

</dd></dl>




<a name="Item_003a-Series_002ees_002fdeffn_002funsum"></a><dl>
<dt><a name="index-unsum"></a>Función: <strong>unsum</strong> <em>(<var>f</var>, <var>n</var>)</em></dt>
<dd><p>Devuelve la diferencia <code><var>f</var>(<var>n</var>) - <var>f</var>(<var>n</var> - 1)</code>. En cierto sentido <code>unsum</code> es la inversa de <code>sum</code>.
</p>
<p>Véase también <code>nusum</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) g(p) := p*4^n/binomial(2*n,n);
                                     n
                                  p 4
(%o1)               g(p) := ----------------
                            binomial(2 n, n)
(%i2) g(n^4);
                              4  n
                             n  4
(%o2)                   ----------------
                        binomial(2 n, n)
(%i3) nusum (%, n, 0, n);
                     4        3       2              n
      2 (n + 1) (63 n  + 112 n  + 18 n  - 22 n + 3) 4      2
(%o3) ------------------------------------------------ - ------
                    693 binomial(2 n, n)                 3 11 7
(%i4) unsum (%, n);
                              4  n
                             n  4
(%o4)                   ----------------
                        binomial(2 n, n)
</pre></div>

</dd></dl>


<a name="Item_003a-Series_002ees_002fdefvr_002fverbose"></a><dl>
<dt><a name="index-verbose"></a>Variable opcional: <strong>verbose</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>verbose</code> vale <code>true</code>, la función <code>powerseries</code> va imprimiendo mensajes durante su ejecución.
</p>
</dd></dl>










<a name="Item_003a-Series_002ees_002fnode_002fIntroducci_00f3n-a-las-series-de-Fourier"></a><hr>
<div class="header">
<p>
Siguiente: <a href="maxima_134.html#Introducci_00f3n-a-las-series-de-Fourier" accesskey="n" rel="next">Introducción a las series de Fourier</a>, Previous: <a href="maxima_132.html#Introducci_00f3n-a-las-series" accesskey="p" rel="previous">Introducción a las series</a>, Subir: <a href="maxima_130.html#Sumas-productos-y-series" accesskey="u" rel="up">Sumas productos y series</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="&Iacute;ndice general" rel="contents">&Iacute;ndice general</a>][<a href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" title="&Iacute;ndice" rel="index">&Iacute;ndice</a>]</p>
</div>



</body>
</html>
