<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 5.1, http://www.gnu.org/software/texinfo/ -->
<head>
<title>Manual de Maxima 5.46.0: Funciones Gamma y factorial</title>

<meta name="description" content="Manual de Maxima 5.46.0: Funciones Gamma y factorial">
<meta name="keywords" content="Manual de Maxima 5.46.0: Funciones Gamma y factorial">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="maxima_toc.html#Top" rel="start" title="Top">
<link href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" rel="index" title="Índice de Funciones y Variables">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="&Iacute;ndice General">
<link href="maxima_78.html#Funciones-Especiales" rel="up" title="Funciones Especiales">
<link href="maxima_83.html#Integral-exponencial" rel="next" title="Integral exponencial">
<link href="maxima_81.html#Funciones-de-Airy" rel="previous" title="Funciones de Airy">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
blockquote.smallquotation {font-size: smaller}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
div.indentedblock {margin-left: 3.2em}
div.lisp {margin-left: 3.2em}
div.smalldisplay {margin-left: 3.2em}
div.smallexample {margin-left: 3.2em}
div.smallindentedblock {margin-left: 3.2em; font-size: smaller}
div.smalllisp {margin-left: 3.2em}
kbd {font-style:oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: inherit; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: inherit; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.nocodebreak {white-space:nowrap}
span.nolinebreak {white-space:nowrap}
span.roman {font-family:serif; font-weight:normal}
span.sansserif {font-family:sans-serif; font-weight:normal}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="figures/favicon.ico">

</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">
<a name="Funciones-Gamma-y-factorial"></a>
<div class="header">
<p>
Siguiente: <a href="maxima_83.html#Integral-exponencial" accesskey="n" rel="next">Integral exponencial</a>, Previous: <a href="maxima_81.html#Funciones-de-Airy" accesskey="p" rel="previous">Funciones de Airy</a>, Subir: <a href="maxima_78.html#Funciones-Especiales" accesskey="u" rel="up">Funciones Especiales</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="&Iacute;ndice general" rel="contents">&Iacute;ndice general</a>][<a href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" title="&Iacute;ndice" rel="index">&Iacute;ndice</a>]</p>
</div>
<a name="Funciones-Gamma-y-factorial-1"></a>
<h3 class="section">15.4 Funciones Gamma y factorial</h3>

<p>Las funciones gamma, beta, psi y gamma incompleta están
definidas en el capítulo 6 de Abramowitz y Stegun,
<i>Handbook of Mathematical Functions</i>.
</p>



<a name="Item_003a-Special_002ees_002fdeffn_002fbffac"></a><dl>
<dt><a name="index-bffac"></a>Función: <strong>bffac</strong> <em>(<var>expr</var>, <var>n</var>)</em></dt>
<dd><p>Versión para &quot;bigfloat&quot; de la función factorial (Gamma desplazada). El segundo argumento indica cuántos dígitos se conservan y devuelven, pudiendo utilizarse para obtener algunas cifras extra.
</p>
</dd></dl>

<a name="Item_003a-Special_002ees_002fdefvr_002falgepsilon"></a><dl>
<dt><a name="index-algepsilon"></a>Variable optativa: <strong>algepsilon</strong></dt>
<dd><p>Valor por defecto: 10^8
</p>
<p>El valor de <code>algepsilon</code> es usado por <code>algsys</code>.
</p>
</dd></dl>



<a name="Item_003a-Special_002ees_002fdeffn_002fbfpsi"></a><dl>
<dt><a name="index-bfpsi"></a>Función: <strong>bfpsi</strong> <em>(<var>n</var>, <var>z</var>, <var>fpprec</var>)</em></dt>
<dd><a name="Item_003a-Special_002ees_002fdeffn_002fbfpsi0"></a></dd><dt><a name="index-bfpsi0"></a>Función: <strong>bfpsi0</strong> <em>(<var>z</var>, <var>fpprec</var>)</em></dt>
<dd><p>La función <code>bfpsi</code> es la poligamma de argumento real <var>z</var> y de orden el entero <var>n</var>. La función <code>bfpsi0</code> es la digamma.  La llamada <code>bfpsi0 (<var>z</var>, <var>fpprec</var>)</code> equivale a <code>bfpsi (0, <var>z</var>, <var>fpprec</var>)</code>.
</p>
<p>Estas funciones devuelven valores &quot;bigfloat&quot;. La variable <var>fpprec</var> es la precisión &quot;bigfloat&quot; del valor de retorno.
</p>

</dd></dl>



<a name="Item_003a-Special_002ees_002fdeffn_002fcbffac"></a><dl>
<dt><a name="index-cbffac"></a>Función: <strong>cbffac</strong> <em>(<var>z</var>, <var>fpprec</var>)</em></dt>
<dd><p>Calcula el factorial de números complejos de punto flotante grandes.
</p>
<p>La instrucción <code>load (&quot;bffac&quot;)</code> carga esta función.
</p>
</dd></dl>



<a name="Item_003a-Special_002ees_002fdeffn_002fgamma"></a><dl>
<dt><a name="index-gamma"></a>Función: <strong>gamma</strong> <em>(<var>x</var>)</em></dt>
<dd>
<p>La definición básica de la función gamma (A&amp;S 6.1.1) es
</p>
<div class="example">
<pre class="example">                               inf
                              /
                              [     z - 1   - t
                   gamma(z) = I    t      %e    dt
                              ]
                              /
                               0
</pre></div>

<p>Maxima simplifica <code>gamma</code> para enteros positivos y para fracciones positivas
o negativas. Para fracciones de denominador dos, el resultado es un número 
racional multiplicado por <code>sqrt(%pi)</code>. La simplificación para valores
enteros la controla <code>factlim</code>. Para enteros mayores que <code>factlim</code>
el resultado numérico de la función factorial, la cual se utiliza para
calcular <code>gamma</code>, producirá un desbordamiento. La simplificación
para números racionales la controla <code>gammalim</code> para evitar desbordamientos.
Véanse también <code>factlim</code> y <code>gammalim</code>.
</p>
<p>Para enteros negativos, <code>gamma</code> no está definida.
</p>
<p>Maxima puede evaluar <code>gamma</code> numéricamente para valores reales
y complejos, tanto en formato float (doble precisión) como big float 
(precisión arbitraria).
</p>
<p>La función <code>gamma</code> tiene simetría especular.
</p>
<p>Si <code>gamma_expand</code> vale <code>true</code>, Maxima expande <code>gamma</code>
para argumentos del tipo <code>z+n</code> y <code>z-n</code>, siendo <code>n</code>
un entero.
</p>
<p>Maxima conoce la derivada de <code>gamma</code>.
</p>
<p>Ejemplos:
</p>
<p>Simplificación para enteros, fracciones de denominador dos
y números racionales:
</p>
<div class="example">
<pre class="example">(%i1) map('gamma,[1,2,3,4,5,6,7,8,9]);
(%o1)               [1, 1, 2, 6, 24, 120, 720, 5040, 40320]

(%i2) map('gamma,[1/2,3/2,5/2,7/2]);
                           sqrt(%pi)  3 sqrt(%pi)  15 sqrt(%pi)
(%o2)          [sqrt(%pi), ---------, -----------, ------------]
                               2           4            8

(%i3) map('gamma,[2/3,5/3,7/3]);
                                        2           1
                                2 gamma(-)  4 gamma(-)
                            2           3           3
(%o3)                [gamma(-), ----------, ----------]
                            3       3           9
</pre></div>

<p>Evaluación numérica para valores reales y complejos:
</p>
<div class="example">
<pre class="example">(%i4) map('gamma,[2.5,2.5b0]);
(%o4)             [1.329340388179137, 1.329340388179137b0]

(%i5) map('gamma,[1.0+%i,1.0b0+%i]);
(%o5) [.4980156681183558 - .1549498283018108 %i, 
                      4.980156681183561b-1 - 1.549498283018107b-1 %i]
</pre></div>

<p>Simetría especular:
</p>
<div class="example">
<pre class="example">(%i6) declare(z,complex)$
(%i7) conjugate(gamma(z));
(%o7)                         gamma(conjugate(z))
</pre></div>

<p>Maxima expande <code>gamma(z+n)</code> y <code>gamma(z-n)</code> si 
<code>gamma_expand</code> vale <code>true</code>:
</p>
<div class="example">
<pre class="example">(%i8) gamma_expand:true$
(%i9) [gamma(z+1),gamma(z-1),gamma(z+2)/gamma(z+1)];
                                      gamma(z)
(%o9)                    [z gamma(z), --------, z + 1]
                                       z - 1
</pre></div>

<p>Derivada de <code>gamma</code>:
</p>
<div class="example">
<pre class="example">(%i10) diff(gamma(z),z);
(%o10)                         psi (z) gamma(z)
                                  0
</pre></div>

<p>Véase también <code>makegamma</code>.
</p>
<p>La constante de Euler-Mascheroni es <code>%gamma</code>.
</p></dd></dl>


<a name="Item_003a-Special_002ees_002fdeffn_002flog_005fgamma"></a><dl>
<dt><a name="index-log_005fgamma"></a>Función: <strong>log_gamma</strong> <em>(<var>z</var>)</em></dt>
<dd><p>Logaritmo natural de la función gamma.
</p></dd></dl>



<a name="Item_003a-Special_002ees_002fdeffn_002fgamma_005fincomplete_005flower"></a><dl>
<dt><a name="index-gamma_005fincomplete_005flower"></a>Función: <strong>gamma_incomplete_lower</strong> <em>(<var>a</var>, <var>z</var>)</em></dt>
<dd>
<p>Función gamma incompleta inferior (A&amp;S 6.5.2):
</p>
<div class="example">
<pre class="example">                                    z
                                   /
                                   [  a - 1   - t
    gamma_incomplete_lower(a, z) = I t      %e    dt
                                   ]
                                   /
                                    0
</pre></div>

<p>Véase también <code>gamma_incomplete</code> (función gamma incompleta superior).
</p></dd></dl>



<a name="Item_003a-Special_002ees_002fdeffn_002fgamma_005fincomplete"></a><dl>
<dt><a name="index-gamma_005fincomplete"></a>Función: <strong>gamma_incomplete</strong> <em>(<var>a</var>,<var>z</var>)</em></dt>
<dd><p>Función gamma incompleta superior, A&amp;S 6.5.3:
</p>
<div class="example">
<pre class="example">                              inf
                             /
                             [     a - 1   - t
    gamma_incomplete(a, z) = I    t      %e    dt
                             ]
                             /
                              z
</pre></div>

<p>Véanse también <code>gamma_expand</code> para controlar cómo se expresa
<code>gamma_incomplete</code> en términos de funciones elementales y de <code>erfc</code>.
</p>
<p>Véanse también las funciones relacionadas <code>gamma_incomplete_regularized</code> y
<code>gamma_incomplete_generalized</code>.
</p></dd></dl>

<a name="Item_003a-Special_002ees_002fdeffn_002fgamma_005fincomplete_005fregularized"></a><dl>
<dt><a name="index-gamma_005fincomplete_005fregularized"></a>Función: <strong>gamma_incomplete_regularized</strong> <em>(<var>a</var>,<var>z</var>)</em></dt>
<dd><p>Función gamma incompleta superior regularizada, A&amp;S 6.5.1.
</p>
<div class="example">
<pre class="example">gamma_incomplete_regularized(a, z) = 
                                        gamma_incomplete(a, z)
                                        ----------------------
                                               gamma(a)
</pre></div>

<p>Véanse también <code>gamma_expand</code> para controlar cómo se expresa
<code>gamma_incomplete</code> en términos de funciones elementales y de <code>erfc</code>.
</p>
<p>Véase también <code>gamma_incomplete</code>.
</p></dd></dl>

<a name="Item_003a-Special_002ees_002fdeffn_002fgamma_005fincomplete_005fgeneralized"></a><dl>
<dt><a name="index-gamma_005fincomplete_005fgeneralized"></a>Función: <strong>gamma_incomplete_generalized</strong> <em>(<var>a</var>,<var>z1</var>,<var>z1</var>)</em></dt>
<dd><p>Función gamma incompleta generalizada.  
</p>
<div class="example">
<pre class="example">gamma_incomplete_generalized(a, z1, z2) = 
                                               z2
                                              /
                                              [    a - 1   - t
                                              I   t      %e    dt
                                              ]
                                              /
                                               z1
</pre></div>

<p>Véanse también <code>gamma_incomplete</code> y <code>gamma_incomplete_regularized</code>.
</p></dd></dl>


<a name="Item_003a-Special_002ees_002fdefvr_002fgamma_005fexpand"></a><dl>
<dt><a name="index-gamma_005fexpand"></a>Variable opcional: <strong>gamma_expand</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p><code>gamma_expand</code> controla la expansión de <code>gamma_incomplete</code>.
Si <code>gamma_expand</code> vale <code>true</code>, <code>gamma_incomplete(v,z)</code>
se expande en términos de
<code>z</code>, <code>exp(z)</code> y <code>erfc(z)</code>, siempre que sea posible.
</p>
<div class="example">
<pre class="example">(%i1) gamma_incomplete(2,z);
(%o1)                       gamma_incomplete(2, z)
(%i2) gamma_expand:true;
(%o2)                                true
(%i3) gamma_incomplete(2,z);
                                           - z
(%o3)                            (z + 1) %e
</pre><pre class="example">(%i4) gamma_incomplete(3/2,z);
                              - z   sqrt(%pi) erfc(sqrt(z))
(%o4)               sqrt(z) %e    + -----------------------
                                               2
</pre></div>
</dd></dl>



<a name="Item_003a-Special_002ees_002fdefvr_002fgammalim"></a><dl>
<dt><a name="index-gammalim"></a>Variable optativa: <strong>gammalim</strong></dt>
<dd><p>Valor por defecto: 10000
</p>
<p>La variable <code>gammalim</code> controla la simplificación de la función gamma con argumentos enteros o racionales. Si el valor absoluto del argumento no es mayor que <code>gammalim</code>, entonces se realizará la simplificación. Nótese que la variable <code>factlim</code> también controla la simplificación del resultado de <code>gamma</code> con argumento entero.
</p>
</dd></dl>

<a name="Item_003a-Special_002ees_002fdeffn_002fmakegamma"></a><dl>
<dt><a name="index-makegamma"></a>Función: <strong>makegamma</strong> <em>(<var>expr</var>)</em></dt>
<dd><p>Transforma las funciones <code>binomial</code>, <code>factorial</code> y <code>beta</code> que aparecen en <var>expr</var> en funciones <code>gamma</code>.
</p>
<p>Véase también <code>makefact</code>.
</p>
</dd></dl>


<a name="Item_003a-Special_002ees_002fdeffn_002fbeta"></a><dl>
<dt><a name="index-beta"></a>Función: <strong>beta</strong> <em>(<var>a</var>, <var>b</var>)</em></dt>
<dd><p>La función beta se define como <code>gamma(a) gamma(b)/gamma(a+b)</code>
(A&amp;S 6.2.1).
</p>
<p>Maxima simplifica la función beta para enteros positivos y números
racionales cuya suma sea entera. Si <code>beta_args_sum_to_integer</code>
vale <code>true</code>, Maxima también simplifica expresiones generales
cuya suma sea también entera.
</p>
<p>Cuando <var>a</var> o <var>b</var> sean nulos, la función beta no está definida.
</p>
<p>En general, la función beta no está definida para enteros negativos. 
La excepción es para <var>a=-n</var>, siendo <var>n</var> un entero positivo
y <var>b</var> otro entero positivo tal que <var>b&lt;=n</var>, entonces es posible
definir una continuación analítica. En este caso Maxima
devuelve un resultado.
</p>
<p>Si <code>beta_expand</code> vale <code>true</code>, expresiones como <code>beta(a+n,b)</code>,
<code>beta(a-n,b)</code>, <code>beta(a,b+n)</code> o <code>beta(a,b-n)</code>, siendo <code>n</code>
entero, se simplifican.
</p>
<p>Maxima puede evaluar la función beta para valores reales y complejos, tanto
de tipo decimal flotante o big float. Para la evaluación numérica
Maxima utiliza <code>log_gamma</code>:
</p>
<div class="example">
<pre class="example">           - log_gamma(b + a) + log_gamma(b) + log_gamma(a)
         %e
</pre></div>

<p>Maxima reconoce la simetría de la función beta.
</p>
<p>Maxima conoce las derivadas de la función beta, tanto respecto de <var>a</var>
como de <var>b</var>.
</p>
<p>Para expresar la función beta como un cociente de funciones gamma,
véase <code>makegamma</code>.
</p>
<p>Ejemplos:
</p>
<p>Simplificación cuando uno de sus argumentos es entero:
</p>
<div class="example">
<pre class="example">(%i1) [beta(2,3),beta(2,1/3),beta(2,a)];
                               1   9      1
(%o1)                         [--, -, ---------]
                               12  4  a (a + 1)
</pre></div>

<p>Simplificación para argumentos racionales que suman un entero:
</p>
<div class="example">
<pre class="example">(%i2) [beta(1/2,5/2),beta(1/3,2/3),beta(1/4,3/4)];
                          3 %pi   2 %pi
(%o2)                    [-----, -------, sqrt(2) %pi]
                            8    sqrt(3)
</pre></div>

<p>Cuando se iguala <code>beta_args_sum_to_integer</code> a <code>true</code> se
simplifican expresiones más generales si la suma de los argumentos
se reduce a un entero:
</p>
<div class="example">
<pre class="example">(%i3) beta_args_sum_to_integer:true$
(%i4) beta(a+1,-a+2);
                                %pi (a - 1) a
(%o4)                         ------------------
                              2 sin(%pi (2 - a))
</pre></div>

<p>Posibles valores cuando uno de los argumentos es entero negativo: 
</p>
<div class="example">
<pre class="example">(%i5) [beta(-3,1),beta(-3,2),beta(-3,3)];
                                    1  1    1
(%o5)                            [- -, -, - -]
                                    3  6    3
</pre></div>

<p><code>beta(a+n,b)</code> o <code>beta(a-n)</code> con <code>n</code> entero se simplifica
si <code>beta_expand</code> vale <code>true</code>:
</p>
<div class="example">
<pre class="example">(%i6) beta_expand:true$
(%i7) [beta(a+1,b),beta(a-1,b),beta(a+1,b)/beta(a,b+1)];
                    a beta(a, b)  beta(a, b) (b + a - 1)  a
(%o7)              [------------, ----------------------, -]
                       b + a              a - 1           b

</pre></div>

<p>La función beta no está definida si uno de sus argumentos es cero:
</p>
<div class="example">
<pre class="example">(%i7) beta(0,b);
beta: expected nonzero arguments; found 0, b
 -- an error.  To debug this try debugmode(true);
</pre></div>

<p>Evaluación numérica para argumentos reales y complejos de tipo
decimal flotante o big float:
</p>
<div class="example">
<pre class="example">(%i8) beta(2.5,2.3);
(%o8) .08694748611299981

(%i9) beta(2.5,1.4+%i);
(%o9) 0.0640144950796695 - .1502078053286415 %i

(%i10) beta(2.5b0,2.3b0);
(%o10) 8.694748611299969b-2

(%i11) beta(2.5b0,1.4b0+%i);
(%o11) 6.401449507966944b-2 - 1.502078053286415b-1 %i
</pre></div>

<p>La función beta es simétrica con simetría especular:
</p>
<div class="example">
<pre class="example">(%i14) beta(a,b)-beta(b,a);
(%o14)                                 0
(%i15) declare(a,complex,b,complex)$
(%i16) conjugate(beta(a,b));
(%o16)                 beta(conjugate(a), conjugate(b))
</pre></div>

<p>Derivada de la función beta respecto de <code>a</code>:
</p>
<div class="example">
<pre class="example">(%i17) diff(beta(a,b),a);
(%o17)               - beta(a, b) (psi (b + a) - psi (a))
                                      0             0
</pre></div>
</dd></dl>

<a name="Item_003a-Special_002ees_002fdeffn_002fbeta_005fincomplete"></a><dl>
<dt><a name="index-beta_005fincomplete"></a>Función: <strong>beta_incomplete</strong> <em>(<var>a</var>, <var>b</var>, <var>z</var>)</em></dt>
<dd><p>La definición básica de la función beta incompleta (A&amp;S 6.6.1) es
</p>
<div class="example">
<pre class="example">                       z
                      /
                      [         b - 1  a - 1
                      I  (1 - t)      t      dt
                      ]
                      /
                       0
</pre></div>

<p>Esta definición es posible para <em>realpart(a)&gt;0</em>, <em>realpart(b)&gt;0</em>
y <em>abs(z)&lt;1</em>. Para otras situaciones, la función beta incompleta puede
definirse por medio de una función hipergeométrica generalizada:
</p>
<div class="example">
<pre class="example">   gamma(a) hypergeometric_generalized([a, 1 - b], [a + 1], z) z
</pre></div>
<p>(Véase Funcións.wolfram.com para una completa definición de la función beta 
incompleta.)
</p>
<p>Para enteros negativos <em>a = -n</em> y enteros positivos <em>b=m</em> con 
<em>m&lt;=n</em> la función beta incompleta se define como
</p>
<div class="example">
<pre class="example">                            m - 1           k
                            ====  (1 - m)  z
                      n - 1 \            k
                     z       &gt;    -----------
                            /     k! (n - k)
                            ====
                            k = 0
</pre></div>
<p>Maxima utiliza esta definición para simplificar <code>beta_incomplete</code> 
cuando <var>a</var> es entero negativo.
</p>
<p>Cuando <var>a</var> es entero positivo, <code>beta_incomplete</code> se simplifica
para cualesquiera argumentos <var>b</var> y <var>z</var>, y para <var>b</var> entero
positivo para cualesquiera argumentos <var>a</var> y <var>z</var>, con la 
excepción de cuando <var>a</var> sea entero negativo.
</p>
<p>Para <em>z=0</em> y <em>realpart(a)&gt;0</em>, <code>beta_incomplete</code> se anula.
Para <var>z=1</var> y <em>realpart(b)&gt;0</em>, <code>beta_incomplete</code> se reduce a
la función <code>beta(a,b)</code>.
</p>
<p>Maxima evalúa <code>beta_incomplete</code> numéricamente para valores reales
y complejos en forma decimal y big float. La evaluación numérica se
realiza expandiendo la función beta incompleta en fracciones continuas.
</p>
<p>Si <code>beta_expand</code> vale <code>true</code>, Maxima expande las expresiones
<code>beta_incomplete(a+n,b,z)</code> y <code>beta_incomplete(a-n,b,z)</code>,
siendo <var>n</var> entero positivo.
</p>
<p>Maxima conoce las derivadas de <code>beta_incomplete</code> con respecto a
las variables <var>a</var>, <var>b</var> y <var>z</var>, así como la
integral respecto de la variable <var>z</var>.
</p>
<p>Ejemplos:
</p>
<p>Simplificación para <var>a</var> entero positivo:
</p>
<div class="example">
<pre class="example">(%i1) beta_incomplete(2,b,z);
                                       b
                            1 - (1 - z)  (b z + 1)
(%o1)                       ----------------------
                                  b (b + 1)
</pre></div>

<p>Simplificación para <var>b</var> entero positivo:
</p>
<div class="example">
<pre class="example">(%i2) beta_incomplete(a,2,z);
                                               a
                              (a (1 - z) + 1) z
(%o2)                         ------------------
                                  a (a + 1)
</pre></div>

<p>Simplificación para <var>a</var> y <var>b</var> enteros positivos:
</p>
<div class="example">
<pre class="example">(%i3) beta_incomplete(3,2,z);
                                               3
                              (3 (1 - z) + 1) z
(%o3)                         ------------------
                                      12
</pre></div>

<p>Para <var>a</var> entero negativo y <em>b&lt;=(-a)</em>:
</p>
<div class="example">
<pre class="example">(%i4) beta_incomplete(-3,1,z);
                                       1
(%o4)                              - ----
                                        3
                                     3 z
</pre></div>

<p>Simplificación para los valores <em>z=0</em> y <em>z=1</em>:
</p>
<div class="example">
<pre class="example">(%i5) assume(a&gt;0,b&gt;0)$
(%i6) beta_incomplete(a,b,0);
(%o6)                                 0
(%i7) beta_incomplete(a,b,1);
(%o7)                            beta(a, b)
</pre></div>

<p>Evaluación numérica, tanto con float (precisión doble)
como big float (precisión arbitraria):
</p>
<div class="example">
<pre class="example">(%i8) beta_incomplete(0.25,0.50,0.9);
(%o8)                          4.594959440269333
(%i9)  fpprec:25$
(%i10) beta_incomplete(0.25,0.50,0.9b0);
(%o10)                    4.594959440269324086971203b0
</pre></div>

<p>Para <em>abs(z)&gt;1</em>, <code>beta_incomplete</code> devuelve un
resultado complejo:
</p>
<div class="example">
<pre class="example">(%i11) beta_incomplete(0.25,0.50,1.7);
(%o11)              5.244115108584249 - 1.45518047787844 %i
</pre></div>

<p>Resultados para argumentos complejos más generales:
</p>
<div class="example">
<pre class="example">(%i14) beta_incomplete(0.25+%i,1.0+%i,1.7+%i);
(%o14)             2.726960675662536 - .3831175704269199 %i
(%i15) beta_incomplete(1/2,5/4*%i,2.8+%i);
(%o15)             13.04649635168716 %i - 5.802067956270001
(%i16) 
</pre></div>

<p>Expansión cuando <code>beta_expand</code> vale <code>true</code>:
</p>
<div class="example">
<pre class="example">(%i23) beta_incomplete(a+1,b,z),beta_expand:true;
                                                       b  a
                   a beta_incomplete(a, b, z)   (1 - z)  z
(%o23)             -------------------------- - -----------
                             b + a                 b + a

(%i24) beta_incomplete(a-1,b,z),beta_expand:true;
                                                           b  a - 1
           beta_incomplete(a, b, z) (- b - a + 1)   (1 - z)  z
(%o24)     -------------------------------------- - ---------------
                           1 - a                         1 - a
</pre></div>
 
<p>Derivada e integral de <code>beta_incomplete</code>:
</p>
<div class="example">
<div class="example">
<pre class="example">(%i34) diff(beta_incomplete(a, b, z), z);
                              b - 1  a - 1
(%o34)                 (1 - z)      z
(%i35) integrate(beta_incomplete(a, b, z), z);
              b  a
       (1 - z)  z
(%o35) ----------- + beta_incomplete(a, b, z) z
          b + a
                                       a beta_incomplete(a, b, z)
                                     - --------------------------
                                                 b + a
(%i36) factor(diff(%, z));
(%o36)              beta_incomplete(a, b, z)
</pre></div>
<pre class="example">
</pre></div>
</dd></dl>

<a name="Item_003a-Special_002ees_002fdeffn_002fbeta_005fincomplete_005fregularized"></a><dl>
<dt><a name="index-beta_005fincomplete_005fregularized"></a>Función: <strong>beta_incomplete_regularized</strong> <em>(<var>a</var>, <var>b</var>, <var>z</var>)</em></dt>
<dd><p>Función beta incompleta regularizada A&amp;S 6.6.2,
definida como
</p>
<div class="example">
<pre class="example">beta_incomplete_regularized(a, b, z) = 
                                      beta_incomplete(a, b, z)
                                      ------------------------
                                             beta(a, b)
</pre></div>

<p>Al igual que <code>beta_incomplete</code>, esta definición no es completa.
Véase Funcións.wolfram.com para una definición completa de 
<code>beta_incomplete_regularized</code>.
</p>
<p><code>beta_incomplete_regularized</code> se simplifica para <var>a</var> o <var>b</var> 
entero positivo.
</p>
<p>Para <em>z=0</em> y <em>realpart(a)&gt;0</em>, <code>beta_incomplete_regularized</code> se anula.
Para <var>z=1</var> y <em>realpart(b)&gt;0</em>, <code>beta_incomplete_regularized</code> se reduce a 1.
</p>
<p>Maxima evalúa <code>beta_incomplete_regularized</code> numéricamente para valores reales
y complejos en forma decimal y big float.
</p>
<p>Si <code>beta_expand</code> vale <code>true</code>, Maxima expande 
<code>beta_incomplete_regularized</code> para los argumentos <em>a+n</em> o <em>a-n</em>,
siendo <var>n</var> entero.
</p>
<p>Maxima conoce las derivadas de <code>beta_incomplete_regularized</code> con respecto a
las variables <var>a</var>, <var>b</var> y <var>z</var>, así como la
integral respecto de la variable <var>z</var>.
</p>
<p>Ejemplos:
</p>
<p>Simplificación para <var>a</var> o <var>b</var> enteros positivos:
</p>
<div class="example">
<pre class="example">(%i1) beta_incomplete_regularized(2,b,z);
                                       b
(%o1)                       1 - (1 - z)  (b z + 1)

(%i2) beta_incomplete_regularized(a,2,z);
                                               a
(%o2)                         (a (1 - z) + 1) z

(%i3) beta_incomplete_regularized(3,2,z);
                                               3
(%o3)                         (3 (1 - z) + 1) z
</pre></div>

<p>Simplificación para los valores <em>z=0</em> y <em>z=1</em>:
</p>
<div class="example">
<pre class="example">(%i4) assume(a&gt;0,b&gt;0)$
(%i5) beta_incomplete_regularized(a,b,0);
(%o5)                                 0
(%i6) beta_incomplete_regularized(a,b,1);
(%o6)                                 1
</pre></div>

<p>Evaluación numérica, tanto con float (precisión doble)
como big float (precisión arbitraria):
</p>
<div class="example">
<pre class="example">(%i7) beta_incomplete_regularized(0.12,0.43,0.9);
(%o7)                         .9114011367359802
(%i8) fpprec:32$
(%i9) beta_incomplete_regularized(0.12,0.43,0.9b0);
(%o9)               9.1140113673598075519946998779975b-1
(%i10) beta_incomplete_regularized(1+%i,3/3,1.5*%i);
(%o10)             .2865367499935403 %i - 0.122995963334684
(%i11) fpprec:20$
(%i12) beta_incomplete_regularized(1+%i,3/3,1.5b0*%i);
(%o12)      2.8653674999354036142b-1 %i - 1.2299596333468400163b-1
</pre></div>

<p>Expansión cuando <code>beta_expand</code> vale <code>true</code>:
</p>
<div class="example">
<pre class="example">(%i13) beta_incomplete_regularized(a+1,b,z);
                                                     b  a
                                              (1 - z)  z
(%o13) beta_incomplete_regularized(a, b, z) - ------------
                                              a beta(a, b)
(%i14) beta_incomplete_regularized(a-1,b,z);
(%o14) beta_incomplete_regularized(a, b, z)
                                                     b  a - 1
                                              (1 - z)  z
                                         - ----------------------
                                           beta(a, b) (b + a - 1)

</pre></div>

<p>Derivada e integral respecto de <var>z</var>:
</p>
<div class="example">
<pre class="example">(%i15) diff(beta_incomplete_regularized(a,b,z),z);
                              b - 1  a - 1
                       (1 - z)      z
(%o15)                 -------------------
                           beta(a, b)
(%i16) integrate(beta_incomplete_regularized(a,b,z),z);
(%o16) beta_incomplete_regularized(a, b, z) z
                                                           b  a
                                                    (1 - z)  z
          a (beta_incomplete_regularized(a, b, z) - ------------)
                                                    a beta(a, b)
        - -------------------------------------------------------
                                   b + a
</pre></div>

</dd></dl>

<a name="Item_003a-Special_002ees_002fdeffn_002fbeta_005fincomplete_005fgeneralized"></a><dl>
<dt><a name="index-beta_005fincomplete_005fgeneralized"></a>Función: <strong>beta_incomplete_generalized</strong> <em>(<var>a</var>, <var>b</var>, <var>z1</var>, <var>z2</var>)</em></dt>
<dd><p>La definición básica de la función beta incompleta generalizada es
</p>
<p>The basic definition of the generalized incomplete beta function is
</p>
<div class="example">
<pre class="example">                      z2
                     /
                     [          b - 1  a - 1
                     I   (1 - t)      t      dt
                     ]
                     /
                      z1
</pre></div>

<p>Maxima simplifica <code>beta_incomplete_regularized</code> para <var>a</var> y <var>b</var> 
enteros positivos.
</p>
<p>Para <em>realpart(a)&gt;0</em> y <em>z1=0</em> o <em>z2=0</em>, Maxima reduce
<code>beta_incomplete_generalized</code> a <code>beta_incomplete</code>. Para
<em>realpart(b)&gt;0</em> y <em>z1=1</em> o <var>z2=1</var>, Maxima reduce a
una expresión con <code>beta</code> y <code>beta_incomplete</code>.
</p>
<p>Maxima evalúa <code>beta_incomplete_generalized</code> numéricamente para valores reales
y complejos en forma decimal y big float.
</p>
<p>Si <code>beta_expand</code> vale <code>true</code>, Maxima expande 
<code>beta_incomplete_generalized</code> para los argumentos <em>a+n</em> y <em>a-n</em>,
siendo <var>n</var> entero positivo.
</p>
<p>Maxima conoce las derivadas de <code>beta_incomplete_generalized</code> con respecto a
las variables <var>a</var>, <var>b</var>, <var>z1</var> y <var>z2</var>, así como la
integral respecto de las variables <var>z1</var> y <var>z2</var>.
</p>
<p>Ejemplos:
</p>
<p>Maxima simplifica <code>beta_incomplete_generalized</code> para <var>a</var> y <var>b</var>
enteros positivos:
</p><div class="example">
<pre class="example">(%i1) beta_incomplete_generalized(2,b,z1,z2);
                          b                      b
                  (1 - z1)  (b z1 + 1) - (1 - z2)  (b z2 + 1)
(%o1)             -------------------------------------------
                                   b (b + 1)

(%i2) beta_incomplete_generalized(a,2,z1,z2);
                                     a                      a
                  (a (1 - z2) + 1) z2  - (a (1 - z1) + 1) z1
(%o2)             -------------------------------------------
                                   a (a + 1)

(%i3) beta_incomplete_generalized(3,2,z1,z2);
                  2      2                       2      2
          (1 - z1)  (3 z1  + 2 z1 + 1) - (1 - z2)  (3 z2  + 2 z2 + 1)
(%o3)     -----------------------------------------------------------
                                      12
</pre></div>

<p>Simplificación para los valores <em>z1=0</em>, <em>z2=0</em>, <em>z1=1</em>
o <em>z2=1</em>:
</p><div class="example">
<pre class="example">(%i4) assume(a &gt; 0, b &gt; 0)$
(%i5) beta_incomplete_generalized(a,b,z1,0);
(%o5)                    - beta_incomplete(a, b, z1)

(%i6) beta_incomplete_generalized(a,b,0,z2);
(%o6)                    - beta_incomplete(a, b, z2)

(%i7) beta_incomplete_generalized(a,b,z1,1);
(%o7)              beta(a, b) - beta_incomplete(a, b, z1)

(%i8) beta_incomplete_generalized(a,b,1,z2);
(%o8)              beta_incomplete(a, b, z2) - beta(a, b)
</pre></div>

<p>Evaluación numérica para argumentos reales, tanto con float
(precisión doble) como big float (precisión arbitraria):
</p><div class="example">
<pre class="example">(%i9) beta_incomplete_generalized(1/2,3/2,0.25,0.31);
(%o9)                        .09638178086368676

(%i10) fpprec:32$
(%i10) beta_incomplete_generalized(1/2,3/2,0.25,0.31b0);
(%o10)               9.6381780863686935309170054689964b-2
</pre></div>

<p>Evaluación numérica para argumentos complejos, tanto con float
(precisión doble) como big float (precisión arbitraria):
</p><div class="example">
<pre class="example">(%i11) beta_incomplete_generalized(1/2+%i,3/2+%i,0.25,0.31);
(%o11)           - .09625463003205376 %i - .003323847735353769
(%i12) fpprec:20$
(%i13) beta_incomplete_generalized(1/2+%i,3/2+%i,0.25,0.31b0);
(%o13)     - 9.6254630032054178691b-2 %i - 3.3238477353543591914b-3
</pre></div>

<p>Expansión para <em>a+n</em> o <em>a-n</em>, siendo <var>n</var> entero positivo
con <code>beta_expand</code> igual <code>true</code>:
</p><div class="example">
<pre class="example">(%i14) beta_expand:true$
(%i15) beta_incomplete_generalized(a+1,b,z1,z2);
               b   a           b   a
       (1 - z1)  z1  - (1 - z2)  z2
(%o15) -----------------------------
                   b + a
                            a beta_incomplete_generalized(a, b, z1, z2)
                          + -------------------------------------------
                                               b + a

(%i16) beta_incomplete_generalized(a-1,b,z1,z2);
       beta_incomplete_generalized(a, b, z1, z2) (- b - a + 1)
(%o16) -------------------------------------------------------
                                1 - a
                                          b   a - 1           b   a - 1
                                  (1 - z2)  z2      - (1 - z1)  z1
                                - -------------------------------------
                                                  1 - a
</pre></div>

<p>Derivada respecto de la variable <var>z1</var> e integrales respecto de 
<var>z1</var> y <var>z2</var>:
</p><div class="example">
<pre class="example">(%i17) diff(beta_incomplete_generalized(a,b,z1,z2),z1);
                                      b - 1   a - 1
(%o17)                      - (1 - z1)      z1

(%i18) integrate(beta_incomplete_generalized(a,b,z1,z2),z1);
(%o18) beta_incomplete_generalized(a, b, z1, z2) z1
                                        + beta_incomplete(a + 1, b, z1)

(%i19) integrate(beta_incomplete_generalized(a,b,z1,z2),z2);
(%o19) beta_incomplete_generalized(a, b, z1, z2) z2
                                        - beta_incomplete(a + 1, b, z2)
</pre></div>
</dd></dl>


<a name="Item_003a-Special_002ees_002fdefvr_002fbeta_005fexpand"></a><dl>
<dt><a name="index-beta_005fexpand"></a>Variable opcional: <strong>beta_expand</strong></dt>
<dd><p>Valor por defecto: false
</p>
<p>Si <code>beta_expand</code> vale <code>true</code>, <code>beta(a,b)</code> y sus
funciones relacionadas se expanden para argumentos del tipo 
<em>a+n</em> o <em>a-n</em>, siendo <em>n</em> un número entero.
</p></dd></dl>

<a name="Item_003a-Special_002ees_002fdefvr_002fbeta_005fargs_005fsum_005fto_005finteger"></a><dl>
<dt><a name="index-beta_005fargs_005fsum_005fto_005finteger"></a>Variable opcional: <strong>beta_args_sum_to_integer</strong></dt>
<dd><p>Valor por defecto: false
</p>
<p>Si <code>beta_args_sum_to_integer</code> vale <code>true</code>, Maxima simplifica 
<code>beta(a,b)</code> cuando la suma de los argumentos <var>a</var> y <var>b</var> sea un entero.
</p></dd></dl>



<a name="Item_003a-Special_002ees_002fdeffn_002fpsi"></a><dl>
<dt><a name="index-psi"></a>Función: <strong>psi</strong> <em>[<var>n</var>](<var>x</var>)</em></dt>
<dd>
<p>Es la derivada de <code>log (gamma (<var>x</var>))</code> de orden <code><var>n</var>+1</code>,
de tal manera que <code>psi[0](<var>x</var>)</code> es la primera derivada, 
<code>psi[1](<var>x</var>)</code> la segunda derivada y así 
sucesivamente.
</p>
<p>En general, Maxima no sabe cómo calcular valores numéricos de 
<code>psi</code>, pero sí conoce el valor exacto para
algunos argumentos racionales.
Existen algunas variables globales para controlar en qué rangos
racionales debe devolver <code>psi</code> resultados exactos, si ello es posible.
Véanse las descripciones de <code>maxpsiposint</code>, <code>maxpsinegint</code>,
<code>maxpsifracnum</code> y <code>maxpsifracdenom</code>.
En resumen, <var>x</var> debe alcanzar un valor entre <code>maxpsinegint</code> y
<code>maxpsiposint</code>. Si el valor absoluto de la parte fraccional de
<var>x</var> es racional y tiene un numerador menor que <code>maxpsifracnum</code>
y un denominador menor que <code>maxpsifracdenom</code>, la función <code>psi</code>
devolverá un valor exacto.
</p>
<p>La función <code>bfpsi</code> del paquete <code>bffac</code> puede calcular
valores numéricos.
</p>
</dd></dl>

<a name="Item_003a-Special_002ees_002fdefvr_002fmaxpsiposint"></a><dl>
<dt><a name="index-maxpsiposint"></a>Variable opcional: <strong>maxpsiposint</strong></dt>
<dd><p>Valor por defecto: 20
</p>
<p>La variable <code>maxpsiposint</code> guarda el mayor valor positivo para el 
que <code>psi[n](x)</code> intentará calcular un valor exacto.
</p>
</dd></dl>

<a name="Item_003a-Special_002ees_002fdefvr_002fmaxpsinegint"></a><dl>
<dt><a name="index-maxpsinegint"></a>Variable opcional: <strong>maxpsinegint</strong></dt>
<dd><p>Valor por defecto: -10
</p>
<p>La variable <code>maxpsinegint</code> guarda el menor valor negativo para el
que <code>psi[n](x)</code> intentará calcular un valor exacto. Si
<var>x</var> es menor que <code>maxnegint</code>, <code>psi[n](<var>x</var>)</code> no devolverá
una respuesta simplificada, aunque supiese cómo hacerlo.
</p>
</dd></dl>


<a name="Item_003a-Special_002ees_002fdefvr_002fmaxpsifracnum"></a><dl>
<dt><a name="index-maxpsifracnum"></a>Variable opcional: <strong>maxpsifracnum</strong></dt>
<dd><p>Valor por defecto: 6
</p>
<p>Sea <var>x</var> un número racional menor que la unidad de la forma <code>p/q</code>.
Si <code>p</code> es mayor que <code>maxpsifracnum</code>, entonces
<code>psi[<var>n</var>](<var>x</var>)</code> no devolverá una respuesta simplificada.
</p>
</dd></dl>

<a name="Item_003a-Special_002ees_002fdefvr_002fmaxpsifracdenom"></a><dl>
<dt><a name="index-maxpsifracdenom"></a>Variable opcional: <strong>maxpsifracdenom</strong></dt>
<dd><p>Valor por defecto: 6
</p>
<p>Sea <var>x</var> un número racional menor que la unidad de la forma <code>p/q</code>.
Si <code>q</code> es mayor que <code>maxpsifracnum</code>, entonces
<code>psi[<var>n</var>](<var>x</var>)</code> no devolverá una respuesta simplificada.
</p>
</dd></dl>


<a name="Item_003a-Special_002ees_002fdeffn_002fmakefact"></a><dl>
<dt><a name="index-makefact"></a>Función: <strong>makefact</strong> <em>(<var>expr</var>)</em></dt>
<dd><p>Transforma las funciones <code>binomial</code>, <code>gamma</code> y <code>beta</code> que aparecen en <var>expr</var> en su notación factorial.
</p>
<p>Véase también <code>makegamma</code>.
</p>
</dd></dl>


<a name="Item_003a-Special_002ees_002fdeffn_002fnumfactor"></a><dl>
<dt><a name="index-numfactor"></a>Función: <strong>numfactor</strong> <em>(<var>expr</var>)</em></dt>
<dd><p>Devuelve el factor numérico que multiplica a la expresión <var>expr</var>, la cual debe tener un único término. 
</p>
<div class="example">
<pre class="example">(%i1) gamma (7/2);
                          15 sqrt(%pi)
(%o1)                     ------------
                               8
(%i2) numfactor (%);
                               15
(%o2)                          --
                               8
</pre></div>

</dd></dl>







<a name="Item_003a-Special_002ees_002fnode_002fIntegral-exponencial"></a><hr>
<div class="header">
<p>
Siguiente: <a href="maxima_83.html#Integral-exponencial" accesskey="n" rel="next">Integral exponencial</a>, Previous: <a href="maxima_81.html#Funciones-de-Airy" accesskey="p" rel="previous">Funciones de Airy</a>, Subir: <a href="maxima_78.html#Funciones-Especiales" accesskey="u" rel="up">Funciones Especiales</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="&Iacute;ndice general" rel="contents">&Iacute;ndice general</a>][<a href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" title="&Iacute;ndice" rel="index">&Iacute;ndice</a>]</p>
</div>



</body>
</html>
