<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 6.8, https://www.gnu.org/software/texinfo/ -->
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Funciones y variables para los conjuntos (Manual de Maxima 5.47.0)</title>

<meta name="description" content="Funciones y variables para los conjuntos (Manual de Maxima 5.47.0)">
<meta name="keywords" content="Funciones y variables para los conjuntos (Manual de Maxima 5.47.0)">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta name="viewport" content="width=device-width,initial-scale=1">

<link href="maxima_toc.html" rel="start" title="Top">
<link href="maxima_304.html" rel="index" title="Índice de Funciones y Variables">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="Índice general">
<link href="maxima_154.html" rel="up" title="Conjuntos">
<link href="maxima_155.html" rel="prev" title="Introducción a los conjuntos">
<style type="text/css">
<!--
a.copiable-anchor {visibility: hidden; text-decoration: none; line-height: 0em}
a.summary-letter {text-decoration: none}
blockquote.indentedblock {margin-right: 0em}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
kbd {font-style: oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
span.nolinebreak {white-space: nowrap}
span.roman {font-family: initial; font-weight: normal}
span.sansserif {font-family: sans-serif; font-weight: normal}
span:hover a.copiable-anchor {visibility: visible}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="figures/favicon.ico">
<script src="https://polyfill.io/v3/polyfill.min.js?features=es6>"></script>
<script type='text/javascript'>
MathJax = {
  options: {
    skipHtmlTags: {'[-]': ['pre']},
    ignoreHtmlClass: 'tex2jax_ignore',
    processHtmlClass: 'tex2jax_process'
  },
};
</script><script type="text/javascript" id="MathJax-script" async
  src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-svg.js">
</script>
</head>

<body lang="es" class="tex2jax_ignore">
<div class="section" id="Funciones-y-variables-para-los-conjuntos">
<div class="header">
<p>
Anterior: <a href="maxima_155.html" accesskey="p" rel="prev">Introducción a los conjuntos</a>, Subir: <a href="maxima_154.html" accesskey="u" rel="up">Conjuntos</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Índice general" rel="contents">Índice general</a>][<a href="maxima_304.html" title="Índice" rel="index">Índice</a>]</p>
</div>
<span id="Funciones-y-variables-para-los-conjuntos-1"></span><h3 class="section">35.2 Funciones y variables para los conjuntos</h3>


<span id="Item_003a-nset_002ees_002fdeffn_002fadjoin"></span><dl class="def">
<dt id="index-adjoin"><span class="category">Función: </span><span><strong>adjoin</strong> <em>(<var>x</var>, <var>a</var>)</em><a href='#index-adjoin' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Calcula la unión del conjunto <var>a</var> y <code>{<var>x</var>}</code>.
</p>
<p>La función <code>adjoin</code> emite un mensaje de error si <var>a</var>
no es un conjunto literal.
</p>
<p>Las sentencias <code>adjoin(<var>x</var>, <var>a</var>)</code> y 
<code>union(set(<var>x</var>), <var>a</var>)</code> son equivalentes, aunque
<code>adjoin</code> puede ser algo más rápida que <code>union</code>.
</p>
<p>Véase también <code>disjoin</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) adjoin (c, {a, b});
(%o1)                       {a, b, c}
(%i2) adjoin (a, {a, b});
(%o2)                        {a, b}
</pre></div>

</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fbelln"></span><dl class="def">
<dt id="index-belln"><span class="category">Función: </span><span><strong>belln</strong> <em>(<var>n</var>)</em><a href='#index-belln' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Representa el <em class='tex2jax_process'>\(n\)</em>-ésimo número de Bell, de
modo que <code>belln(n)</code> es el número de particiones de un conjunto de 
<var>n</var> elementos.
</p>
<p>El argumento <var>n</var> debe ser un entero no negativo.
</p>
<p>La función <code>belln</code> se distribuye sobre ecuaciones, listas,
matrices y conjuntos.
</p>
<p>Ejemplos:
</p>
<p><code>belln</code> se aplica a enteros no negativos,
</p>
<div class="example">
<pre class="example">(%i1) makelist (belln (i), i, 0, 6);
(%o1)               [1, 1, 2, 5, 15, 52, 203]
(%i2) is (cardinality (set_partitions ({})) = belln (0));
(%o2)                         true
(%i3) is (cardinality (set_partitions ({1, 2, 3, 4, 5, 6}))
                            = belln (6));
(%o3)                         true
</pre></div>

<p>Si <var>n</var> no es un entero no negativo, la función <code>belln(n)</code> no hace cálculo alguno.
</p>
<div class="example">
<pre class="example">(%i1) [belln (x), belln (sqrt(3)), belln (-9)];
(%o1)        [belln(x), belln(sqrt(3)), belln(- 9)]
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fcardinality"></span><dl class="def">
<dt id="index-cardinality"><span class="category">Función: </span><span><strong>cardinality</strong> <em>(<var>a</var>)</em><a href='#index-cardinality' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve el número de elementos del conjunto <var>a</var>.
</p>
<p>La función <code>cardinality</code> ignora los elementos
redundantes, incluso cuando la simplificación está
desabilitada.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) cardinality ({});
(%o1)                           0
(%i2) cardinality ({a, a, b, c});
(%o2)                           3
(%i3) simp : false;
(%o3)                         false
(%i4) cardinality ({a, a, b, c});
(%o4)                           3
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fcartesian_005fproduct"></span><dl class="def">
<dt id="index-cartesian_005fproduct"><span class="category">Función: </span><span><strong>cartesian_product</strong> <em>(<var>b_1</var>, ... , <var>b_n</var>)</em><a href='#index-cartesian_005fproduct' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve un conjunto formado por listas de la forma <code>[<var>x_1</var>, ..., <var>x_n</var>]</code>,
siendo <var>x_1</var>, ..., <var>x_n</var> elementos de los conjuntos <var>b_1</var>, ... , <var>b_n</var>,
respectivamente.
</p>
<p>La función <code>cartesian_product</code> emite un mensaje de error si alguno
de sus argumentos no es un conjunto literal.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) cartesian_product ({0, 1});
(%o1)                      {[0], [1]}
(%i2) cartesian_product ({0, 1}, {0, 1});
(%o2)           {[0, 0], [0, 1], [1, 0], [1, 1]}
(%i3) cartesian_product ({x}, {y}, {z});
(%o3)                      {[x, y, z]}
(%i4) cartesian_product ({x}, {-1, 0, 1});
(%o4)              {[x, - 1], [x, 0], [x, 1]}
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fdisjoin"></span><dl class="def">
<dt id="index-disjoin"><span class="category">Función: </span><span><strong>disjoin</strong> <em>(<var>x</var>, <var>a</var>)</em><a href='#index-disjoin' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve el conjunto <var>a</var> sin el elemento <var>x</var>.
Si <var>x</var> no es elemento de <var>a</var>, entonces el
resultado es el propio <var>a</var>.
</p>
<p>La función <code>disjoin</code> emite un mensaje de error si
<var>a</var> no es un conjunto literal.
</p>
<p>Las sentencias <code>disjoin(<var>x</var>, <var>a</var>)</code>, <code>delete(<var>x</var>, <var>a</var>)</code>
y <code>setdifference(<var>a</var>, set(<var>x</var>))</code> son todas ellas equivalentes;
pero en general, <code>disjoin</code> será más rápida que las otras.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) disjoin (a, {a, b, c, d});
(%o1)                       {b, c, d}
(%i2) disjoin (a + b, {5, z, a + b, %pi});
(%o2)                      {5, %pi, z}
(%i3) disjoin (a - b, {5, z, a + b, %pi});
(%o3)                  {5, %pi, b + a, z}
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fdisjointp"></span><dl class="def">
<dt id="index-disjointp"><span class="category">Función: </span><span><strong>disjointp</strong> <em>(<var>a</var>, <var>b</var>)</em><a href='#index-disjointp' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve <code>true</code> si y sólo si los conjuntos  <var>a</var> y <var>b</var>
son disjuntos.
</p>
<p>La función <code>disjointp</code> emite un mensaje de error si
<var>a</var> o <var>b</var> no son conjuntos literales.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) disjointp ({a, b, c}, {1, 2, 3});
(%o1)                         true
(%i2) disjointp ({a, b, 3}, {1, 2, 3});
(%o2)                         false
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fdivisors"></span><dl class="def">
<dt id="index-divisors"><span class="category">Función: </span><span><strong>divisors</strong> <em>(<var>n</var>)</em><a href='#index-divisors' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Calcula el conjunto de divisores de <var>n</var>.
</p>
<p>La sentencia <code>divisors(<var>n</var>)</code> devuelve un conjunto
de enteros si <var>n</var> es un entero no nulo.
El conjunto de divisores incluye los elementos 1 y <var>n</var>.
Los divisores de un entero negativo son los divisores de su
valor absoluto.
</p>
<p>La función <code>divisors</code> se distribuye sobre las ecuaciones,
listas, matrices y conjuntos.
</p>
<p>Ejemplos:
</p>
<p>Se puede comprobar que 28 es un número perfecto:
la suma de sus divisores (excepto él mismo) es 28.
</p>
<div class="example">
<pre class="example">(%i1) s: divisors(28);
(%o1)                 {1, 2, 4, 7, 14, 28}
(%i2) lreduce (&quot;+&quot;, args(s)) - 28;
(%o2)                          28
</pre></div>

<p>La función <code>divisors</code> es simplificadora.
Haciendo la sustitución de <code>a</code> por 8 en <code>divisors(a)</code>
devuelve los divisores sin tener que reevaluar <code>divisors(8)</code>,
</p>
<div class="example">
<pre class="example">(%i1) divisors (a);
(%o1)                      divisors(a)
(%i2) subst (8, a, %);
(%o2)                     {1, 2, 4, 8}
</pre></div>

<p>La función <code>divisors</code> se distribuye sobre ecuaciones, listas,
matrices y conjuntos.
</p>
<div class="example">
<pre class="example">(%i1) divisors (a = b);
(%o1)               divisors(a) = divisors(b)
(%i2) divisors ([a, b, c]);
(%o2)        [divisors(a), divisors(b), divisors(c)]
(%i3) divisors (matrix ([a, b], [c, d]));
                  [ divisors(a)  divisors(b) ]
(%o3)             [                          ]
                  [ divisors(c)  divisors(d) ]
(%i4) divisors ({a, b, c});
(%o4)        {divisors(a), divisors(b), divisors(c)}
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002felementp"></span><dl class="def">
<dt id="index-elementp"><span class="category">Función: </span><span><strong>elementp</strong> <em>(<var>x</var>, <var>a</var>)</em><a href='#index-elementp' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve <code>true</code> si y sólo si <var>x</var> es miembro del
conjunto <var>a</var>.
</p>
<p>La función <code>elementp</code> emite un mensaje de error si 
<var>a</var> no es un conjunto literal.
</p>
<p>Ejemplos: 
</p>
<div class="example">
<pre class="example">(%i1) elementp (sin(1), {sin(1), sin(2), sin(3)});
(%o1)                         true
(%i2) elementp (sin(1), {cos(1), cos(2), cos(3)});
(%o2)                         false
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002femptyp"></span><dl class="def">
<dt id="index-emptyp"><span class="category">Función: </span><span><strong>emptyp</strong> <em>(<var>a</var>)</em><a href='#index-emptyp' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Devuelve <code>true</code> si y sólo si <var>a</var> es el conjunto vacío o la lista vacía.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) map (emptyp, [{}, []]);
(%o1)                     [true, true]
(%i2) map (emptyp, [a + b, {{}}, %pi]);
(%o2)                 [false, false, false]
</pre></div>
</dd></dl>
       

<span id="Item_003a-nset_002ees_002fdeffn_002fequiv_005fclasses"></span><dl class="def">
<dt id="index-equiv_005fclasses"><span class="category">Función: </span><span><strong>equiv_classes</strong> <em>(<var>s</var>, <var>F</var>)</em><a href='#index-equiv_005fclasses' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve el conjunto de las clases de equivalencia del conjunto <var>s</var>
respecto de la relación de equivalencia <var>F</var>.
</p>
<p>El argumento <var>F</var> es una función de dos variables definida sobre
el producto cartesiano <var>s</var> por <var>s</var>.
El valor devuelto por <var>F</var> debe ser <code>true</code> o <code>false</code>,
o bien una expresión <var>expr</var> tal que <code>is(<var>expr</var>)</code>
tome el valor <code>true</code> o <code>false</code>.
</p>
<p>Si <var>F</var> no es una relación de equivalencia, <code>equiv_classes</code>
la acepta sin emitir ningún mensaje de error, pero el resultado
será incorrecto en general.
</p>
<p>Ejemplos:
</p>
<p>La relación de equivalencia es una expresión lambda que devuelve 
<code>true</code> o <code>false</code>,
</p>
<div class="example">
<pre class="example">(%i1) equiv_classes ({1, 1.0, 2, 2.0, 3, 3.0},
                      lambda ([x, y], is (equal (x, y))));
(%o1)            {{1, 1.0}, {2, 2.0}, {3, 3.0}}
</pre></div>

<p>La relación de equivalencia es el nombre de una función relacional
en la que <code>is</code> evalúa a <code>true</code> o <code>false</code>,
</p>
<div class="example">
<pre class="example">(%i1) equiv_classes ({1, 1.0, 2, 2.0, 3, 3.0}, equal);
(%o1)            {{1, 1.0}, {2, 2.0}, {3, 3.0}}
</pre></div>

<p>Las clases de equivalencia son números que difieren en un múltiplo de 3.
</p>
<div class="example">
<pre class="example">(%i1) equiv_classes ({1, 2, 3, 4, 5, 6, 7}, 
              lambda ([x, y], remainder (x - y, 3) = 0));
(%o1)              {{1, 4, 7}, {2, 5}, {3, 6}}
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fevery"></span><dl class="def">
<dt id="index-every"><span class="category">Función: </span><span><strong>every</strong> <em>(<var>f</var>, <var>s</var>)</em><a href='#index-every' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-every-1"><span class="category">Función: </span><span><strong>every</strong> <em>(<var>f</var>, <var>L_1</var>, ..., <var>L_n</var>)</em><a href='#index-every-1' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve <code>true</code> si el predicado <var>f</var> vale <code>true</code>
para todos los argumentos dados.
</p>
<p>Dado un conjunto como segundo argumento,
<code>every(<var>f</var>, <var>s</var>)</code> devuelve <code>true</code>
si <code>is(<var>f</var>(<var>a_i</var>))</code> devuelve <code>true</code> para todos los
<var>a_i</var> pertenecientes <var>s</var>.
La función <code>every</code> puede evaluar o no <var>f</var> para todos los
<var>a_i</var> pertenecientes <var>s</var>.
Puesto que los conjuntos no están ordenados, <code>every</code>
puede evaluar <code><var>f</var>(<var>a_i</var>)</code> en cualquier orden.
</p>
<p>Dada una o más listas como argumentos,
<code>every(<var>f</var>, <var>L_1</var>, ..., <var>L_n</var>)</code> devuelve <code>true</code>
si <code>is(<var>f</var>(<var>x_1</var>, ..., <var>x_n</var>))</code> devuelve <code>true</code> 
para todo <var>x_1</var>, ..., <var>x_n</var> en <var>L_1</var>, ..., <var>L_n</var>, respectivamente.
La función <code>every</code> puede evaluar o no 
<var>f</var> para cualquier combinación de <var>x_1</var>, ..., <var>x_n</var>; además,
<code>every</code> evalúa las listas en el orden creciente del índice.
</p>
<p>Dado un conjunto vacío <code>{}</code> o lista vacía 
<code>[]</code> como argumentos, <code>every</code> devuelve <code>false</code>.
</p>
<p>Si la variable global <code>maperror</code> vale <code>true</code>, todas las listas
<var>L_1</var>, ..., <var>L_n</var> deben ser de igual longitud.
Si <code>maperror</code> vale <code>false</code>, los argumentos en forma de listas
se truncan para igualar sus longitudes a la de la lista más corta.
</p>
<p>Los valores que devuelve el predicado <var>f</var> cuando toman 
(mediante <code>is</code>) un valor diferente a <code>true</code> y <code>false</code>
se controlan con la variable global <code>prederror</code>.
Si <code>prederror</code> vale <code>true</code>, tales valores se
consideran como <code>false</code> y la respuesta de <code>every</code> es <code>false</code>.
Si <code>prederror</code> vale <code>false</code>, tales valores se
consideran como desconocidos (<code>unknown</code>) y la respuesta de 
<code>every</code> es <code>unknown</code>.
</p>
<p>Ejemplos:
</p>
<p>Se aplica <code>every</code> a un único conjunto.
El predicado es una función de un argumento.
</p>
<div class="example">
<pre class="example">(%i1) every (integerp, {1, 2, 3, 4, 5, 6});
(%o1)                         true
(%i2) every (atom, {1, 2, sin(3), 4, 5 + y, 6});
(%o2)                         false
</pre></div>

<p>Se aplica <code>every</code> a dos listas.
El predicado es una función de dos argumentos.
</p>
<div class="example">
<pre class="example">(%i1) every (&quot;=&quot;, [a, b, c], [a, b, c]);
(%o1)                         true
(%i2) every (&quot;#&quot;, [a, b, c], [a, b, c]);
(%o2)                         false
</pre></div>

<p>Las respuestas del predicado <var>f</var> que se evalúan 
a cualquier cosa diferente de <code>true</code> y <code>false</code>
están controlados por la variable global <code>prederror</code>.
</p>
<div class="example">
<pre class="example">(%i1) prederror : false;
(%o1)                         false
(%i2) map (lambda ([a, b], is (a &lt; b)), [x, y, z],
                   [x^2, y^2, z^2]);
(%o2)              [unknown, unknown, unknown]
(%i3) every (&quot;&lt;&quot;, [x, y, z], [x^2, y^2, z^2]);
(%o3)                        unknown
(%i4) prederror : true;
(%o4)                         true
(%i5) every (&quot;&lt;&quot;, [x, y, z], [x^2, y^2, z^2]);
(%o5)                         false
</pre></div>
</dd></dl>
 

<span id="Item_003a-nset_002ees_002fdeffn_002fextremal_005fsubset"></span><dl class="def">
<dt id="index-extremal_005fsubset"><span class="category">Función: </span><span><strong>extremal_subset</strong> <em>(<var>s</var>, <var>f</var>, max)</em><a href='#index-extremal_005fsubset' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-extremal_005fsubset-1"><span class="category">Función: </span><span><strong>extremal_subset</strong> <em>(<var>s</var>, <var>f</var>, min)</em><a href='#index-extremal_005fsubset-1' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Calcula el subconjunto de <var>s</var> para el cual la función <var>f</var>
toma sus valores mayor y menor.
</p>
<p>La sentencia <code>extremal_subset(<var>s</var>, <var>f</var>, max)</code>
devuelve el subconjunto del conjunto o lista <var>s</var> para el cual
la función real <var>f</var> toma su valor máximo.
</p>
<p>La sentencia <code>extremal_subset(<var>s</var>, <var>f</var>, min)</code>
devuelve el subconjunto del conjunto o lista <var>s</var> para el cual
la función real <var>f</var> toma su valor mínimo.
</p>
<p>Ejemplos
</p>
<div class="example">
<pre class="example">(%i1) extremal_subset ({-2, -1, 0, 1, 2}, abs, max);
(%o1)                       {- 2, 2}
(%i2) extremal_subset ({sqrt(2), 1.57, %pi/2}, sin, min);
(%o2)                       {sqrt(2)}
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fflatten"></span><dl class="def">
<dt id="index-flatten"><span class="category">Función: </span><span><strong>flatten</strong> <em>(<var>expr</var>)</em><a href='#index-flatten' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Recoge los argumentos de subexpresiones con el mismo operador que <var>expr</var>
y construye con ellas otra expresión a partir de estos argumentos.
</p>
<p>Aquellas subexpresiones en las que el operador es diferente del operador
principal de <code>expr</code> se copian sin modificarse, incluso cuando ellas
mismas contengan subexpresiones en las que el operador sea el mismo 
que el de <code>expr</code>.
</p>
<p>Es posible que <code>flatten</code> construya expresiones en las que el número
de argumentos difiera del número admitido por el operador, lo cual
hará que se emita un mensaje de error. La función <code>flatten</code>
no intentará detectar estas situaciones.
</p>
<p>Las expresiones que tengan representaciones especiales, por ejemplo las racionales
canónicas (CRE), no admiten que se aplique sobre ellas la función <code>flatten</code>;
en tales casos se devuelve el argumento sin modificación.
</p>
<p>Ejemplos:
</p>
<p>Aplicada a una lista, <code>flatten</code> reune todos los elementos que son a su vez listas.
</p>
<div class="example">
<pre class="example">(%i1) flatten ([a, b, [c, [d, e], f], [[g, h]], i, j]);
(%o1)            [a, b, c, d, e, f, g, h, i, j]
</pre></div>

<p>Aplicado a un conjunto, <code>flatten</code> reune todos los elementos que son a su vez conjuntos.
</p>
<div class="example">
<pre class="example">(%i1) flatten ({a, {b}, {{c}}});
(%o1)                       {a, b, c}
(%i2) flatten ({a, {[a], {a}}});
(%o2)                       {a, [a]}
</pre></div>

<p>La función <code>flatten</code> es similar a la declaración del operador
principal como n-ario. Sin embargo, <code>flatten</code> no tiene efecto alguno
sobre subexpresiones que tengan un operador diferente del principal, mientras
que sí lo tiene una declaración n-aria.
</p>

<div class="example">
<pre class="example">(%i1) expr: flatten (f (g (f (f (x)))));
(%o1)                     f(g(f(f(x))))
(%i2) declare (f, nary);
(%o2)                         done
(%i3) ev (expr);
(%o3)                      f(g(f(x)))
</pre></div>

<p>La función <code>flatten</code> trata las funciones subindicadas como
a cualquier otro operador.
</p>
<div class="example">
<pre class="example">(%i1) flatten (f[5] (f[5] (x, y), z));
(%o1)                      f (x, y, z)
                            5
</pre></div>

<p>Es posible que <code>flatten</code> construya expresiones en las que el número
de argumentos difiera del número admitido por el operador.
</p>
<div class="example">
<pre class="example">(%i1) 'mod (5, 'mod (7, 4));
(%o1)                   mod(5, mod(7, 4))
(%i2) flatten (%);
(%o2)                     mod(5, 7, 4)
(%i3) ''%, nouns;
Wrong number of arguments to mod
 -- an error.  Quitting.  To debug this try debugmode(true);
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002ffull_005flistify"></span><dl class="def">
<dt id="index-full_005flistify"><span class="category">Función: </span><span><strong>full_listify</strong> <em>(<var>a</var>)</em><a href='#index-full_005flistify' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Sustituye los operadores de conjunto presentes en <var>a</var>
por operadores de listas, devolviendo el resultado.
La función <code>full_listify</code> sustituye operadores de 
conjuntos en subexpresiones anidadas, incluso cuando
el operador principal no es <code>set</code>.
</p>
<p>La función <code>listify</code> sustituye únicamente el
operador principal.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) full_listify ({a, b, {c, {d, e, f}, g}});
(%o1)               [a, b, [c, [d, e, f], g]]
(%i2) full_listify (F (G ({a, b, H({c, d, e})})));
(%o2)              F(G([a, b, H([c, d, e])]))
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002ffullsetify"></span><dl class="def">
<dt id="index-fullsetify"><span class="category">Función: </span><span><strong>fullsetify</strong> <em>(<var>a</var>)</em><a href='#index-fullsetify' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Si <var>a</var> es una lista, sustituye el operador de lista por el
de conjunto, aplicando posteriormente <code>fullsetify</code> a todos
los elementos que son a su vez conjuntos.
Si <var>a</var> no es una lista, se devuelve sin cambio alguno.
</p>
<p>La función <code>setify</code> sustituye solamente el operador principal.
</p>
<p>Ejemplos:
</p>
<p>En la salida <code>(%o2)</code> el argumento de <code>f</code> no se convierte en
conjunto porque el operador principal de <code>f([b])</code> no es una lista.
</p>
<div class="example">
<pre class="example">(%i1) fullsetify ([a, [a]]);
(%o1)                       {a, {a}}
(%i2) fullsetify ([a, f([b])]);
(%o2)                      {a, f([b])}
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fidentity"></span><dl class="def">
<dt id="index-identity"><span class="category">Función: </span><span><strong>identity</strong> <em>(<var>x</var>)</em><a href='#index-identity' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>La función <code>identity</code> devuelve su argumento cualquiera que sea éste.
</p>
<p>Ejemplos:
</p>
<p>La función <code>identity</code> puede utilizarse como predicado cuando
los argumentos ya son valores booleanos.
</p>
<div class="example">
<pre class="example">(%i1) every (identity, [true, true]);
(%o1)                         true
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002finteger_005fpartitions"></span><dl class="def">
<dt id="index-integer_005fpartitions"><span class="category">Función: </span><span><strong>integer_partitions</strong> <em>(<var>n</var>)</em><a href='#index-integer_005fpartitions' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-integer_005fpartitions-1"><span class="category">Función: </span><span><strong>integer_partitions</strong> <em>(<var>n</var>, <var>len</var>)</em><a href='#index-integer_005fpartitions-1' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve particiones enteras de <var>n</var>, esto es,
listas de enteros cuyas sumas son <var>n</var>.
</p>
<p>La sentencia <code>integer_partitions(<var>n</var>)</code>
devuelve el conjunto de todas las particiones del entero <var>n</var>.
Cada partición es una lista ordenada de mayor a menor.
</p>
<p>La sentencia <code>integer_partitions(<var>n</var>, <var>len</var>)</code>
devuelve todas las particiones de longitud <var>len</var> o menor;
en este caso, se añaden ceros a cada partición con menos
de <var>len</var> términos para que todas ellas sean de longitud
<var>len</var>. Las particiones son listas ordenadas de mayor a menor.
</p>
<p>Una lista <em class='tex2jax_process'>\([a_1, ..., a_m]\)</em> es una partición de un entero no
negativo <em class='tex2jax_process'>\(n\)</em> si (1) cada <em class='tex2jax_process'>\(a_i\)</em> es entero no nulo y (2)
<em class='tex2jax_process'>\(a_1 + ... + a_m = n.\)</em> Así, 0 no tiene particiones.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) integer_partitions (3);
(%o1)               {[1, 1, 1], [2, 1], [3]}
(%i2) s: integer_partitions (25)$
(%i3) cardinality (s);
(%o3)                         1958
(%i4) map (lambda ([x], apply (&quot;+&quot;, x)), s);
(%o4)                         {25}
(%i5) integer_partitions (5, 3);
(%o5) {[2, 2, 1], [3, 1, 1], [3, 2, 0], [4, 1, 0], [5, 0, 0]}
(%i6) integer_partitions (5, 2);
(%o6)               {[3, 2], [4, 1], [5, 0]}
</pre></div>

<p>Para encontrar todas las particiones que satisfagan cierta
condición, utilícese la función <code>subset</code>;
he aquí un ejemplo que encuentra todas las
particiones de 10 formadas por números primos.
</p>
<div class="example">
<pre class="example">(%i1) s: integer_partitions (10)$
(%i2) cardinality (s);
(%o2)                          42
(%i3) xprimep(x) := integerp(x) and (x &gt; 1) and primep(x)$
(%i4) subset (s, lambda ([x], every (xprimep, x)));
(%o4) {[2, 2, 2, 2, 2], [3, 3, 2, 2], [5, 3, 2], [5, 5], [7, 3]}
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fintersect"></span><dl class="def">
<dt id="index-intersect"><span class="category">Función: </span><span><strong>intersect</strong> <em>(<var>a_1</var>, ..., <var>a_n</var>)</em><a href='#index-intersect' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Es una forma abreviada de la función <code>intersection</code>.
</p></dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fintersection"></span><dl class="def">
<dt id="index-intersection"><span class="category">Función: </span><span><strong>intersection</strong> <em>(<var>a_1</var>, ..., <var>a_n</var>)</em><a href='#index-intersection' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve el conjunto de todos los elementos que son
comunes a los conjuntos  <var>a_1</var> a <var>a_n</var>.
</p>
<p>Emite un mensaje de error en caso de que cualquiera de los 
<var>a_i</var> no sea un conjunto.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) S_1 : {a, b, c, d};
(%o1)                     {a, b, c, d}
(%i2) S_2 : {d, e, f, g};
(%o2)                     {d, e, f, g}
(%i3) S_3 : {c, d, e, f};
(%o3)                     {c, d, e, f}
(%i4) S_4 : {u, v, w};
(%o4)                       {u, v, w}
(%i5) intersection (S_1, S_2);
(%o5)                          {d}
(%i6) intersection (S_2, S_3);
(%o6)                       {d, e, f}
(%i7) intersection (S_1, S_2, S_3);
(%o7)                          {d}
(%i8) intersection (S_1, S_2, S_3, S_4);
(%o8)                          {}
</pre></div>
</dd></dl>

<span id="Item_003a-nset_002ees_002fdeffn_002fkron_005fdelta"></span><dl class="def">
<dt id="index-kron_005fdelta"><span class="category">Función: </span><span><strong>kron_delta</strong> <em>(<var>x1</var>, <var>y1</var>, &hellip;, <var>xp</var>, <var>yp</var>)</em><a href='#index-kron_005fdelta' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Es la función delta de Kronecker.
</p>
<p>La función <code>kron_delta</code> devuelve 1 cuando <var>xi</var> y
<var>yi</var> son iguales para todos los pares, devolviendo 0 si existe
un par en el que <var>xi</var> y <var>yi</var> no sean iguales. La igualdad
se determina utilizando <code>is(equal(xi,xj))</code> y la desigualdad
con <code>is(notequal(xi,xj))</code>. En caso de un solo argumento,
<code>kron_delta</code> devuelve un mensaje de error.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) kron_delta(a,a);
(%o1)                                  1
(%i2) kron_delta(a,b,a,b);
(%o2)                          kron_delta(a, b)
(%i3) kron_delta(a,a,b,a+1);
(%o3)                                  0
(%i4) assume(equal(x,y));
(%o4)                            [equal(x, y)]
(%i5) kron_delta(x,y);
(%o5)                                  1
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002flistify"></span><dl class="def">
<dt id="index-listify"><span class="category">Función: </span><span><strong>listify</strong> <em>(<var>a</var>)</em><a href='#index-listify' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Si <var>a</var> es un conjunto, devuelve una lista con los elementos de <var>a</var>;
si  <var>a</var> no es un conjunto, devuelve <var>a</var>.
</p>
<p>La función <code>full_listify</code> sustituye todos los operadores
de conjunto en <var>a</var> por operadores de lista.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) listify ({a, b, c, d});
(%o1)                     [a, b, c, d]
(%i2) listify (F ({a, b, c, d}));
(%o2)                    F({a, b, c, d})
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002flreduce"></span><dl class="def">
<dt id="index-lreduce"><span class="category">Función: </span><span><strong>lreduce</strong> <em>(<var>f</var>, <var>s</var>)</em><a href='#index-lreduce' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-lreduce-1"><span class="category">Función: </span><span><strong>lreduce</strong> <em>(<var>f</var>, <var>s</var>, <var>init</var>)</em><a href='#index-lreduce-1' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Amplía la función binaria <var>F</var> a n-aria mediante
composición, siendo <var>s</var> una lista.
</p>
<p>La sentencia  <code>lreduce(<var>F</var>, <var>s</var>)</code> devuelve
<code>F(... F(F(s_1, s_2), s_3), ... s_n)</code>.
Si se incluye el argumento opcional <var>s_0</var>,
el resultado equivale a <code>lreduce(<var>F</var>, cons(<var>s_0</var>, <var>s</var>))</code>.
</p>
<p>La función <var>F</var> se aplica primero a los elementos del
extremo izquierdo de la lista, de ahí el nombre
<code>lreduce</code>, (<i>left reduce</i>).
</p>
<p>Véanse también <code>rreduce</code>, <code>xreduce</code> y <code>tree_reduce</code>.
</p>
<p>Ejemplos:
</p>
<p>La función <code>lreduce</code> sin el argumento opcional,
</p>
<div class="example">
<pre class="example">(%i1) lreduce (f, [1, 2, 3]);
(%o1)                     f(f(1, 2), 3)
(%i2) lreduce (f, [1, 2, 3, 4]);
(%o2)                  f(f(f(1, 2), 3), 4)
</pre></div>

<p>La función <code>lreduce</code> con el argumento opcional,
</p>
<div class="example">
<pre class="example">(%i1) lreduce (f, [1, 2, 3], 4);
(%o1)                  f(f(f(4, 1), 2), 3)
</pre></div>

<p>La función <code>lreduce</code> aplicada a operadores binarios de Maxima.
El símbolo <code>/</code> es el operador división.
</p>
<div class="example">
<pre class="example">(%i1) lreduce (&quot;^&quot;, args ({a, b, c, d}));
                               b c d
(%o1)                       ((a ) )
(%i2) lreduce (&quot;/&quot;, args ({a, b, c, d}));
                                a
(%o2)                         -----
                              b c d
</pre></div>

</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fmakeset"></span><dl class="def">
<dt id="index-makeset"><span class="category">Función: </span><span><strong>makeset</strong> <em>(<var>expr</var>, <var>x</var>, <var>s</var>)</em><a href='#index-makeset' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Genera un conjunto cuyos miembros se generan a partir de la
expresión <var>expr</var>, siendo <var>x</var> una lista de variables de
<var>expr</var> y <var>s</var> un conjunto o lista de listas.
Para generar los elementos del conjunto, se evalúa <var>expr</var>
asignando a las variables de <var>x</var> los elementos de <var>s</var>
en paralelo.
</p>
<p>Los elementos de <var>s</var> deben tener la misma longitud que <var>x</var>.
La lista de variables <var>x</var> debe ser una lista de símbolos
sin subíndices. Cuando se trate de un único símbolo,
<var>x</var> debe expresarse como una lista de un elemento y cada elemento de <var>s</var>
debe ser una lista de un sólo elemento.
</p>

<p>Véase también <code>makelist</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) makeset (i/j, [i, j], [[1, a], [2, b], [3, c], [4, d]]);
                           1  2  3  4
(%o1)                     {-, -, -, -}
                           a  b  c  d
(%i2) S : {x, y, z}$
(%i3) S3 : cartesian_product (S, S, S);
(%o3) {[x, x, x], [x, x, y], [x, x, z], [x, y, x], [x, y, y], 
[x, y, z], [x, z, x], [x, z, y], [x, z, z], [y, x, x], 
[y, x, y], [y, x, z], [y, y, x], [y, y, y], [y, y, z], 
[y, z, x], [y, z, y], [y, z, z], [z, x, x], [z, x, y], 
[z, x, z], [z, y, x], [z, y, y], [z, y, z], [z, z, x], 
[z, z, y], [z, z, z]}
(%i4) makeset (i + j + k, [i, j, k], S3);
(%o4) {3 x, 3 y, y + 2 x, 2 y + x, 3 z, z + 2 x, z + y + x, 
                                       z + 2 y, 2 z + x, 2 z + y}
(%i5) makeset (sin(x), [x], {[1], [2], [3]});
(%o5)               {sin(1), sin(2), sin(3)}
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fmoebius"></span><dl class="def">
<dt id="index-moebius"><span class="category">Función: </span><span><strong>moebius</strong> <em>(<var>n</var>)</em><a href='#index-moebius' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Representa la función de Moebius.
</p>
<p>Si <var>n</var> es el producto de <em class='tex2jax_process'>\(k\)</em> números primos diferentes,
<code>moebius(<var>n</var>)</code> devuelve <em class='tex2jax_process'>\((-1)^k\)</em>, retornando 1 si 
<em class='math'><var>n</var> = 1</em> y 0 para cualesquiera otros enteros positivos.
</p>

<p>La función de Moebius se distribuye respecto de ecuaciones,
listas, matrices y conjuntos.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) moebius (1);
(%o1)                           1
(%i2) moebius (2 * 3 * 5);
(%o2)                          - 1
(%i3) moebius (11 * 17 * 29 * 31);
(%o3)                           1
(%i4) moebius (2^32);
(%o4)                           0
(%i5) moebius (n);
(%o5)                      moebius(n)
(%i6) moebius (n = 12);
(%o6)                    moebius(n) = 0
(%i7) moebius ([11, 11 * 13, 11 * 13 * 15]);
(%o7)                      [- 1, 1, 1]
(%i8) moebius (matrix ([11, 12], [13, 14]));
                           [ - 1  0 ]
(%o8)                      [        ]
                           [ - 1  1 ]
(%i9) moebius ({21, 22, 23, 24});
(%o9)                      {- 1, 0, 1}
</pre></div>
</dd></dl>
 

<span id="Item_003a-nset_002ees_002fdeffn_002fmultinomial_005fcoeff"></span><dl class="def">
<dt id="index-multinomial_005fcoeff"><span class="category">Función: </span><span><strong>multinomial_coeff</strong> <em>(<var>a_1</var>, ..., <var>a_n</var>)</em><a href='#index-multinomial_005fcoeff' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-multinomial_005fcoeff-1"><span class="category">Función: </span><span><strong>multinomial_coeff</strong> <em>()</em><a href='#index-multinomial_005fcoeff-1' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Calcula el coeficiente multinomial.
</p>
<p>Si todos los <var>a_k</var> son enteros no negativos, el coeficiente multinomial
es el número de formas de colocar  <code><var>a_1</var> + ... + <var>a_n</var></code>
objetos diferentes en  <em class='tex2jax_process'>\(n\)</em> cajas con <var>a_k</var> elementos en la
<em class='tex2jax_process'>\(k\)</em>-ésima caja. En general,
<code>multinomial_coeff (<var>a_1</var>, ..., <var>a_n</var>)</code> calcula
<code>(<var>a_1</var> + ... + <var>a_n</var>)!/(<var>a_1</var>! ... <var>a_n</var>!)</code>.
</p>
<p>Si no se dan argumentos, <code>multinomial_coeff()</code> devuelve 1.
</p>
<p>Se puede usar <code>minfactorial</code> para simplificar el valor
devuelto por <code>multinomial_coeff</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) multinomial_coeff (1, 2, x);
                            (x + 3)!
(%o1)                       --------
                              2 x!
(%i2) minfactorial (%);
                     (x + 1) (x + 2) (x + 3)
(%o2)                -----------------------
                                2
(%i3) multinomial_coeff (-6, 2);
                             (- 4)!
(%o3)                       --------
                            2 (- 6)!
(%i4) minfactorial (%);
(%o4)                          10
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fnum_005fdistinct_005fpartitions"></span><dl class="def">
<dt id="index-num_005fdistinct_005fpartitions"><span class="category">Función: </span><span><strong>num_distinct_partitions</strong> <em>(<var>n</var>)</em><a href='#index-num_005fdistinct_005fpartitions' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-num_005fdistinct_005fpartitions-1"><span class="category">Función: </span><span><strong>num_distinct_partitions</strong> <em>(<var>n</var>, <var>list</var>)</em><a href='#index-num_005fdistinct_005fpartitions-1' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Si <var>n</var> es un entero no negativo, devuelve el número de
particiones enteras distintas de <var>n</var>, en caso contrario
<code>num_distinct_partitions</code> devuelve una forma nominal.
</p>
<p>La sentencia <code>num_distinct_partitions(<var>n</var>, list)</code>
devuelve una lista con el número de particiones distintas
de 1, 2, 3, ..., <var>n</var>.
</p>
<p>Una partición distinta de <var>n</var> es una lista de números
enteros positivos distintos <em class='tex2jax_process'>\(k_1\)</em>, ..., <em class='tex2jax_process'>\(k_m\)</em>
tales que <em class='math'><var>n</var> = k_1 + ... + k_m</em>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) num_distinct_partitions (12);
(%o1)                          15
(%i2) num_distinct_partitions (12, list);
(%o2)      [1, 1, 1, 2, 2, 3, 4, 5, 6, 8, 10, 12, 15]
(%i3) num_distinct_partitions (n);
(%o3)              num_distinct_partitions(n)
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fnum_005fpartitions"></span><dl class="def">
<dt id="index-num_005fpartitions"><span class="category">Función: </span><span><strong>num_partitions</strong> <em>(<var>n</var>)</em><a href='#index-num_005fpartitions' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-num_005fpartitions-1"><span class="category">Función: </span><span><strong>num_partitions</strong> <em>(<var>n</var>, <var>list</var>)</em><a href='#index-num_005fpartitions-1' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Si <var>n</var> es un entero no negativo, devuelve el número de
particiones enteras de <var>n</var>, en caso contrario <code>num_partitions</code>
devuelve una expresión nominal.
</p>
<p>La sentencia <code>num_partitions(<var>n</var>, list)</code> devuelve una lista
con los números de particiones enteras de 1, 2, 3, ..., <var>n</var>.
</p>
<p>Siendo <var>n</var> un entero no negativo, <code>num_partitions(<var>n</var>)</code>
es igual a <code>cardinality(integer_partitions(<var>n</var>))</code>; sin
embargo, <code>num_partitions</code> no construye el conjunto de 
particiones, por lo que es más rápido.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) num_partitions (5) = cardinality (integer_partitions (5));
(%o1)                         7 = 7
(%i2) num_partitions (8, list);
(%o2)            [1, 1, 2, 3, 5, 7, 11, 15, 22]
(%i3) num_partitions (n);
(%o3)                   num_partitions(n)
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fpartition_005fset"></span><dl class="def">
<dt id="index-partition_005fset"><span class="category">Función: </span><span><strong>partition_set</strong> <em>(<var>a</var>, <var>f</var>)</em><a href='#index-partition_005fset' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Particiona el conjunto <var>a</var> respecto del predicado <var>f</var>.
</p>
<p>La función <code>partition_set</code> devuelve una lista con dos conjuntos;
el primer conjunto es el subconjunto de <var>a</var> para el cual el predicado
<var>f</var> devuelve <code>false</code> y el segundo contiene al resto de elementos de <var>a</var>.
</p>
<p>La función <code>partition_set</code> no aplica <code>is</code> al valor devuelto
por <var>f</var>.
</p>
<p>La función <code>partition_set</code> emite un mensaje de error si <var>a</var>
no es un conjunto literal.
</p>
<p>Véase también <code>subset</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) partition_set ({2, 7, 1, 8, 2, 8}, evenp);
(%o1)                   [{1, 7}, {2, 8}]
(%i2) partition_set ({x, rat(y), rat(y) + z, 1},
                  lambda ([x], ratp(x)));
(%o2)/R/              [{1, x}, {y, y + z}]
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fpermutations"></span><dl class="def">
<dt id="index-permutations"><span class="category">Función: </span><span><strong>permutations</strong> <em>(<var>a</var>)</em><a href='#index-permutations' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve un conjunto con todas las permutaciones distintas
de los miembros de la lista o conjunto  <var>a</var>. Cada permutación
es una lista, no un conjunto.
</p>
<p>Si <var>a</var> es una lista, sus miembros duplicados no son eliminados
antes de buscar sus permutaciones.
</p>
<p>Si <var>a</var> no es una lista o conjunto, <code>permutations</code> emite
un mensaje de error.
</p>
<p>Véase también <code>random_permutation</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) permutations ([a, a]);
(%o1)                       {[a, a]}
(%i2) permutations ([a, a, b]);
(%o2)           {[a, a, b], [a, b, a], [b, a, a]}
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fpowerset"></span><dl class="def">
<dt id="index-powerset"><span class="category">Función: </span><span><strong>powerset</strong> <em>(<var>a</var>)</em><a href='#index-powerset' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-powerset-1"><span class="category">Función: </span><span><strong>powerset</strong> <em>(<var>a</var>, <var>n</var>)</em><a href='#index-powerset-1' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve el conjunto de todos los subconjuntos del conjunto <var>a</var>
o un sunconjunto de ellos.
</p>
<p>La sentencia <code>powerset(<var>a</var>)</code> devuelve el conjunto de todos
los subconjuntos de <var>a</var>, que contendrá <code>2^cardinality(<var>a</var>)</code>
elementos.
</p>
<p>La sentencia <code>powerset(<var>a</var>, <var>n</var>)</code> devuelve el conjunto de todos
los subconjuntos de <var>a</var> de cardinalidad <var>n</var>.
</p>
<p>La función <code>powerset</code> emite un mensaje de error si <var>a</var> no
es un conjunto literal o si <var>n</var> no es un entero no negativo.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) powerset ({a, b, c});
(%o1) {{}, {a}, {a, b}, {a, b, c}, {a, c}, {b}, {b, c}, {c}}
(%i2) powerset ({w, x, y, z}, 4);
(%o2)                    {{w, x, y, z}}
(%i3) powerset ({w, x, y, z}, 3);
(%o3)     {{w, x, y}, {w, x, z}, {w, y, z}, {x, y, z}}
(%i4) powerset ({w, x, y, z}, 2);
(%o4)   {{w, x}, {w, y}, {w, z}, {x, y}, {x, z}, {y, z}}
(%i5) powerset ({w, x, y, z}, 1);
(%o5)                 {{w}, {x}, {y}, {z}}
(%i6) powerset ({w, x, y, z}, 0);
(%o6)                         {{}}
</pre></div>
</dd></dl>



<span id="Item_003a-nset_002ees_002fdeffn_002frandom_005fpermutation"></span><dl class="def">
<dt id="index-random_005fpermutation"><span class="category">Función: </span><span><strong>random_permutation</strong> <em>(<var>a</var>)</em><a href='#index-random_005fpermutation' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve una permutación aleatoria del conjunto o lista
<var>a</var>, siguiendo el algoritmo de Knuth.
</p>
<p>El valor devuelto es una lista nueva distinta del argumento,
incluso cuando todos los elementos son iguales. Sin embargo,
los elementos del argumento no se copian.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) random_permutation ([a, b, c, 1, 2, 3]);
(%o1)                  [c, 1, 2, 3, a, b]
(%i2) random_permutation ([a, b, c, 1, 2, 3]);
(%o2)                  [b, 3, 1, c, a, 2]
(%i3) random_permutation ({x + 1, y + 2, z + 3});
(%o3)                 [y + 2, z + 3, x + 1]
(%i4) random_permutation ({x + 1, y + 2, z + 3});
(%o4)                 [x + 1, y + 2, z + 3]
</pre></div>

</dd></dl>




<span id="Item_003a-nset_002ees_002fdeffn_002frreduce"></span><dl class="def">
<dt id="index-rreduce"><span class="category">Función: </span><span><strong>rreduce</strong> <em>(<var>f</var>, <var>s</var>)</em><a href='#index-rreduce' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-rreduce-1"><span class="category">Función: </span><span><strong>rreduce</strong> <em>(<var>f</var>, <var>s</var>, <var>init</var>)</em><a href='#index-rreduce-1' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Amplía la función binaria <var>F</var> a n-aria mediante
composición, siendo <var>s</var> una lista.
</p>
<p>La sentencia  <code>rreduce(<var>F</var>, <var>s</var>)</code> devuelve
<code>F(s_1, ... F(s_{n - 2}, F(s_{n - 1}, s_n)))</code>.
Si se incluye el argumento opcional <var>s_{n + 1}</var>,
el resultado equivale a <code>rreduce(<var>F</var>, endcons(<var>s_{n + 1}</var>, <var>s</var>))</code>.
</p>
<p>La función <var>F</var> se aplica primero a los elementos del
extremo derecho de la lista, de ahí el nombre
<code>rreduce</code>, (<i>right reduce</i>).
</p>
<p>Véanse también <code>lreduce</code>, <code>xreduce</code> y <code>tree_reduce</code>.
</p>
<p>Ejemplos:
</p>
<p>La función <code>rreduce</code> sin el argumento opcional,
</p>
<div class="example">
<pre class="example">(%i1) rreduce (f, [1, 2, 3]);
(%o1)                     f(1, f(2, 3))
(%i2) rreduce (f, [1, 2, 3, 4]);
(%o2)                  f(1, f(2, f(3, 4)))
</pre></div>

<p>La función <code>rreduce</code> con el argumento opcional,
</p>
<div class="example">
<pre class="example">(%i1) rreduce (f, [1, 2, 3], 4);
(%o1)                  f(1, f(2, f(3, 4)))
</pre></div>

<p>La función <code>rreduce</code> aplicada a operadores binarios de Maxima.
El símbolo <code>/</code> es el operador división.
</p>
<div class="example">
<pre class="example">(%i1) rreduce (&quot;^&quot;, args ({a, b, c, d}));
                                 d
                                c
                               b
(%o1)                         a
(%i2) rreduce (&quot;/&quot;, args ({a, b, c, d}));
                               a c
(%o2)                          ---
                               b d
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fsetdifference"></span><dl class="def">
<dt id="index-setdifference"><span class="category">Función: </span><span><strong>setdifference</strong> <em>(<var>a</var>, <var>b</var>)</em><a href='#index-setdifference' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve el conjunto con los elementos del conjunto <var>a</var> que
no pertenecen al conjunto <var>b</var>.
</p>
<p>La función <code>setdifference</code> emite un mensaje de error si
<var>a</var> o <var>b</var> no son conjuntos.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) S_1 : {a, b, c, x, y, z};
(%o1)                  {a, b, c, x, y, z}
(%i2) S_2 : {aa, bb, c, x, y, zz};
(%o2)                 {aa, bb, c, x, y, zz}
(%i3) setdifference (S_1, S_2);
(%o3)                       {a, b, z}
(%i4) setdifference (S_2, S_1);
(%o4)                     {aa, bb, zz}
(%i5) setdifference (S_1, S_1);
(%o5)                          {}
(%i6) setdifference (S_1, {});
(%o6)                  {a, b, c, x, y, z}
(%i7) setdifference ({}, S_1);
(%o7)                          {}
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fsetequalp"></span><dl class="def">
<dt id="index-setequalp"><span class="category">Función: </span><span><strong>setequalp</strong> <em>(<var>a</var>, <var>b</var>)</em><a href='#index-setequalp' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve  <code>true</code> si los conjuntos <var>a</var> y <var>b</var> tienen
el mismo número de elementos
y <code>is (<var>x</var> = <var>y</var>)</code> vale <code>true</code>
para <code>x</code> perteneciente a <var>a</var>
e <code>y</code> perteneciente a <var>b</var>,
considerados en el orden que determina la función 
<code>listify</code>. En caso contrario, <code>setequalp</code>
devuelve <code>false</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) setequalp ({1, 2, 3}, {1, 2, 3});
(%o1)                         true
(%i2) setequalp ({a, b, c}, {1, 2, 3});
(%o2)                         false
(%i3) setequalp ({x^2 - y^2}, {(x + y) * (x - y)});
(%o3)                         false
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fsetify"></span><dl class="def">
<dt id="index-setify"><span class="category">Función: </span><span><strong>setify</strong> <em>(<var>a</var>)</em><a href='#index-setify' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Construye un conjunto con los miembros de la lista <var>a</var>.
Los elementos duplicados de la lista <var>a</var> son borrados
y ordenados de acuerdo con el predicado <code>orderlessp</code>.
</p>
<p>La función <code>setify</code> emite un mensaje de error si
<var>a</var> no es un conjunto literal.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) setify ([1, 2, 3, a, b, c]);
(%o1)                  {1, 2, 3, a, b, c}
(%i2) setify ([a, b, c, a, b, c]);
(%o2)                       {a, b, c}
(%i3) setify ([7, 13, 11, 1, 3, 9, 5]);
(%o3)                {1, 3, 5, 7, 9, 11, 13}
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fsetp"></span><dl class="def">
<dt id="index-setp"><span class="category">Función: </span><span><strong>setp</strong> <em>(<var>a</var>)</em><a href='#index-setp' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve <code>true</code> si y sólo si <var>a</var> es un conjunto de Maxima.
</p>
<p>La función <code>setp</code> devuelve <code>true</code> tanto cuando el conjunto
tiene como cuando no tiene elementos repetidos.
</p>
<p>La función <code>setp</code> is equivalent to the Maxima function
<code>setp(a) := not atom(a) and op(a) = 'set</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) simp : false;
(%o1)                         false
(%i2) {a, a, a};
(%o2)                       {a, a, a}
(%i3) setp (%);
(%o3)                         true
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fset_005fpartitions"></span><dl class="def">
<dt id="index-set_005fpartitions"><span class="category">Función: </span><span><strong>set_partitions</strong> <em>(<var>a</var>)</em><a href='#index-set_005fpartitions' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-set_005fpartitions-1"><span class="category">Función: </span><span><strong>set_partitions</strong> <em>(<var>a</var>, <var>n</var>)</em><a href='#index-set_005fpartitions-1' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve el conjunto de todas las particiones de <var>a</var> o
un subconjunto de ellas.
</p>
<p>La sentencia <code>set_partitions(<var>a</var>, <var>n</var>)</code>
devuelve un conjunto con todas las descomposiciones de <var>a</var>
en <var>n</var> conjuntos no vacíos disjuntos.
</p>
<p>La sentencia <code>set_partitions(<var>a</var>)</code> devuelve el
conjunto de todas las particiones.
</p>
<p>La función <code>stirling2</code> devuelve la cardinalidad del conjunto
de las particiones de un conjunto.
</p>
<p>Se dice que un conjunto <em class='tex2jax_process'>\(P\)</em> es una partición del conjunto <em class='tex2jax_process'>\(S\)</em> si verifica
</p>
<ol>
<li> cada elemento de <em class='tex2jax_process'>\(P\)</em> es un conjunto no vacío, 
</li><li> los elementos de <em class='tex2jax_process'>\(P\)</em> son disjuntos,
</li><li> la unión de los elementos de <em class='tex2jax_process'>\(P\)</em> es igual a  <em class='tex2jax_process'>\(S\)</em>.
</li></ol>

<p>Ejemplos:
</p>
<p>El conjunto vacío forma una partición de sí mismo,
</p>
<div class="example">
<pre class="example">(%i1) set_partitions ({});
(%o1)                         {{}}
</pre></div>

<p>La cardinalidad del conjunto de particiones de un conjunto puede calcularse con <code>stirling2</code>,
</p>
<div class="example">
<pre class="example">(%i1) s: {0, 1, 2, 3, 4, 5}$
(%i2) p: set_partitions (s, 3)$ 
(%i3) cardinality(p) = stirling2 (6, 3);
(%o3)                        90 = 90
</pre></div>

<p>Cada elemento de <code>p</code> debería tener <var>n</var> = 3 miembros,
</p>
<div class="example">
<pre class="example">(%i1) s: {0, 1, 2, 3, 4, 5}$
(%i2) p: set_partitions (s, 3)$ 
(%i3) map (cardinality, p);
(%o3)                          {3}
</pre></div>

<p>Por último, para cada miembro de <code>p</code>, la unión de sus elementos
debe ser igual a <code>s</code>,
</p>
<div class="example">
<pre class="example">(%i1) s: {0, 1, 2, 3, 4, 5}$
(%i2) p: set_partitions (s, 3)$ 
(%i3) map (lambda ([x], apply (union, listify (x))), p);
(%o3)                 {{0, 1, 2, 3, 4, 5}}
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fsome"></span><dl class="def">
<dt id="index-some"><span class="category">Función: </span><span><strong>some</strong> <em>(<var>f</var>, <var>a</var>)</em><a href='#index-some' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-some-1"><span class="category">Función: </span><span><strong>some</strong> <em>(<var>f</var>, <var>L_1</var>, ..., <var>L_n</var>)</em><a href='#index-some-1' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve <code>true</code> si el predicado <var>f</var> devuelve <code>true</code>
para al menos uno de sus argumentos.
Si el segundo argumento es un conjunto, <code>some (<var>f</var>, <var>a</var>)</code>
devuelve <code>true</code> si <code><var>f</var>(<var>a_i</var>)</code> devuelve también
<code>true</code> para alguno de los <var>a_i</var> en <var>a</var>; puede ser que
<code>some</code> no evalúe <var>f</var> para todos los <var>a_i</var> de <var>s</var>.
Puesto que los conjuntos no están ordenados, <code>some</code> puede evaluar
<code><var>f</var>(<var>a_i</var>)</code> en cualquier orden.
</p>
<p>Dada una o más listas como argumentos,
<code>some (<var>f</var>, <var>L_1</var>, ..., <var>L_n</var>)</code> devuelve <code>true</code>
si <code><var>f</var>(<var>x_1</var>, ..., <var>x_n</var>)</code> devuelve también
<code>true</code> para al menos un  <var>x_1</var>, ..., <var>x_n</var> de
<var>L_1</var>, ..., <var>L_n</var>, respectivamente; puede ser que
<code>some</code> no evalúe <var>f</var> para todos las combinaciones
<var>x_1</var>, ..., <var>x_n</var>. La función <code>some</code> evalúa
las listas en el orden creciente de su índice
</p>
<p>Dado un conjunto vacío <code>{}</code> o una lista
vacía como argumentos, <code>some</code> devuelve <code>false</code>.
</p>
<p>Si la variable global <code>maperror</code> vale <code>true</code>,
todas las listas <var>L_1</var>, ..., <var>L_n</var> deben tener
igual número de elementos. Si <code>maperror</code> vale
<code>false</code>, los argumentos se truncan para tener todos
el número de elementos de la lista más corta. 
</p>
<p>Los valores que devuelve el predicado <var>f</var> cuando toman 
(mediante <code>is</code>) un valor diferente a <code>true</code> y <code>false</code>
se controlan con la variable global <code>prederror</code>.
Si <code>prederror</code> vale <code>true</code>, tales valores se
consideran como <code>false</code>.
Si <code>prederror</code> vale <code>false</code>, tales valores se
consideran como desconocidos (<code>unknown</code>).
</p>
<p>Ejemplos:
</p>
<p>La función <code>some</code> aplicada a un único conjunto.
El predicado es una función de un argumento,
</p>
<div class="example">
<pre class="example">(%i1) some (integerp, {1, 2, 3, 4, 5, 6});
(%o1)                         true
(%i2) some (atom, {1, 2, sin(3), 4, 5 + y, 6});
(%o2)                         true
</pre></div>

<p>La función <code>some</code> aplicada a dos listas.
El predicado es una función de dos argumentos,
</p>
<div class="example">
<pre class="example">(%i1) some (&quot;=&quot;, [a, b, c], [a, b, c]);
(%o1)                         true
(%i2) some (&quot;#&quot;, [a, b, c], [a, b, c]);
(%o2)                         false
</pre></div>

<p>Las respuestas del predicado <var>f</var> que se evalúan 
a cualquier cosa diferente de <code>true</code> y <code>false</code>
están controlados por la variable global <code>prederror</code>.
</p>
<div class="example">
<pre class="example">(%i1) prederror : false;
(%o1)                         false
(%i2) map (lambda ([a, b], is (a &lt; b)), [x, y, z],
                     [x^2, y^2, z^2]);
(%o2)              [unknown, unknown, unknown]
(%i3) some (&quot;&lt;&quot;, [x, y, z], [x^2, y^2, z^2]);
(%o3)                        unknown
(%i4) some (&quot;&lt;&quot;, [x, y, z], [x^2, y^2, z + 1]);
(%o4)                         true
(%i5) prederror : true;
(%o5)                         true
(%i6) some (&quot;&lt;&quot;, [x, y, z], [x^2, y^2, z^2]);
(%o6)                         false
(%i7) some (&quot;&lt;&quot;, [x, y, z], [x^2, y^2, z + 1]);
(%o7)                         true
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fstirling1"></span><dl class="def">
<dt id="index-stirling1"><span class="category">Función: </span><span><strong>stirling1</strong> <em>(<var>n</var>, <var>m</var>)</em><a href='#index-stirling1' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Es el número de Stirling de primera especie.
</p>
<p>Si tanto <var>n</var> como <var>m</var> son enteros no negativos,
el valor que toma <code>stirling1 (<var>n</var>, <var>m</var>)</code>
es el número de permutaciones de un conjunto de
<var>n</var> elementos con <var>m</var> ciclos. Para más detalles,
véase Graham, Knuth and Patashnik <i>Concrete Mathematics</i>.
Maxima utiliza una relación recursiva para definir
<code>stirling1 (<var>n</var>, <var>m</var>)</code> para <var>m</var> menor
que 0; no está definida para <var>n</var> menor que 0 ni
para argumentos no enteros.
</p>
<p>La función <code>stirling1</code> es simplificadora. Maxima
reconoce las siguientes identidades:
</p>
<ol>
<li> <em class='tex2jax_process'>\(stirling1(0, n) = kron_delta(0, n)\)</em> (Ref. [1])
</li><li> <em class='tex2jax_process'>\(stirling1(n, n) = 1\)</em> (Ref. [1])
</li><li> <em class='tex2jax_process'>\(stirling1(n, n - 1) = binomial(n, 2)\)</em> (Ref. [1])
</li><li> <em class='tex2jax_process'>\(stirling1(n + 1, 0) = 0\)</em> (Ref. [1])
</li><li> <em class='tex2jax_process'>\(stirling1(n + 1, 1) = n!\)</em> (Ref. [1])
</li><li> <em class='tex2jax_process'>\(stirling1(n + 1, 2) = 2^n  - 1\)</em> (Ref. [1])
</li></ol>

<p>Estas identidades se aplican cuando los argumentos son enteros
literales o símbolos declarados como enteros y
el primer argumento es no negativo. La función <code>stirling1</code>
no simplifica para argumentos no enteros.
</p>
<p>Referencias:
</p>
<p>[1] Donald Knuth, <i>The Art of Computer Programming,</i>
Tercera Edición, Volumen 1, Sección 1.2.6, Ecuaciones 48, 49 y 50.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) declare (n, integer)$
(%i2) assume (n &gt;= 0)$
(%i3) stirling1 (n, n);
(%o3)                           1
</pre></div>

<p>La función <code>stirling1</code> no simplifica en caso de argumentos no enteros,
</p>
<div class="example">
<pre class="example">(%i1) stirling1 (sqrt(2), sqrt(2));
(%o1)              stirling1(sqrt(2), sqrt(2))
</pre></div>

<p>Maxima aplicas algunas identidades a <code>stirling1</code>,
</p>
<div class="example">
<pre class="example">(%i1) declare (n, integer)$
(%i2) assume (n &gt;= 0)$
(%i3) stirling1 (n + 1, n);
                            n (n + 1)
(%o3)                       ---------
                                2
(%i4) stirling1 (n + 1, 1);
(%o4)                          n!
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fstirling2"></span><dl class="def">
<dt id="index-stirling2"><span class="category">Función: </span><span><strong>stirling2</strong> <em>(<var>n</var>, <var>m</var>)</em><a href='#index-stirling2' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Es el número de Stirling de segunda especie.
</p>
<p>Si <var>n</var> y <var>m</var> son enteros no negativos,
<code>stirling2 (<var>n</var>, <var>m</var>)</code> es el número
de formas en las que se puede particionar un conjunto
de cardinal <var>n</var> en <var>m</var> subconjuntos disjuntos.
Maxima utiliza una relación recursiva para definir
<code>stirling2 (<var>n</var>, <var>m</var>)</code> con <var>m</var> menor
que 0; la función no está definida para  <var>n</var>
menor que 0  ni para argumentos no enteros.
</p>
<p>La función <code>stirling2</code> es simplificadora. Maxima
reconoce las siguientes identidades:
</p>
<ol>
<li> <em class='tex2jax_process'>\(stirling2(0, n) = kron_delta(0, n)\)</em> (Ref. [1])
</li><li> <em class='tex2jax_process'>\(stirling2(n, n) = 1\)</em> (Ref. [1])
</li><li> <em class='tex2jax_process'>\(stirling2(n, n - 1) = binomial(n, 2)\)</em> (Ref. [1])
</li><li> <em class='tex2jax_process'>\(stirling2(n + 1, 1) = 1\)</em> (Ref. [1])
</li><li> <em class='tex2jax_process'>\(stirling2(n + 1, 2) = 2^n  - 1\)</em> (Ref. [1])
</li><li> <em class='tex2jax_process'>\(stirling2(n, 0) = kron_delta(n, 0)\)</em> (Ref. [2])
</li><li> <em class='tex2jax_process'>\(stirling2(n, m) = 0\)</em> when <em class='tex2jax_process'>\(m &gt; n\)</em> (Ref. [2])
</li><li> <em class='tex2jax_process'>\(stirling2(n, m) = sum((-1)^(m - k) binomial(m k) k^n,i,1,m) / m!\)</em>
si <em class='tex2jax_process'>\(m\)</em> y <em class='tex2jax_process'>\(n\)</em> son enteros y <em class='tex2jax_process'>\(n\)</em> no negativo. (Ref. [3])
</li></ol>

<p>Estas identidades se aplican cuando los argumentos son enteros
literales o símbolos declarados como enteros y
el primer argumento es no negativo. La función <code>stirling2</code>
no simplifica para argumentos no enteros.
</p>
<p>Referencias:
</p>
<p>[1] Donald Knuth. <i>The Art of Computer Programming</i>,
Tercera Edición, Volumen 1, Sección 1.2.6, Ecuaciones 48, 49 y 50.
</p>
<p>[2] Graham, Knuth y Patashnik. <i>Concrete Mathematics</i>, Tabla 264.
</p>
<p>[3] Abramowitz y Stegun. <i>Handbook of Mathematical Functions</i>, Sección 24.1.4.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) declare (n, integer)$
(%i2) assume (n &gt;= 0)$
(%i3) stirling2 (n, n);
(%o3)                           1
</pre></div>

<p>La función <code>stirling2</code> no simplifica en caso de argumentos no enteros,
</p>
<div class="example">
<pre class="example">(%i1) stirling2 (%pi, %pi);
(%o1)                  stirling2(%pi, %pi)
</pre></div>

<p>Maxima aplicas algunas identidades a <code>stirling2</code>,
</p>
<div class="example">
<pre class="example">(%i1) declare (n, integer)$
(%i2) assume (n &gt;= 0)$
(%i3) stirling2 (n + 9, n + 8);
                         (n + 8) (n + 9)
(%o3)                    ---------------
                                2
(%i4) stirling2 (n + 1, 2);
                              n
(%o4)                        2  - 1
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fsubset"></span><dl class="def">
<dt id="index-subset"><span class="category">Función: </span><span><strong>subset</strong> <em>(<var>a</var>, <var>f</var>)</em><a href='#index-subset' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve el subconjunto del conjunto <var>a</var> que satisface el predicado <var>f</var>.
</p>
<p>La función <code>subset</code> devuelve el conjunto que contiene a los
elementos de <var>a</var> para los cuales <var>f</var> devuelve un resultado
diferente de <code>false</code>. La función <code>subset</code> no aplica
<code>is</code> al valor retornado por <var>f</var>.
</p>
<p>La función <code>subset</code> emite un mensaje de error si <var>a</var>
no es un conjunto literal.
</p>
<p>Véase también <code>partition_set</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) subset ({1, 2, x, x + y, z, x + y + z}, atom);
(%o1)                     {1, 2, x, z}
(%i2) subset ({1, 2, 7, 8, 9, 14}, evenp);
(%o2)                      {2, 8, 14}
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fsubsetp"></span><dl class="def">
<dt id="index-subsetp"><span class="category">Función: </span><span><strong>subsetp</strong> <em>(<var>a</var>, <var>b</var>)</em><a href='#index-subsetp' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve <code>true</code> si y sólo si el conjunto <var>a</var> es un subconjunto de <var>b</var>.
</p>
<p>La función <code>subsetp</code> emite un mensaje de error si
cualesquiera <var>a</var> o <var>b</var> no es un conjunto literal.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) subsetp ({1, 2, 3}, {a, 1, b, 2, c, 3});
(%o1)                         true
(%i2) subsetp ({a, 1, b, 2, c, 3}, {1, 2, 3});
(%o2)                         false
</pre></div>
</dd></dl>



<span id="Item_003a-nset_002ees_002fdeffn_002fsymmdifference"></span><dl class="def">
<dt id="index-symmdifference"><span class="category">Función: </span><span><strong>symmdifference</strong> <em>(<var>a_1</var>, &hellip;, <var>a_n</var>)</em><a href='#index-symmdifference' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve la diferencia simétrica de los conjuntos <code> <var>a_1</var>, &hellip;, <var>a_n</var></code>.
</p>
<p>Dados dos argumentos, <code>symmdifference (<var>a</var>, <var>b</var>)</code> equivale a
<code>union (setdifference (<var>a</var>, <var>b</var>), setdifference (<var>b</var>, <var>a</var>))</code>.
</p>
<p>La función <code>symmdifference</code> emite un mensaje de error si alguno de
su argumentos no es un conjunto literal.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) S_1 : {a, b, c};
(%o1)                       {a, b, c}
(%i2) S_2 : {1, b, c};
(%o2)                       {1, b, c}
(%i3) S_3 : {a, b, z};
(%o3)                       {a, b, z}
(%i4) symmdifference ();
(%o4)                          {}
(%i5) symmdifference (S_1);
(%o5)                       {a, b, c}
(%i6) symmdifference (S_1, S_2);
(%o6)                        {1, a}
(%i7) symmdifference (S_1, S_2, S_3);
(%o7)                       {1, b, z}
(%i8) symmdifference ({}, S_1, S_2, S_3);
(%o8)                       {1,b, z}
</pre></div>
</dd></dl>

<span id="Item_003a-nset_002ees_002fdeffn_002ftree_005freduce"></span><dl class="def">
<dt id="index-tree_005freduce"><span class="category">Función: </span><span><strong>tree_reduce</strong> <em>(<var>F</var>, <var>s</var>)</em><a href='#index-tree_005freduce' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-tree_005freduce-1"><span class="category">Función: </span><span><strong>tree_reduce</strong> <em>(<var>F</var>, <var>s</var>, <var>s_0</var>)</em><a href='#index-tree_005freduce-1' class='copiable-anchor'> &para;</a></span></dt>
<dd>

<p>Amplía la función binaria <var>F</var> a n-aria, siendo <var>s</var> una lista.
</p>
<p>La función <code>tree_reduce</code> equivale a lo suguiente:
Aplicar <var>F</var> a pares sucesivos de elementos para formar
una nueva lista <code>[<var>F</var>(<var>s_1</var>, <var>s_2</var>), <var>F</var>(<var>s_3</var>, <var>s_4</var>), ...]</code>,
llevando el elemento final sin cambiar si el número de elementos es impar;
después repetir hasta que la lista se reduzca a un único elemento,
que es el valor de retorno.
</p>
<p>Cuando está presente el argumento opcional <var>s_0</var>,
el resultado equivale a <code>tree_reduce(<var>F</var>, cons(<var>s_0</var>, <var>s</var>)</code>.
</p>
<p>Para la suma de números decimales en coma flotante,
<code>tree_reduce</code> puede devolver una suma que tenga un error
de redondeo menor que el conseguido por <code>rreduce</code> o <code>lreduce</code>.
</p>
<p>Los elementos de <var>s</var> y los resultados parciales pueden colocarse
en un árbol binario de mínima profundidad, de ahí
el nombre de <i>tree_reduce</i>.
</p>
<p>Ejemplos:
</p>
<p>La función <code>tree_reduce</code> aplicada a una lista con un número
par de elementos,
</p>
<div class="example">
<pre class="example">(%i1) tree_reduce (f, [a, b, c, d]);
(%o1)                  f(f(a, b), f(c, d))
</pre></div>

<p>La función <code>tree_reduce</code> aplicada a una lista con un número
impar de elementos,
</p>
<div class="example">
<pre class="example">(%i1) tree_reduce (f, [a, b, c, d, e]);
(%o1)               f(f(f(a, b), f(c, d)), e)
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002funion"></span><dl class="def">
<dt id="index-union"><span class="category">Function: </span><span><strong>union</strong> <em>(<var>a_1</var>, ..., <var>a_n</var>)</em><a href='#index-union' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve la unión de los conjuntos <var>a_1</var> hasta <var>a_n</var>.
</p>
<p>La sentencia <code>union()</code> (sin argumentos) devuelve el
conjunto vacío.
</p>
<p>La función <code>union</code> emite un mensaje de error si alguno
de sus argumentos no es un conjunto literal.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) S_1 : {a, b, c + d, %e};
(%o1)                   {%e, a, b, d + c}
(%i2) S_2 : {%pi, %i, %e, c + d};
(%o2)                 {%e, %i, %pi, d + c}
(%i3) S_3 : {17, 29, 1729, %pi, %i};
(%o3)                {17, 29, 1729, %i, %pi}
(%i4) union ();
(%o4)                          {}
(%i5) union (S_1);
(%o5)                   {%e, a, b, d + c}
(%i6) union (S_1, S_2);
(%o6)              {%e, %i, %pi, a, b, d + c}
(%i7) union (S_1, S_2, S_3);
(%o7)       {17, 29, 1729, %e, %i, %pi, a, b, d + c}
(%i8) union ({}, S_1, S_2, S_3);
(%o8)       {17, 29, 1729, %e, %i, %pi, a, b, d + c}
</pre></div>
</dd></dl>


<span id="Item_003a-nset_002ees_002fdeffn_002fxreduce"></span><dl class="def">
<dt id="index-xreduce"><span class="category">Función: </span><span><strong>xreduce</strong> <em>(<var>F</var>, <var>s</var>)</em><a href='#index-xreduce' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-xreduce-1"><span class="category">Función: </span><span><strong>xreduce</strong> <em>(<var>F</var>, <var>s</var>, <var>s_0</var>)</em><a href='#index-xreduce-1' class='copiable-anchor'> &para;</a></span></dt>
<dd>


<p>Amplía la función <var>F</var> a n-aria mediante
composición; si <var>F</var> ya es n-aria, aplica <var>F</var> a <var>s</var>.
Si <var>F</var> no es n-aria, <code>xreduce</code> equivale a <code>lreduce</code>.
El argumento <var>s</var> debe ser una lista.
</p>
<p>Funciones n-arias reconocidas por Maxima son la suma <code>+</code>, la
multiplicación <code>*</code>, <code>and</code>, <code>or</code>, <code>max</code>,
<code>min</code> y <code>append</code>. Las funciones también se pueden
declarar n-arias mediante <code>declare(<var>F</var>, nary)</code>;
para estas funciones, <code>xreduce</code> será más rápida que
<code>rreduce</code> o <code>lreduce</code>.
</p>
<p>Cuando está presente el argumento opcional <var>s_0</var>,
el resultado equivale a <code>xreduce(<var>s</var>, cons(<var>s_0</var>, <var>s</var>))</code>.
</p>
<p>La suma de números decimales en coma flotante no es exactamente asociativa;
aún así, <code>xreduce</code> aplica la suma n-aria cuando <var>s</var>
contiene números en coma flotante.
</p>
<p>Ejemplos:
</p>
<p>La función <code>xreduce</code> aplicada a una función n-aria;
<code>F</code> es invocada una sóla vez, con todos sus argumentos,
</p>
<div class="example">
<pre class="example">(%i1) declare (F, nary);
(%o1)                         done
(%i2) F ([L]) := L;
(%o2)                      F([L]) := L
(%i3) xreduce (F, [a, b, c, d, e]);
(%o3)         [[[[[(&quot;[&quot;, simp), a], b], c], d], e]
</pre></div>

<p>La función <code>xreduce</code> aplicada a una función que se desconoce si
es n-aria; <code>G</code> es invocada varias veces, con dos argumentos de cada vez,
</p>
<div class="example">
<pre class="example">(%i1) G ([L]) := L;
(%o1)                      G([L]) := L
(%i2) xreduce (G, [a, b, c, d, e]);
(%o2)         [[[[[(&quot;[&quot;, simp), a], b], c], d], e]
(%i3) lreduce (G, [a, b, c, d, e]);
(%o3)                 [[[[a, b], c], d], e]
</pre></div>
</dd></dl>









</div>
<hr>
<div class="header">
<p>
Anterior: <a href="maxima_155.html" accesskey="p" rel="prev">Introducción a los conjuntos</a>, Subir: <a href="maxima_154.html" accesskey="u" rel="up">Conjuntos</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Índice general" rel="contents">Índice general</a>][<a href="maxima_304.html" title="Índice" rel="index">Índice</a>]</p>
</div>


<a href='js_licenses.html' rel='jslicense'><small>Información de licencia de JavaScript</small></a>
</body>
</html>
