<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 5.1, http://www.gnu.org/software/texinfo/ -->
<head>
<title>Manual de Maxima 5.46.0: Funciones y variables para interpol</title>

<meta name="description" content="Manual de Maxima 5.46.0: Funciones y variables para interpol">
<meta name="keywords" content="Manual de Maxima 5.46.0: Funciones y variables para interpol">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="maxima_toc.html#Top" rel="start" title="Top">
<link href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" rel="index" title="Índice de Funciones y Variables">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="&Iacute;ndice General">
<link href="maxima_235.html#interpol" rel="up" title="interpol">
<link href="maxima_238.html#lapack" rel="next" title="lapack">
<link href="maxima_236.html#Introducci_00f3n-a-interpol" rel="previous" title="Introducción a interpol">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
blockquote.smallquotation {font-size: smaller}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
div.indentedblock {margin-left: 3.2em}
div.lisp {margin-left: 3.2em}
div.smalldisplay {margin-left: 3.2em}
div.smallexample {margin-left: 3.2em}
div.smallindentedblock {margin-left: 3.2em; font-size: smaller}
div.smalllisp {margin-left: 3.2em}
kbd {font-style:oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: inherit; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: inherit; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.nocodebreak {white-space:nowrap}
span.nolinebreak {white-space:nowrap}
span.roman {font-family:serif; font-weight:normal}
span.sansserif {font-family:sans-serif; font-weight:normal}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="figures/favicon.ico">

</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">
<a name="Funciones-y-variables-para-interpol"></a>
<div class="header">
<p>
Previous: <a href="maxima_236.html#Introducci_00f3n-a-interpol" accesskey="p" rel="previous">Introducción a interpol</a>, Subir: <a href="maxima_235.html#interpol" accesskey="u" rel="up">interpol</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="&Iacute;ndice general" rel="contents">&Iacute;ndice general</a>][<a href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" title="&Iacute;ndice" rel="index">&Iacute;ndice</a>]</p>
</div>
<a name="Funciones-y-variables-para-interpol-1"></a>
<h3 class="section">58.2 Funciones y variables para interpol</h3>


<a name="Item_003a-interpol_002fdeffn_002flagrange"></a><dl>
<dt><a name="index-lagrange"></a>Función: <strong>lagrange</strong> <em>(<var>points</var>)</em></dt>
<dt><a name="index-lagrange-1"></a>Función: <strong>lagrange</strong> <em>(<var>points</var>, <var>option</var>)</em></dt>
<dd><p>Calcula el polinomio de interpolación por el método de Lagrange. El argumento <var>points</var> debe ser:
</p>
<ul>
<li> una matriz de dos columnas, <code>p:matrix([2,4],[5,6],[9,3])</code>,
</li><li> una lista de pares de números, <code>p: [[2,4],[5,6],[9,3]]</code>,
</li><li> una lista de números, <code>p: [4,6,3]</code>, en cuyo caso las abscisas se asignarán automáticamente a 1, 2, 3, etc.
</li></ul>

<p>En los dos primeros casos los pares se ordenan con respecto a la primera coordenada antes de proceder a los cálculos.
</p>
<p>Mediante el argumento <var>option</var> es posible seleccionar el nombre de la variable independiente, que por defecto es <code>'x</code>; para definir otra, escríbase algo como <code>varname='z</code>.
</p>
<p>Téngase en cuenta que cuando se trabaja con polinomios de grado alto, los
cálculos con números decimales en coma flotante pueden ser muy inestables.
</p>
<p>Véanse también <code>linearinterpol</code>, <code>cspline</code> y <code>ratinterpol</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;interpol&quot;)$
(%i2) p:[[7,2],[8,2],[1,5],[3,2],[6,7]]$
(%i3) lagrange(p);
       (x - 7) (x - 6) (x - 3) (x - 1)
(%o3)  -------------------------------
                     35
   (x - 8) (x - 6) (x - 3) (x - 1)
 - -------------------------------
                 12
   7 (x - 8) (x - 7) (x - 3) (x - 1)
 + ---------------------------------
                  30
   (x - 8) (x - 7) (x - 6) (x - 1)
 - -------------------------------
                 60
   (x - 8) (x - 7) (x - 6) (x - 3)
 + -------------------------------
                 84
(%i4) f(x):=''%;
               (x - 7) (x - 6) (x - 3) (x - 1)
(%o4)  f(x) := -------------------------------
                             35
   (x - 8) (x - 6) (x - 3) (x - 1)
 - -------------------------------
                 12
   7 (x - 8) (x - 7) (x - 3) (x - 1)
 + ---------------------------------
                  30
   (x - 8) (x - 7) (x - 6) (x - 1)
 - -------------------------------
                 60
   (x - 8) (x - 7) (x - 6) (x - 3)
 + -------------------------------
                 84
(%i5) /* Evaluate the polynomial at some points */
      expand(map(f,[2.3,5/7,%pi]));
                                  4          3           2
                    919062  73 %pi    701 %pi    8957 %pi
(%o5)  [- 1.567535, ------, ------- - -------- + ---------
                    84035     420       210         420
                                             5288 %pi   186
                                           - -------- + ---]
                                               105       5
(%i6) %,numer;
(%o6) [- 1.567535, 10.9366573451538, 2.89319655125692]
(%i7) load(&quot;draw&quot;)$  /* load draw package */
(%i8) /* Plot the polynomial together with points */
      draw2d(
        color      = red,
        key        = &quot;Lagrange polynomial&quot;,
        explicit(f(x),x,0,10),
        point_size = 3,
        color      = blue,
        key        = &quot;Sample points&quot;,
        points(p))$
(%i9) /* Change variable name */
      lagrange(p, varname=w);
       (w - 7) (w - 6) (w - 3) (w - 1)
(%o9)  -------------------------------
                     35
   (w - 8) (w - 6) (w - 3) (w - 1)
 - -------------------------------
                 12
   7 (w - 8) (w - 7) (w - 3) (w - 1)
 + ---------------------------------
                  30
   (w - 8) (w - 7) (w - 6) (w - 1)
 - -------------------------------
                 60
   (w - 8) (w - 7) (w - 6) (w - 3)
 + -------------------------------
                 84
</pre></div>

</dd></dl>


<a name="Item_003a-interpol_002fdeffn_002fcharfun2"></a><dl>
<dt><a name="index-charfun2"></a>Función: <strong>charfun2</strong> <em>(<var>x</var>, <var>a</var>, <var>b</var>)</em></dt>
<dd><p>Devuelve <code>true</code> si el número <var>x</var> pertenece al intervalo <em>[a, b)</em>, y <code>false</code> en caso contrario.
</p></dd></dl>


<a name="Item_003a-interpol_002fdeffn_002flinearinterpol"></a><dl>
<dt><a name="index-linearinterpol"></a>Función: <strong>linearinterpol</strong> <em>(<var>points</var>)</em></dt>
<dt><a name="index-linearinterpol-1"></a>Función: <strong>linearinterpol</strong> <em>(<var>points</var>, <var>option</var>)</em></dt>
<dd><p>Calcula rectas de interpolación. El argumento <var>points</var> debe ser:
</p>
<ul>
<li> una matriz de dos columnas, <code>p:matrix([2,4],[5,6],[9,3])</code>,
</li><li> una lista de pares de números, <code>p: [[2,4],[5,6],[9,3]]</code>,
</li><li> una lista de números, <code>p: [4,6,3]</code>, en cuyo caso las abscisas se asignarán automáticamente a 1, 2, 3, etc.
</li></ul>

<p>En los dos primeros casos los pares se ordenan con respecto a la primera coordenada antes de proceder a los cálculos.
</p>
<p>Mediante el argumento <var>option</var> es posible seleccionar el nombre de la variable independiente, que por defecto es <code>'x</code>; para definir otra, escríbase algo como <code>varname='z</code>.
</p>
<p>Véanse también <code>lagrange</code>, <code>cspline</code> y <code>ratinterpol</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;interpol&quot;)$
(%i2) p: matrix([7,2],[8,3],[1,5],[3,2],[6,7])$
(%i3) linearinterpol(p);
        13   3 x
(%o3)  (-- - ---) charfun2(x, minf, 3)
        2     2
 + (x - 5) charfun2(x, 7, inf) + (37 - 5 x) charfun2(x, 6, 7)
    5 x
 + (--- - 3) charfun2(x, 3, 6)
     3

(%i4) f(x):=''%;
                13   3 x
(%o4)  f(x) := (-- - ---) charfun2(x, minf, 3)
                2     2
 + (x - 5) charfun2(x, 7, inf) + (37 - 5 x) charfun2(x, 6, 7)
    5 x
 + (--- - 3) charfun2(x, 3, 6)
     3
(%i5)  /* Evaluate the polynomial at some points */
       map(f,[7.3,25/7,%pi]);
                            62  5 %pi
(%o5)                 [2.3, --, ----- - 3]
                            21    3
(%i6) %,numer;
(%o6)  [2.3, 2.952380952380953, 2.235987755982989]
(%i7) load(&quot;draw&quot;)$  /* load draw package */
(%i8)  /* Plot the polynomial together with points */
       draw2d(
         color      = red,
         key        = &quot;Linear interpolator&quot;,
         explicit(f(x),x,-5,20),
         point_size = 3,
         color      = blue,
         key        = &quot;Sample points&quot;,
         points(args(p)))$
(%i9)  /* Change variable name */
       linearinterpol(p, varname='s);
       13   3 s
(%o9) (-- - ---) charfun2(s, minf, 3)
       2     2
 + (s - 5) charfun2(s, 7, inf) + (37 - 5 s) charfun2(s, 6, 7)
    5 s
 + (--- - 3) charfun2(s, 3, 6)
     3
</pre></div>

</dd></dl>



<a name="Item_003a-interpol_002fdeffn_002fcspline"></a><dl>
<dt><a name="index-cspline"></a>Función: <strong>cspline</strong> <em>(<var>points</var>)</em></dt>
<dt><a name="index-cspline-1"></a>Función: <strong>cspline</strong> <em>(<var>points</var>, <var>option1</var>, <var>option2</var>, ...)</em></dt>
<dd><p>Calcula el polinomio de interpolación por el método de los <i>splines</i> cúbicos. El argumento <var>points</var> debe ser:
</p>
<ul>
<li> una matriz de dos columnas, <code>p:matrix([2,4],[5,6],[9,3])</code>,
</li><li> una lista de pares de números, <code>p: [[2,4],[5,6],[9,3]]</code>,
</li><li> una lista de números, <code>p: [4,6,3]</code>, en cuyo caso las abscisas se asignarán automáticamente a 1, 2, 3, etc.
</li></ul>

<p>En los dos primeros casos los pares se ordenan con respecto a la primera coordenada antes de proceder a los cálculos.
</p>
<p>Esta función dispone de tres opciones para acomodarse a necesidades concretas:
</p>
<ul>
<li> <code>'d1</code>, por defecto <code>'unknown</code>, es la primera derivada en <em>x_1</em>; si toma el valor <code>'unknown</code>, la segunda derivada en <em>x_1</em> se iguala a 0 (<i>spline</i> cúbico natural); en caso de tomar un valor numérico, la segunda derivada se calcula en base a este número.

</li><li> <code>'dn</code>, por defecto <code>'unknown</code>, es la primera derivada en <em>x_n</em>; si toma el valor <code>'unknown</code>, la segunda derivada en <em>x_n</em> se iguala a 0 (<i>spline</i> cúbico natural); en caso de tomar un valor numérico, la segunda derivada se calcula en base a este número.

</li><li> <code>'varname</code>, por defecto <code>'x</code>, es el nombre de la variable independiente.
</li></ul>

<p>Véanse también <code>lagrange</code>, <code>linearinterpol</code> y <code>ratinterpol</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;interpol&quot;)$
(%i2) p:[[7,2],[8,2],[1,5],[3,2],[6,7]]$
(%i3) /* Unknown first derivatives at the extremes
         is equivalent to natural cubic splines */
      cspline(p);
              3         2
        1159 x    1159 x    6091 x   8283
(%o3)  (------- - ------- - ------ + ----) charfun2(x, minf, 3)
         3288      1096      3288    1096
            3         2
      2587 x    5174 x    494117 x   108928
 + (- ------- + ------- - -------- + ------) charfun2(x, 7, inf)
       1644       137       1644      137
          3          2
    4715 x    15209 x    579277 x   199575
 + (------- - -------- + -------- - ------) charfun2(x, 6, 7)
     1644       274        1644      274
            3         2
      3287 x    2223 x    48275 x   9609
 + (- ------- + ------- - ------- + ----) charfun2(x, 3, 6)
       4932       274      1644     274

(%i4) f(x):=''%$
(%i5) /* Some evaluations */
      map(f,[2.3,5/7,%pi]), numer;
(%o5) [1.991460766423356, 5.823200187269903, 2.227405312429507]
(%i6) load(&quot;draw&quot;)$  /* load draw package */
(%i7) /* Plotting interpolating function */
      draw2d(
        color      = red,
        key        = &quot;Cubic splines&quot;,
        explicit(f(x),x,0,10),
        point_size = 3,
        color      = blue,
        key        = &quot;Sample points&quot;,
        points(p))$
(%i8) /* New call, but giving values at the derivatives */
      cspline(p,d1=0,dn=0);
              3          2
        1949 x    11437 x    17027 x   1247
(%o8)  (------- - -------- + ------- + ----) charfun2(x, minf, 3)
         2256       2256      2256     752
            3          2
      1547 x    35581 x    68068 x   173546
 + (- ------- + -------- - ------- + ------) charfun2(x, 7, inf)
        564       564        141      141
         3          2
    607 x    35147 x    55706 x   38420
 + (------ - -------- + ------- - -----) charfun2(x, 6, 7)
     188       564        141      47
            3         2
      3895 x    1807 x    5146 x   2148
 + (- ------- + ------- - ------ + ----) charfun2(x, 3, 6)
       5076       188      141      47
(%i8) /* Defining new interpolating function */
      g(x):=''%$
(%i9) /* Plotting both functions together */
      draw2d(
        color      = black,
        key        = &quot;Cubic splines (default)&quot;,
        explicit(f(x),x,0,10),
        color      = red,
        key        = &quot;Cubic splines (d1=0,dn=0)&quot;,
        explicit(g(x),x,0,10),
        point_size = 3,
        color      = blue,
        key        = &quot;Sample points&quot;,
        points(p))$
</pre></div>
</dd></dl>


<a name="Item_003a-interpol_002fdeffn_002fratinterpol"></a><dl>
<dt><a name="index-ratinterpol"></a>Función: <strong>ratinterpol</strong> <em>(<var>points</var>, <var>numdeg</var>)</em></dt>
<dt><a name="index-ratinterpol-1"></a>Función: <strong>ratinterpol</strong> <em>(<var>points</var>, <var>numdeg</var>, <var>option1</var>)</em></dt>
<dd><p>Genera el interpolador racional para los datos dados por <var>points</var> y con
grado <var>numdeg</var> en el numerador; el grado del denominador se calcula
automáticamente. El argumento <var>points</var> debe ser:
</p>
<ul>
<li> una matriz de dos columnas, <code>p:matrix([2,4],[5,6],[9,3])</code>,
</li><li> una lista de pares de números, <code>p: [[2,4],[5,6],[9,3]]</code>,
</li><li> una lista de números, <code>p: [4,6,3]</code>, en cuyo caso las abscisas se asignarán automáticamente a 1, 2, 3, etc.
</li></ul>

<p>En los dos primeros casos los pares se ordenan con respecto a la primera coordenada antes de proceder a los cálculos.
</p>
<p>Esta función dispone de una opción para acomodarse a necesidades concretas:
</p><ul>
<li> <code>'varname</code>, por defecto <code>'x</code>, es el nombre de la variable independiente.
</li></ul>

<p>Véanse también <code>lagrange</code>, <code>linearinterpol</code>, <code>cspline</code>, <code>minpack_lsquares</code> y <code>lbfgs</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;interpol&quot;)$
(%i2) load(&quot;draw&quot;)$
(%i3) p:[[7.2,2.5],[8.5,2.1],[1.6,5.1],[3.4,2.4],[6.7,7.9]]$
(%i4) for k:0 thru length(p)-1 do                                     
        draw2d(
          explicit(ratinterpol(p,k),x,0,9),                      
          point_size = 3,                                        
          points(p),                                             
          title = concat(&quot;Grado del numerador = &quot;,k),            
          yrange=[0,10])$
</pre></div>
</dd></dl>


<hr>
<div class="header">
<p>
Previous: <a href="maxima_236.html#Introducci_00f3n-a-interpol" accesskey="p" rel="previous">Introducción a interpol</a>, Subir: <a href="maxima_235.html#interpol" accesskey="u" rel="up">interpol</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="&Iacute;ndice general" rel="contents">&Iacute;ndice general</a>][<a href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" title="&Iacute;ndice" rel="index">&Iacute;ndice</a>]</p>
</div>



</body>
</html>
