<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 5.1, http://www.gnu.org/software/texinfo/ -->
<head>
<title>Manual de Maxima 5.46.0: Funciones y variables para draw</title>

<meta name="description" content="Manual de Maxima 5.46.0: Funciones y variables para draw">
<meta name="keywords" content="Manual de Maxima 5.46.0: Funciones y variables para draw">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="maxima_toc.html#Top" rel="start" title="Top">
<link href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" rel="index" title="Índice de Funciones y Variables">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="&Iacute;ndice General">
<link href="maxima_198.html#draw" rel="up" title="draw">
<link href="maxima_201.html#Funciones-y-variables-para-picture" rel="next" title="Funciones y variables para picture">
<link href="maxima_199.html#Introducci_00f3n-a-draw" rel="previous" title="Introducción a draw">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
blockquote.smallquotation {font-size: smaller}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
div.indentedblock {margin-left: 3.2em}
div.lisp {margin-left: 3.2em}
div.smalldisplay {margin-left: 3.2em}
div.smallexample {margin-left: 3.2em}
div.smallindentedblock {margin-left: 3.2em; font-size: smaller}
div.smalllisp {margin-left: 3.2em}
kbd {font-style:oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: inherit; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: inherit; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.nocodebreak {white-space:nowrap}
span.nolinebreak {white-space:nowrap}
span.roman {font-family:serif; font-weight:normal}
span.sansserif {font-family:sans-serif; font-weight:normal}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="figures/favicon.ico">

</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">
<a name="Funciones-y-variables-para-draw"></a>
<div class="header">
<p>
Siguiente: <a href="maxima_201.html#Funciones-y-variables-para-picture" accesskey="n" rel="next">Funciones y variables para picture</a>, Previous: <a href="maxima_199.html#Introducci_00f3n-a-draw" accesskey="p" rel="previous">Introducción a draw</a>, Subir: <a href="maxima_198.html#draw" accesskey="u" rel="up">draw</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="&Iacute;ndice general" rel="contents">&Iacute;ndice general</a>][<a href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" title="&Iacute;ndice" rel="index">&Iacute;ndice</a>]</p>
</div>
<a name="Funciones-y-variables-para-draw-1"></a>
<h3 class="section">47.2 Funciones y variables para draw</h3>



<a name="Escenas"></a>
<h4 class="subsection">47.2.1 Escenas</h4>



<a name="Item_003a-draw_002fdeffn_002fgr2d"></a><dl>
<dt><a name="index-gr2d"></a>Constructor de escena: <strong>gr2d</strong> <em>(<var>Opción gráfica</var>, ..., <var>graphic_object</var>, ...)</em></dt>
<dd>
<p>La función <code>gr2d</code> construye un objeto que describe una escena 2d. Los
argumentos son <i>opciones gráficas</i> y <i>objetos gráficos</i>
o listas que contengan elementos de ambos tipos. Esta escena
se interpreta secuencialmente: las <i>opciones gráficas</i> afectan a aquellos
<i>objetos gráficos</i> colocados a su derecha. Algunas <i>opciones gráficas</i>
afectan al aspecto global de la escena.
</p>
<p>La lista de <i>objetos gráficos</i> disponibles para escenas en dos
dimensiones: <code>bars</code>, <code>ellipse</code>, <code>explicit</code>, <code>image</code>,
<code>implicit</code>, <code>label</code>, <code>parametric</code>, <code>points</code>, <code>polar</code>,
<code>polygon</code>, <code>quadrilateral</code>, <code>rectangle</code>, <code>triangle</code>,
<code>vector</code> y <code>geomap</code> (este último definido en el paquete <code>worldmap</code>).
</p>
<p>Véanse también <code>draw</code> y <code>draw2d</code>.
</p>
<p>Para utilizar este objecto, ejecútese primero <code>load(&quot;draw&quot;)</code>.
</p></dd></dl>


<a name="Item_003a-draw_002fdeffn_002fgr3d"></a><dl>
<dt><a name="index-gr3d"></a>Constructor de escena: <strong>gr3d</strong> <em>(<var>Opción gráfica</var>, ..., <var>graphic_object</var>, ...)</em></dt>
<dd>
<p>La función <code>gr3d</code> construye un objeto que describe una escena 3d. Los
argumentos son <i>opciones gráficas</i> y <i>objetos gráficos</i>
o listas que contengan elementos de ambos tipos. Esta escena
se interpreta secuencialmente: las <i>opciones gráficas</i> afectan a aquellos
<i>objetos gráficos</i> colocados a su derecha. Algunas <i>opciones gráficas</i>
afectan al aspecto global de la escena.
</p>
<p>La lista de <i>objetos gráficos</i> disponibles para escenas en tres
dimensiones: <code>cylindrical</code>, <code>elevation_grid</code>, <code>explicit</code>, 
<code>implicit</code>, <code>label</code>, <code>mesh</code>, <code>parametric</code>, 
<code>parametric_surface</code>, <code>points</code>, <code>quadrilateral</code>, 
<code>spherical</code>, <code>triangle</code>, <code>tube</code>, <code>vector</code>
y <code>geomap</code> (este último definido en el paquete <code>worldmap</code>).
</p>
<p>Véanse también <code>draw</code> y <code>draw3d</code>.
</p>
<p>Para utilizar este objeto, ejecútese primero <code>load(&quot;draw&quot;)</code>.
</p></dd></dl>





<a name="Funciones-2"></a>
<h4 class="subsection">47.2.2 Funciones</h4>




<a name="Item_003a-draw_002fdeffn_002fdraw"></a><dl>
<dt><a name="index-draw"></a>Función: <strong>draw</strong> <em>(<var>gr2d</var>, ..., <var>gr3d</var>, ..., <var>options</var>, ...)</em></dt>
<dd>
<p>Representa gráficamente una serie de escenas; sus argumentos son objetos
<code>gr2d</code> y/o <code>gr3d</code>, junto con algunas opciones, o listas de escenas y opciones.
Por defecto, las escenas se representan en una columna.
</p>
<p>La función <code>draw</code> acepta las siguientes opciones globales: <code>terminal</code>,
<code>columns</code>, <code>dimensions</code>, <code>file_name</code> y <code>delay</code>.
</p>
<p>Las funciones <code>draw2d</code> y <code>draw3d</code> son atajos a utilizar
cuando se quiere representar una única escena en dos o tres
dimensiones, respectivamente.
</p>
<p>Véanse también <code>gr2d</code> y <code>gr3d</code>.
</p>
<p>Para utilizar esta función, ejecútese primero <code>load(&quot;draw&quot;)</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) scene1: gr2d(title=&quot;Ellipse&quot;,
                   nticks=30,
                   parametric(2*cos(t),5*sin(t),t,0,2*%pi))$
(%i3) scene2: gr2d(title=&quot;Triangle&quot;,
                   polygon([4,5,7],[6,4,2]))$
(%i4) draw(scene1, scene2, columns = 2)$
</pre></div>

<p>Las dos sentencias gráficas siguientes son equivalentes:
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw(gr3d(explicit(x^2+y^2,x,-1,1,y,-1,1)));
(%o2)                          [gr3d(explicit)]
(%i3) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1));
(%o3)                          [gr3d(explicit)]
</pre></div>

<p>Un fichero gif animado:
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw(
        delay     = 100,
        file_name = &quot;zzz&quot;,
        terminal  = 'animated_gif,
        gr2d(explicit(x^2,x,-1,1)),
        gr2d(explicit(x^3,x,-1,1)),
        gr2d(explicit(x^4,x,-1,1)));
End of animation sequence
(%o2)          [gr2d(explicit), gr2d(explicit), gr2d(explicit)]
</pre></div>

<p>Véanse también <code>gr2d</code>, <code>gr3d</code>, <code>draw2d</code> y <code>draw3d</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdeffn_002fdraw2d"></a><dl>
<dt><a name="index-draw2d"></a>Función: <strong>draw2d</strong> <em>(<var>option</var>, <var>graphic_object</var>, ...)</em></dt>
<dd>
<p>Esta función es un atajo para
<code>draw(gr2d(<var>options</var>, ..., <var>graphic_object</var>, ...))</code>.
</p>
<p>Puede utilizarse para representar una única escena en 2d.
</p>
<p>Para utilizar esta función, ejecútese primero <code>load(&quot;draw&quot;)</code>.
</p>
<p>Véanse también <code>draw</code> y <code>gr2d</code>.
</p></dd></dl>


<a name="Item_003a-draw_002fdeffn_002fdraw3d"></a><dl>
<dt><a name="index-draw3d"></a>Función: <strong>draw3d</strong> <em>(<var>option</var>, <var>graphic_object</var>, ...)</em></dt>
<dd>
<p>Esta función es un atajo para
<code>draw(gr3d(<var>options</var>, ..., <var>graphic_object</var>, ...))</code>.
</p>
<p>Puede utilizarse para representar una única escena en 3d.
</p>
<p>Para utilizar esta función, ejecútese primero <code>load(&quot;draw&quot;)</code>.
</p>
<p>Véanse también <code>draw</code> y <code>gr3d</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdeffn_002fdraw_005ffile"></a><dl>
<dt><a name="index-draw_005ffile"></a>Función: <strong>draw_file</strong> <em>(<var>Opción gráfica</var>, ..., <var>Opción gráfica</var>, ...)</em></dt>
<dd>
<p>Almacena el gráfico actual en un fichero. Las opciones gráficas que
acepta son: <code>terminal</code>, <code>dimensions</code> y<code>file_name</code>. 
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) /* dibujo en pantalla */
      draw(gr3d(explicit(x^2+y^2,x,-1,1,y,-1,1)))$
(%i3) /* same plot in eps format */
      draw_file(terminal  = eps,
                dimensions = [5,5]) $
</pre></div>
</dd></dl>




<a name="Item_003a-draw_002fdeffn_002fmultiplot_005fmode"></a><dl>
<dt><a name="index-multiplot_005fmode"></a>Función: <strong>multiplot_mode</strong> <em>(<var>term</var>)</em></dt>
<dd>
<p>Esta función permite a Maxima trabajar en modo de gráficos múltiples en
una sola ventana del terminal <var>term</var>; argumentos válidos para esta función 
son <code>screen</code>, <code>wxt</code>, <code>aquaterm</code> y <code>none</code>.
</p>
<p>Cuando el modo de gráficos múltiples está activo, cada llamada a <code>draw</code>
envía un nuevo gr&rsquo;afico a la misma ventana, sin borrar los anteriores.
Para desactivar el modo de gráficos múltiples escríbase
<code>multiplot_mode(none)</code>.
</p>
<p>Cuando el modo de gráficos múltiples está activo, la opción global <code>terminal</code> 
se bloquea; para desbloquearla y cambiar de terminal es necesario desactivar 
previamente el modo de gráficos múltiples.
</p>
<p>Este modo de trabajo no funciona en plataformas Windows.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) set_draw_defaults(
         xrange = [-1,1],
         yrange = [-1,1],
         grid   = true,
         title  = &quot;Step by step plot&quot; )$
(%i3) multiplot_mode(screen)$
(%i4) draw2d(color=blue,  explicit(x^2,x,-1,1))$
(%i5) draw2d(color=red,   explicit(x^3,x,-1,1))$
(%i6) draw2d(color=brown, explicit(x^4,x,-1,1))$
(%i7) multiplot_mode(none)$
</pre></div>
</dd></dl>




<a name="Item_003a-draw_002fdeffn_002fset_005fdraw_005fdefaults"></a><dl>
<dt><a name="index-set_005fdraw_005fdefaults"></a>Función: <strong>set_draw_defaults</strong> <em>(<var>Opción gráfica</var>, ..., <var>Opción gráfica</var>, ...)</em></dt>
<dd>
<p>Establece las opciones gráficas de usuario. Esta función es útil 
para dibujar varios gráficos con las mismas opciones. Llamando
a la función sin argumentos se borran las opciones de usuario por defecto.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) set_draw_defaults(
         xrange = [-10,10],
         yrange = [-2, 2],
         color  = blue,
         grid   = true)$
(%i3) /* dibujo con opciones de usuario */
      draw2d(explicit(((1+x)**2/(1+x*x))-1,x,-10,10))$
(%i4) set_draw_defaults()$
(%i5) /* dibujo con opciones por defecto */
      draw2d(explicit(((1+x)**2/(1+x*x))-1,x,-10,10))$
</pre></div>

<p>Para utilizar esta función, ejecútese primero <code>load(&quot;draw&quot;)</code>.
</p></dd></dl>





<a name="Opciones-graficas-1"></a>
<h4 class="subsection">47.2.3 Opciones gráficas</h4>





<a name="Item_003a-draw_002fdefvr_002fadapt_005fdepth"></a><dl>
<dt><a name="index-adapt_005fdepth-1"></a>Opción gráfica: <strong>adapt_depth</strong></dt>
<dd><p>Valor por defecto: 10
</p>
<p><code>adapt_depth</code> es el número máximo de particiones utilizadas por
la rutina gráfica adaptativa.
</p>
<p>Esta opción sólo es relevante para funciones de tipo <code>explicit</code> en 2d.
</p></dd></dl>


<a name="Item_003a-draw_002fdefvr_002fallocation"></a><dl>
<dt><a name="index-allocation"></a>Opción gráfica: <strong>allocation</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Con la opción <code>allocation</code> es posible colocar a voluntad una escena en la
ventana de salida, lo cual resulta de utilidad en el caso de gráficos 
múltiples. Cuando la opción toma el valor <code>false</code>, la escena se coloca
de forma automática, dependiendo del valor asignado a la opción <code>columns</code>.
En cualquier otro caso, a <code>allocation</code> se le debe asignar una lista con dos
pares de números; el primero se corresponde con la posición de la esquina
inferior izquierda del gráfico y el segundo par hace referencia al ancho y alto
de la escena. Todas las cantidades deben darse en coordenadas relativas, entre
0 y 1.
</p>
<p>Ejemplos:
</p>
<p>Gráficos internos.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw(
        gr2d(
          explicit(x^2,x,-1,1)),
        gr2d(
          allocation = [[1/4, 1/4],[1/2, 1/2]],
          explicit(x^3,x,-1,1),
          grid = true) ) $
</pre></div>

<p>Multiplot con dimensiones establecidas por el usuario.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw(
        terminal = wxt,
        gr2d(
          allocation = [[0, 0],[1, 1/4]],
          explicit(x^2,x,-1,1)),
        gr3d(
          allocation = [[0, 1/4],[1, 3/4]],
          explicit(x^2+y^2,x,-1,1,y,-1,1) ))$
</pre></div>

<p>Véase también la opción <code>columns</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002faxis_005f3d"></a><dl>
<dt><a name="index-axis_005f3d"></a>Opción gráfica: <strong>axis_3d</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_3d</code> vale <code>true</code>, los ejes <var>x</var>, <var>y</var> y <var>z</var>
permanecen visibles en las escenas 3d.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(axis_3d = false,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre></div>

<p>Véanse también <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_top</code> y <code>axis_right</code> for axis in 2d.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002faxis_005fbottom"></a><dl>
<dt><a name="index-axis_005fbottom"></a>Opción gráfica: <strong>axis_bottom</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_bottom</code> vale <code>true</code>, el eje inferior permanece visible en las escenas 2d.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(axis_bottom = false,
             explicit(x^3,x,-1,1))$
</pre></div>

<p>Véanse también <code>axis_left</code>,  <code>axis_top</code>, <code>axis_right</code> y <code>axis_3d</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002faxis_005fleft"></a><dl>
<dt><a name="index-axis_005fleft"></a>Opción gráfica: <strong>axis_left</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_left</code> vale <code>true</code>, el eje izquierdo permanece visible en las escenas 2d.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(axis_left = false,
             explicit(x^3,x,-1,1))$
</pre></div>

<p>Véanse también <code>axis_bottom</code>,  <code>axis_top</code>, <code>axis_right</code> y <code>axis_3d</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002faxis_005fright"></a><dl>
<dt><a name="index-axis_005fright"></a>Opción gráfica: <strong>axis_right</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_right</code> vale <code>true</code>, el eje derecho permanece visible en las escenas 2d.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(axis_right = false,
             explicit(x^3,x,-1,1))$
</pre></div>

<p>Véanse también <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_top</code> y <code>axis_3d</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002faxis_005ftop"></a><dl>
<dt><a name="index-axis_005ftop"></a>Opción gráfica: <strong>axis_top</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_top</code> vale <code>true</code>, el eje superior permanece visible en las escenas 2d.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(axis_top = false,
             explicit(x^3,x,-1,1))$
</pre></div>

<p>Véanse también <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_right</code> y <code>axis_3d</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fbackground_005fcolor"></a><dl>
<dt><a name="index-background_005fcolor"></a>Opción gráfica: <strong>background_color</strong></dt>
<dd><p>Valor por defecto: <code>white</code>
</p>
<p>Establece el color de fondo en los terminales <code>gif</code>, <code>png</code>, <code>jpg</code>
y <code>gif</code>. El color de fondo por defecto es blanco.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Esta opción no es compatible con los terminales <code>epslatex</code> y <code>epslatex_standalone</code>.
</p>
<p>Véase también <code>color</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fborder"></a><dl>
<dt><a name="index-border"></a>Opción gráfica: <strong>border</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>border</code> vale <code>true</code>, los bordes de los
polígonos se dibujan de acuerdo con <code>line_type</code> y
<code>line_width</code>.
</p>
<p>Esta opción afecta a los siguientes objetos gráficos:
</p><ul>
<li> <code>gr2d</code>: <code>polygon</code>, <code>rectangle</code> y <code>ellipse</code>.
</li></ul>

<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(color       = brown,
             line_width  = 8,
             polygon([[3,2],[7,2],[5,5]]),
             border      = false,
             fill_color  = blue,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre></div>
</dd></dl>




<a name="Item_003a-draw_002fdefvr_002fcapping"></a><dl>
<dt><a name="index-capping"></a>Opción gráfica: <strong>capping</strong></dt>
<dd><p>Valor por defecto: <code>[false, false]</code>
</p>
<p>Una lista de dos elementos, <code>true</code> y <code>false</code>,
indicando si los extremos de un objeto gráfico <code>tube</code>
permanece abiertos o si deben ser cerrados. Por defecto, ambos
extremos se dejan abiertos.
</p>
<p>La asignación <code>capping = false</code> equivale a <code>capping = [false, false]</code>
y <code>capping = true</code> equivale a <code>capping = [true, true]</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
        capping = [false, true],
        tube(0, 0, a, 1,
             a, 0, 8) )$
</pre></div>

</dd></dl>



<a name="Item_003a-draw_002fdefvr_002fcbrange"></a><dl>
<dt><a name="index-cbrange"></a>Opción gráfica: <strong>cbrange</strong></dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Cuando <code>cbrange</code> vale <code>auto</code>, el rango de los valores que se
colorean cuando <code>enhanced3d</code> es diferente de <code>false</code> se calcula
automáticamente. Valores fuera del rango utilizan el color del valor
extremo más cercano.
</p>
<p>Cuando <code>enhanced3d</code> o <code>colorbox</code> vale <code>false</code>, la 
opción <code>cbrange</code> no tiene efecto alguno.
</p>
<p>Si el usuario quiere especificar un intervalo para los valores a colorear,
éste debe expresarse como una lista de Maxima, como en <code>cbrange=[-2, 3]</code>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d (
        enhanced3d     = true,
        color          = green,
        cbrange = [-3,10],
        explicit(x^2+y^2, x,-2,2,y,-2,2)) $
</pre></div>

<p>Véanse también <code>enhanced3d</code> y <code>cbtics</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fcbtics"></a><dl>
<dt><a name="index-cbtics"></a>Opción gráfica: <strong>cbtics</strong></dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Esta opción gráfica controla la forma en la que se dibujarán
las marcas en la escala de color cuando la opción <code>enhanced3d</code>
sea diferente de <code>false</code>.
</p>
<p>Cuando <code>enhanced3d</code> o <code>colorbox</code> vale <code>false</code>, la 
opción <code>cbtics</code> no tiene efecto alguno.
</p>
<p>Véase <code>xtics</code> para una descripción completa.
</p>
<p>Ejemplo :
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d (
        enhanced3d = true,
        color      = green,
        cbtics  = {[&quot;High&quot;,10],[&quot;Medium&quot;,05],[&quot;Low&quot;,0]},
        cbrange = [0, 10],
        explicit(x^2+y^2, x,-2,2,y,-2,2)) $
</pre></div>

<p>See also <code>enhanced3d</code>, <code>colorbox</code> and <code>cbrange</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fcolor"></a><dl>
<dt><a name="index-color-1"></a>Opción gráfica: <strong>color</strong></dt>
<dd><p>Valor por defecto: <code>blue</code>
</p>
<p><code>color</code> especifica el color para dibujar líneas,
puntos, bordes de polígonos y etiquetas.
</p>
<p>Los colores se pueden dar a partir de sus nombres o en
código hexadecimal <i>rgb</i>.
</p>
<p>Los nombres de colores disponibles son: 
<code>white</code>, <code>black</code>, <code>gray0</code>, <code>grey0</code>, <code>gray10</code>,
<code>grey10</code>, <code>gray20</code>, <code>grey20</code>, <code>gray30</code>, <code>grey30</code>,
<code>gray40</code>, <code>grey40</code>, <code>gray50</code>, <code>grey50</code>, <code>gray60</code>,
<code>grey60</code>, <code>gray70</code>, <code>grey70</code>, <code>gray80</code>, <code>grey80</code>,
<code>gray90</code>, <code>grey90</code>, <code>gray100</code>, <code>grey100</code>, <code>gray</code>,
<code>grey</code>, <code>light_gray</code>, <code>light_grey</code>, <code>dark_gray</code>,
<code>dark_grey</code>, <code>red</code>, <code>light_red</code>, <code>dark_red</code>, <code>yellow</code>,
<code>light_yellow</code>, <code>dark_yellow</code>, <code>green</code>, <code>light_green</code>,
<code>dark_green</code>, <code>spring_green</code>, <code>forest_green</code>, <code>sea_green</code>,
<code>blue</code>, <code>light_blue</code>, <code>dark_blue</code>, <code>midnight_blue</code>, 
<code>navy</code>, <code>medium_blue</code>, <code>royalblue</code>, <code>skyblue</code>, 
<code>cyan</code>, <code>light_cyan</code>, <code>dark_cyan</code>, <code>magenta</code>, 
<code>light_magenta</code>, <code>dark_magenta</code>, <code>turquoise</code>, 
<code>light_turquoise</code>, <code>dark_turquoise</code>, <code>pink</code>, <code>light_pink</code>,
<code>dark_pink</code>, <code>coral</code>, <code>light_coral</code>, <code>orange_red</code>,
<code>salmon</code>, <code>light_salmon</code>, <code>dark_salmon</code>, <code>aquamarine</code>,
<code>khaki</code>, <code>dark_khaki</code>, <code>goldenrod</code>, <code>light_goldenrod</code>,
<code>dark_goldenrod</code>, <code>gold</code>, <code>beige</code>, <code>brown</code>, <code>orange</code>,
<code>dark_orange</code>, <code>violet</code>, <code>dark_violet</code>, <code>plum</code> y <code>purple</code>.
</p>
<p>Las componentes cromáticas en código hexadecimal se introducen 
en el formato <code>&quot;#rrggbb&quot;</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(explicit(x^2,x,-1,1), /* default is black */
             color = red,
             explicit(0.5 + x^2,x,-1,1),
             color = blue,
             explicit(1 + x^2,x,-1,1),
             color = light_blue,
             explicit(1.5 + x^2,x,-1,1),
             color = &quot;#23ab0f&quot;,
             label([&quot;This is a label&quot;,0,1.2])  )$
</pre></div>

<p>Véase también <code>fill_color</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fcolorbox"></a><dl>
<dt><a name="index-colorbox-1"></a>Opción gráfica: <strong>colorbox</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>colorbox</code> vale <code>true</code>, se dibuja una escala de colores sin
título al lado de los objetos <code>image</code> en 2D o de objetos
coloreados en 3D. Cuando <code>colorbox</code> vale <code>false</code>, no se presenta
la escala de colores. Cuando <code>colorbox</code> es una cadena de caracteres,
se mostrará la escala de colores con un título.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<p>Escala de colores e imágenes.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) im: apply('matrix,
                 makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) draw2d(image(im,0,0,30,30))$
(%i4) draw2d(colorbox = false, image(im,0,0,30,30))$
</pre></div>

<p>Escala de colores y objeto 3D coloreado.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
        colorbox   = &quot;Magnitude&quot;,
        enhanced3d = true,
        explicit(x^2+y^2,x,-1,1,y,-1,1))$
</pre></div>

<p>Véase también <code>palette</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fcolumns"></a><dl>
<dt><a name="index-columns"></a>Opción gráfica: <strong>columns</strong></dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>columns</code> es el número de columnas en gráficos múltiples.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia. También puede
usarse como argumento de la función <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) scene1: gr2d(title=&quot;Ellipse&quot;,
                   nticks=30,
                   parametric(2*cos(t),5*sin(t),t,0,2*%pi))$
(%i3) scene2: gr2d(title=&quot;Triangle&quot;,
                   polygon([4,5,7],[6,4,2]))$
(%i4) draw(scene1, scene2, columns = 2)$
</pre></div>

</dd></dl>



<a name="Item_003a-draw_002fdefvr_002fcontour"></a><dl>
<dt><a name="index-contour"></a>Opción gráfica: <strong>contour</strong></dt>
<dd><p>Valor por defecto: <code>none</code>
</p>
<p>La opción <code>contour</code> permite al usuario decidir dónde colocar
las líneas de nivel.
Valores posibles son:
</p>
<ul>
<li> <code>none</code>:
no se dibujan líneas de nivel.

</li><li> <code>base</code>:
las líneas de nivel se proyectan sobre el plano xy.

</li><li> <code>surface</code>:
las líneas de nivel se dibujan sobre la propia superficie.

</li><li> <code>both</code>:
se dibujan dos conjuntos de líneas de nivel: sobre
la superficie y las que se proyectan sobre el plano xy.

</li><li> <code>map</code>:
las líneas de nivel se proyectan sobre el plano xy
y el punto de vista del observador se coloca perpendicularmente a él.

</li></ul>

<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = 15,
             contour        = both,
             surface_hide   = true) $
</pre></div>

<p>Véase también <code>contour_levels</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fcontour_005flevels"></a><dl>
<dt><a name="index-contour_005flevels"></a>Opción gráfica: <strong>contour_levels</strong></dt>
<dd><p>Valor por defecto: 5
</p>
<p>Esta opción gráfica controla cómo se dibujarán las líneas
de nivel. A <code>contour_levels</code> se le puede asignar un número entero
positivo, una lista de tres números o un conjunto numérico arbitrario:
</p>
<ul>
<li> Si a <code>contour_levels</code> se le asigna un entero positivo <var>n</var>,
entonces se dibujarán <var>n</var> líneas de nivel a intervalos
iguales. Por defecto, se dibujaán cinco isolíneas.

</li><li> Si a <code>contour_levels</code> se le asigna una lista de tres números de la
forma <code>[inf,p,sup]</code>, las isolíneas se dibujarán
desde <code>inf</code> hasta <code>sup</code> en pasos de amplitud <code>p</code>.

</li><li> Si a <code>contour_levels</code> se le asigna un conjunto de números de la
forma <code>{n1, n2, ...}</code>, entonces se dibujarán las
isolíneas correspondientes a los niveles <code>n1</code>,
<code>n2</code>, ...
</li></ul>

<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia. 
</p>
<p>Ejemplos:
</p>
<p>Diez isolíneas igualmente espaciadas. El número
real puede ajustarse a fin de poder conseguir etiquetas más
sencillas.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(color = green,
             explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = 10,
             contour        = both,
             surface_hide   = true) $
</pre></div>


<p>Desde -8 hasta 8 en pasos de amplitud 4.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(color = green,
             explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = [-8,4,8],
             contour        = both,
             surface_hide   = true) $
</pre></div>

<p>Líneas correspondientes a los niveles -7, -6, 0.8 y 5.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(color = green,
             explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = {-7, -6, 0.8, 5},
             contour        = both,
             surface_hide   = true) $
</pre></div>

<p>Véase también <code>contour</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fdata_005ffile_005fname"></a><dl>
<dt><a name="index-data_005ffile_005fname"></a>Opción gráfica: <strong>data_file_name</strong></dt>
<dd><p>Valor por defecto: <code>&quot;data.gnuplot&quot;</code>
</p>
<p><code>data_file_name</code> es el nombre del fichero que almacena
la información numérica que necesita Gnuplot para crear
el gráfico solicitado.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia. También puede
usarse como argumento de la función <code>draw</code>.
</p>
<p>Véase ejemplo en <code>gnuplot_file_name</code>.
</p>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002fdelay"></a><dl>
<dt><a name="index-delay"></a>Opción gráfica: <strong>delay</strong></dt>
<dd><p>Valor por defecto: 5
</p>
<p>Este es el retraso en centésimas de segundo entre imágenes
en los ficheros gif animados.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia. También puede
usarse como argumento de la función <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw(
        delay     = 100,
        file_name = &quot;zzz&quot;,
        terminal  = 'animated_gif,
        gr2d(explicit(x^2,x,-1,1)),
        gr2d(explicit(x^3,x,-1,1)),
        gr2d(explicit(x^4,x,-1,1)));
End of animation sequence
(%o2)          [gr2d(explicit), gr2d(explicit), gr2d(explicit)]
</pre></div>

<p>La opciób <code>delay</code> sólo se activa en caso de gifs animados; se ignora en
cualquier otro caso.
</p>
<p>Véanse también <code>terminal</code>, <code>dimensions</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fdimensions"></a><dl>
<dt><a name="index-dimensions-1"></a>Opción gráfica: <strong>dimensions</strong></dt>
<dd><p>Valor por defecto: <code>[600,500]</code>
</p>
<p>Dimensiones del terminal de salida. Su valor es una lista formada
por el ancho y el alto. El significado de estos dos números
depende del terminal con el que se esté trabajando.
</p>
<p>Con los terminales <code>gif</code>, <code>animated_gif</code>, <code>png</code>, <code>jpg</code>,
<code>svg</code>, <code>screen</code>, <code>wxt</code> y <code>aquaterm</code>, los enteros
representan números de puntos en cada dirección. Si no son enteros
se redondean.
</p>
<p>Con los terminales <code>eps</code>, <code>eps_color</code>, <code>pdf</code> y
<code>pdfcairo</code>, los números representan centésimas de cm,
lo que significa que, por defecto, las imágenes en estos
formatos tienen 6 cm de ancho por 5 cm de alto.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia. También puede
usarse como argumento de la función <code>draw</code>.
</p>
<p>Ejemplos:
</p>
<p>La opción <code>dimensions</code> aplicada a un fichero de salida y al
lienzo wxt.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        dimensions = [300,300],
        terminal   = 'png,
        explicit(x^4,x,-1,1)) $
(%i3) draw2d(
        dimensions = [300,300],
        terminal   = 'wxt,
        explicit(x^4,x,-1,1)) $
</pre></div>

<p>La opción <code>dimensions</code> aplicada a una salida eps.
En este caso queremos un fichero eps con dimensiones A4.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) A4portrait: 100*[21, 29.7]$
(%i3) draw3d(
        dimensions = A4portrait,
        terminal   = 'eps,
        explicit(x^2-y^2,x,-2,2,y,-2,2)) $
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002fdraw_005frealpart"></a><dl>
<dt><a name="index-draw_005frealpart"></a>Opción gráfica: <strong>draw_realpart</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando vale <code>true</code>, las funciones a dibujar se consideran funciones complejas cuyas
partes reales se deben dibujar; cuando la opción vale <code>false</code>, no se dibujará
nada en caso de que la función no devuelve valores reales.
</p>
<p>Esta opción afecta a los objetos <code>explicit</code> y <code>parametric</code> en 2D y 3D, y al
objeto <code>parametric_surface</code>.
</p>
<p>Ejemplo:
</p>
<p>La opción <code>draw_realpart</code> afecta a los objetos <code>explicit</code> y <code>parametric</code>.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        draw_realpart = false,
        explicit(sqrt(x^2  - 4*x) - x, x, -1, 5),
        color         = red,
        draw_realpart = true,
        parametric(x,sqrt(x^2  - 4*x) - x + 1, x, -1, 5) );
</pre></div>

</dd></dl>



<a name="Item_003a-draw_002fdefvr_002fenhanced3d"></a><dl>
<dt><a name="index-enhanced3d"></a>Opción gráfica: <strong>enhanced3d</strong></dt>
<dd><p>Valor por defecto: <code>none</code>
</p>
<p>Cuando <code>enhanced3d</code> vale <code>none</code>, las superficies no se colorean en escenas 3D.
Para obtener una superficie coloreada se debe asignar una lista a la opción
<code>enhanced3d</code>, en la que el primer elemento es una expresión y el resto
son los nombres de las variables o parámetros utilizados en la expresión.
Una lista tal como <code>[f(x,y,z), x, y, z]</code> significa que al punto 
<code>[x,y,z]</code> de la superficie se le asigna el número <code>f(x,y,z)</code>, el
cual será coloreado de acuerdo con el valor actual de <code>palette</code>.
Para aquellos objetos gráficos 3D definidos en términos de parámetros,
es posible definir el número de color en términos de dichos parámetros,
como en <code>[f(u), u]</code>, para los objetos <code>parametric</code> y <code>tube</code>,
o <code>[f(u,v), u, v]</code>, para el objeto <code>parametric_surface</code>.
Mientras que todos los objetos 3D admiten el modelo basado en coordenadas
absolutas, <code>[f(x,y,z), x, y, z]</code>, solamente dos de ellos, esto es
<code>explicit</code> y <code>elevation_grid</code>, aceptan también el modelo basado en las
coordenadas <code>[x,y]</code>, <code>[f(x,y), x, y]</code>. El objeto 3D <code>implicit</code>
acepta solamente el modelo <code>[f(x,y,z), x, y, z]</code>. El objeto <code>points</code> 
también acepta el modelo <code>[f(x,y,z), x, y, z]</code>, pero cuando los puntos
tienen naturaleza cronológica también admite el modelo <code>[f(k), k]</code>,
siendo <code>k</code> un parámetro de orden.
</p>
<p>Cuando a <code>enhanced3d</code> se le asigna algo diferente de <code>none</code>, se ignoran
las opciones <code>color</code> y <code>surface_hide</code>.
</p>
<p>Los nombres de las variables definidas en las listas pueden ser diferentes
de aquellas utilizadas en las definiciones de los objetos gráficos.
</p>
<p>A fin de mantener compatibilidad con versiones anteriores, <code>enhanced3d = false</code> 
es equivalente a <code>enhanced3d = none</code> y <code>enhanced3d = true</code> es
equivalente a <code>enhanced3d = [z, x, y, z]</code>. Si a <code>enhanced3d</code> se le
asigna una expresión, sus variables deben ser las mismas utilizadas en la
definición de la superficie. Esto no es necesario cuando se utilizan listas.
</p>
<p>Sobre la definición de paletas, véase <code>palette</code>.
</p>
<p>Ejemplos:
</p>
<p>Objeto <code>explicit</code> con coloreado definido por el modelo <code>[f(x,y,z), x, y, z]</code>.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
         enhanced3d = [x-z/10,x,y,z],
         palette    = gray,
         explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3))$
</pre></div>

<p>Objeto <code>explicit</code> con coloreado definido por el modelo <code>[f(x,y), x, y]</code>.
Los nombres de las variables definidas en las listas pueden ser diferentes
de aquellas utilizadas en las definiciones de los objetos gráficos 3D; en este
caso, <code>r</code> corresponde a <code>x</code> y <code>s</code> a <code>y</code>.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
         enhanced3d = [sin(r*s),r,s],
         explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3))$
</pre></div>

<p>Objeto <code>parametric</code> con coloreado definido por el modelo <code>[f(x,y,z), x, y, z]</code>.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
         nticks = 100,
         line_width = 2,
         enhanced3d = [if y&gt;= 0 then 1 else 0, x, y, z],
         parametric(sin(u)^2,cos(u),u,u,0,4*%pi)) $
</pre></div>

<p>Objeto <code>parametric</code> con coloreado definido por el modelo <code>[f(u), u]</code>.
En este caso, <code>(u-1)^2</code> es una simplificación de <code>[(u-1)^2,u]</code>.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
         nticks = 60,
         line_width = 3,
         enhanced3d = (u-1)^2,
         parametric(cos(5*u)^2,sin(7*u),u-2,u,0,2))$
</pre></div>

<p>Objeto <code>elevation_grid</code> con coloreado definido por el modelo <code>[f(x,y), x, y]</code>.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) m: apply(
           matrix,
           makelist(makelist(cos(i^2/80-k/30),k,1,30),i,1,20)) $
(%i3) draw3d(
         enhanced3d = [cos(x*y*10),x,y],
         elevation_grid(m,-1,-1,2,2),
         xlabel = &quot;x&quot;,
         ylabel = &quot;y&quot;);
</pre></div>

<p>Objeto <code>tube</code> con coloreado definido por el modelo <code>[f(x,y,z), x, y, z]</code>.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
         enhanced3d = [cos(x-y),x,y,z],
         palette = gray,
         xu_grid = 50,
         tube(cos(a), a, 0, 1, a, 0, 4*%pi) )$
</pre></div>

<p>Objeto <code>tube</code> con coloreado definido por el modelo <code>[f(u), u]</code>.
En este caso, <code>enhanced3d = -a</code> puede ser una simplificación de 
<code>enhanced3d = [-foo,foo]</code>.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
         capping = [true, false],
         palette = [26,15,-2],
         enhanced3d = [-foo, foo],
         tube(a, a, a^2, 1, a, -2, 2) )$
</pre></div>

<p>Objetos <code>implicit</code> y <code>points</code> con coloreado definido por el
modelo <code>[f(x,y,z), x, y, z]</code>.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
         enhanced3d = [x-y,x,y,z],
         implicit((x^2+y^2+z^2-1)*(x^2+(y-1.5)^2+z^2-0.5)=0.015,
                  x,-1,1,y,-1.2,2.3,z,-1,1)) $
(%i3) m: makelist([random(1.0),random(1.0),random(1.0)],k,1,2000)$
(%i4) draw3d(
         point_type = filled_circle,
         point_size = 2,
         enhanced3d = [u+v-w,u,v,w],
         points(m) ) $
</pre></div>

<p>cuando los puntos tienen naturaleza cronológica también se admite
el modelo <code>[f(k), k]</code>, siendo <code>k</code> un parámetro de orden.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) m:makelist([random(1.0), random(1.0), random(1.0)],k,1,5)$
(%i3) draw3d(
         enhanced3d = [sin(j), j],
         point_size = 3,
         point_type = filled_circle,
         points_joined = true,
         points(m)) $
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002ferror_005ftype"></a><dl>
<dt><a name="index-error_005ftype"></a>Opción gráfica: <strong>error_type</strong></dt>
<dd><p>Valor por defecto: <code>y</code>
</p>
<p>Dependiendo de su valor, el cual puede ser <code>x</code>, <code>y</code> o <code>xy</code>,
el objeto gráfico <code>errors</code> dibujará puntos con barras de error horizontales,
verticales, o ambas. Si <code>error_type=boxes</code>, se dibujarán cajas en lugar de cruces.
</p>
<p>Véase también <code>errors</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002ffile_005fname"></a><dl>
<dt><a name="index-file_005fname"></a>Opción gráfica: <strong>file_name</strong></dt>
<dd><p>Valor por defecto: <code>&quot;maxima_out&quot;</code>
</p>
<p><code>file_name</code> es el nombre del fichero en el que los terminales <code>png</code>,
<code>jpg</code>, <code>gif</code>, <code>eps</code>, <code>eps_color</code>, <code>pdf</code>, <code>pdfcairo</code>
y <code>svg</code> guardarán el gráfico.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia. También puede
usarse como argumento de la función <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(file_name = &quot;myfile&quot;,
             explicit(x^2,x,-1,1),
             terminal  = 'png)$
</pre></div>

<p>Véanse también <code>terminal</code>, <code>dimensions</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002ffill_005fcolor"></a><dl>
<dt><a name="index-fill_005fcolor"></a>Opción gráfica: <strong>fill_color</strong></dt>
<dd><p>Valor por defecto: <code>&quot;red&quot;</code>
</p>
<p><code>fill_color</code> especifica el color para rellenar polígonos
y funciones explícitas bidimensionales.
</p>
<p>Véase <code>color</code> para más información sobre cómo definir 
colores.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002ffill_005fdensity"></a><dl>
<dt><a name="index-fill_005fdensity"></a>Opción gráfica: <strong>fill_density</strong></dt>
<dd><p>Valor por defecto: 0
</p>
<p><code>fill_density</code> es un número entre 0 y 1 que especifica
la intensidad del color de relleno (dado por <code>fill_color</code>)
en los objetos <code>bars</code>.
</p>
<p>Véase <code>bars</code> para ejemplos.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002ffilled_005ffunc"></a><dl>
<dt><a name="index-filled_005ffunc"></a>Opción gráfica: <strong>filled_func</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>La opción <code>filled_func</code> establece cómo se van a rellenar las regiones
limitadas por funciones. Si <code>filled_func</code> vale <code>true</code>, la
región limitada por la función definida en el objeto <code>explicit</code>
y el borde inferior del la ventana gráfica se rellena con <code>fill_color</code>.
Si <code>filled_func</code> guarda la expresión de una función, entonces la
región limitada por esta función y la definida en el objeto <code>explicit</code>
será la que se rellene. Por defecto, las funciones explícitas
no se rellenan.
</p>
<p>Un caso de especial utilidad es <code>filled_func=0</code>, con lo que se sombrea la
región limitada por el eje horizontal y la función explícita.
</p>
<p>Esta opción sólo afecta al objeto gráfico bidimensional <code>explicit</code>.
</p>
<p>Ejemplo:
</p>
<p>Región limitada por un objeto <code>explicit</code> y el borde inferior
de la ventana gráfica.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(fill_color  = red,
             filled_func = true,
             explicit(sin(x),x,0,10) )$
</pre></div>

<p>Región limitada por un objeto <code>explicit</code> y la función
definida en la opción <code>filled_func</code>. Nótese que la 
variable en <code>filled_func</code> debe ser la misma que la utilizada en 
<code>explicit</code>.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(fill_color  = grey,
             filled_func = sin(x),
             explicit(-sin(x),x,0,%pi));
</pre></div>

<p>Véanse también <code>fill_color</code> y <code>explicit</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002ffont"></a><dl>
<dt><a name="index-font"></a>Opción gráfica: <strong>font</strong></dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vacía)
</p>
<p>Esta opción permite seleccionar el tipo de fuente a utilizar por el
terminal. Sólo se puede utilizar un tipo de fuente y tamaño por
gráfico.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Véase también <code>font_size</code>.
</p>
<p>Gnuplot no puede gestionar por sí mismo las fuentes,
dejando esta tarea a las librerías que dan soporte a los
diferentes terminales, cada uno con su propia manera de controlar
la tipografía. A continuación un breve resumen:
</p>
<ul>
<li> <i>x11</i>:
Utiliza el mecanismo habitual para suministrar las fuentes en x11.

<p>Ejemplo:
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(font      = &quot;Arial&quot;, 
             font_size = 20,
             label([&quot;Arial font, size 20&quot;,1,1]))$
</pre></div>

</li><li> <i>windows</i>:
El terminal de windows no permite cambiar fuentes desde dentro
del gráfico. Una vez se ha creado el gráfico, se pueden cambiar las
fuentes haciendo clic derecho en el menú de la ventana gráfica.

</li><li> <i>png, jpeg, gif</i>:
La librería <i>libgd</i> utiliza la ruta a las fuentes
almacenada en la variable de entorno <code>GDFONTPATH</code>; en tal caso
sólo es necesario darle a la opción <code>font</code> el nombre de la
fuente. También es posible darle la ruta completa al fichero de la fuente.

<p>Ejemplos:
</p>
<p>A la opción <code>font</code> se le puede dar la ruta completa al fichero de la fuente:
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) path: &quot;/usr/share/fonts/truetype/freefont/&quot; $
(%i3) file: &quot;FreeSerifBoldItalic.ttf&quot; $
(%i4) draw2d(
        font      = concat(path, file), 
        font_size = 20,
        color     = red,
        label([&quot;FreeSerifBoldItalic font, size 20&quot;,1,1]),
        terminal  = png)$
</pre></div>

<p>Si la variable de entorno <code>GDFONTPATH</code> almacena la ruta
a la carpeta donde se alojan las fuentes, es posible darle a la
opción <code>font</code> sólo el nombre de la fuente:
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        font      = &quot;FreeSerifBoldItalic&quot;, 
        font_size = 20,
        color     = red,
        label([&quot;FreeSerifBoldItalic font, size 20&quot;,1,1]),
        terminal  = png)$
</pre></div>

</li><li> <i>Postscript</i>:
Las fuentes estándar de Postscript son: <code>&quot;Times-Roman&quot;</code>, <code>&quot;Times-Italic&quot;</code>, <code>&quot;Times-Bold&quot;</code>, <code>&quot;Times-BoldItalic&quot;</code>, <code>&quot;Helvetica&quot;</code>, <code>&quot;Helvetica-Oblique&quot;</code>, <code>&quot;Helvetica-Bold&quot;</code>, <code>&quot;Helvetic-BoldOblique&quot;</code>, <code>&quot;Courier&quot;</code>, <code>&quot;Courier-Oblique&quot;</code>, <code>&quot;Courier-Bold&quot;</code> y <code>&quot;Courier-BoldOblique&quot;</code>.
  
<p>Ejemplo:
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        font      = &quot;Courier-Oblique&quot;, 
        font_size = 15,
        label([&quot;Courier-Oblique font, size 15&quot;,1,1]),
        terminal = eps)$
</pre></div>

</li><li> <i>pdf</i>:
Utiliza las mismas fuentes que <i>Postscript</i>.

</li><li> <i>pdfcairo</i>:
Utiliza las mismas fuentes que <i>wxt</i>.

</li><li> <i>wxt</i>:
La librería <i>pango</i> encuentra las fuentes por medio de la utilidad <code>fontconfig</code>.

</li><li> <i>aqua</i>:
La fuente por defecto es <code>&quot;Times-Roman&quot;</code>.
</li></ul>

<p>La documentación de gnuplot es una importante fuente de información sobre terminales y fuentes.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002ffont_005fsize"></a><dl>
<dt><a name="index-font_005fsize"></a>Opción gráfica: <strong>font_size</strong></dt>
<dd><p>Valor por defecto: 10
</p>
<p>Esta opción permite seleccionar el tamaño de la fuente a utilizar por el
terminal. Sólo se puede utilizar un tipo de fuente y tamaño por
gráfico. <code>font_size</code> sólo se activa cuando la opción <code>font</code>
tiene un valor diferente de la cadena vacía.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Véase también <code>font</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fgnuplot_005ffile_005fname"></a><dl>
<dt><a name="index-gnuplot_005ffile_005fname"></a>Opción gráfica: <strong>gnuplot_file_name</strong></dt>
<dd><p>Valor por defecto: <code>&quot;maxout.gnuplot&quot;</code>
</p>
<p><code>gnuplot_file_name</code> es el nombre del fichero que 
almacena las instrucciones a ser procesadas por Gnuplot.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia. También puede
usarse como argumento de la función <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
       file_name = &quot;my_file&quot;,
       gnuplot_file_name = &quot;my_commands_for_gnuplot&quot;,
       data_file_name    = &quot;my_data_for_gnuplot&quot;,
       terminal          = png,
       explicit(x^2,x,-1,1)) $
</pre></div>

<p>Véase también <code>data_file_name</code>.
</p>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002fgrid"></a><dl>
<dt><a name="index-grid-1"></a>Opción gráfica: <strong>grid</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando 
</p>
<p>Cuando <code>grid</code> toma un valor distinto de <code>false</code>, se dibujará una rejilla
sobre el plano <var>xy</var>. Si a <code>grid</code> se le asigna el valor <code>true</code>, se dibujará
una línea de la rejilla por cada marca que haya sobre los ejes. Si a <code>grid</code> se le
asigna la lista <code>[nx,ny]</code>, con <var>[nx,ny] &gt; [0,0]</var>, se dibujarán <code>nx</code> 
líneas por cada marca del eje-<var>x</var> y <var>ny</var> líneas por cada marca del eje-<var>y</var>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(grid = true,
             explicit(exp(u),u,-2,2))$
</pre></div>
</dd></dl>




<a name="Item_003a-draw_002fdefvr_002fhead_005fangle"></a><dl>
<dt><a name="index-head_005fangle"></a>Opción gráfica: <strong>head_angle</strong></dt>
<dd><p>Valor por defecto: 45
</p>
<p><code>head_angle</code> indica el ángulo, en grados, entre la flecha y el
segmento del vector.
</p>
<p>Esta opción sólo es relevante para objetos de tipo <code>vector</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xrange      = [0,10],
             yrange      = [0,9],
             head_length = 0.7,
             head_angle  = 10,
             vector([1,1],[0,6]),
             head_angle  = 20,
             vector([2,1],[0,6]),
             head_angle  = 30,
             vector([3,1],[0,6]),
             head_angle  = 40,
             vector([4,1],[0,6]),
             head_angle  = 60,
             vector([5,1],[0,6]),
             head_angle  = 90,
             vector([6,1],[0,6]),
             head_angle  = 120,
             vector([7,1],[0,6]),
             head_angle  = 160,
             vector([8,1],[0,6]),
             head_angle  = 180,
             vector([9,1],[0,6]) )$
</pre></div>

<p>Véanse también <code>head_both</code>, <code>head_length</code> y <code>head_type</code>. 
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fhead_005fboth"></a><dl>
<dt><a name="index-head_005fboth"></a>Opción gráfica: <strong>head_both</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>head_both</code> vale <code>true</code>, los vectores se dibujan bidireccionales.
Si vale <code>false</code>, se dibujan unidireccionales.
</p>
<p>Esta opción sólo es relevante para objetos de tipo <code>vector</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xrange      = [0,8],
             yrange      = [0,8],
             head_length = 0.7,
             vector([1,1],[6,0]),
             head_both   = true,
             vector([1,7],[6,0]) )$
</pre></div>

<p>Véanse también <code>head_length</code>, <code>head_angle</code> y <code>head_type</code>. 
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fhead_005flength"></a><dl>
<dt><a name="index-head_005flength"></a>Opción gráfica: <strong>head_length</strong></dt>
<dd><p>Valor por defecto: 2
</p>
<p><code>head_length</code> indica, en las unidades del eje <var>x</var>, la
longitud de las flechas de los vectores.
</p>
<p>Esta opción sólo es relevante para objetos de tipo <code>vector</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,8],
             vector([0,1],[5,5]),
             head_length = 1,
             vector([2,1],[5,5]),
             head_length = 0.5,
             vector([4,1],[5,5]),
             head_length = 0.25,
             vector([6,1],[5,5]))$
</pre></div>

<p>Véanse también <code>head_both</code>, <code>head_angle</code> y <code>head_type</code>. 
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fhead_005ftype"></a><dl>
<dt><a name="index-head_005ftype"></a>Opción gráfica: <strong>head_type</strong></dt>
<dd><p>Valor por defecto: <code>filled</code>
</p>
<p><code>head_type</code> se utiliza para especificar cómo se habrán de
dibujar las flechas de los vectores. Los valores posibles para
esta opción son: <code>filled</code> (flechas cerradas y rellenas),
<code>empty</code> (flechas cerradas pero no rellenas) y <code>nofilled</code>
(flechas abiertas).
</p>
<p>Esta opción sólo es relevante para objetos de tipo <code>vector</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,10],
             head_length = 1,
             vector([0,1],[5,5]), /* default type */
             head_type = 'empty,
             vector([3,1],[5,5]),
             head_type = 'nofilled,
             vector([6,1],[5,5]))$
</pre></div>

<p>Véanse también <code>head_both</code>, <code>head_angle</code> y <code>head_length</code>. 
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002finterpolate_005fcolor"></a><dl>
<dt><a name="index-interpolate_005fcolor"></a>Opción gráfica: <strong>interpolate_color</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Esta opción solo es relevante si <code>enhanced3d</code> tiene un valor 
diferente de <code>false</code>.
</p>
<p>Si <code>interpolate_color</code> vale <code>false</code>, las superficies se colorean con
cuadriláteros homogéneos. Si vale <code>true</code>, las transiciones de colores se
suavizan por interpolación.
</p>
<p>La opción <code>interpolate_color</code> también acepta una lista de dos números, <code>[m,n]</code>.
Para <var>m</var> y <var>n</var> positivos, cada cuadrilátero o triángulo se interpola
<var>m</var> y <var>n</var> veces en la dirección respectiva. Para <var>m</var> y <var>n</var> negativos,
la frecuencia de interpolación se elige de forma que se dibujen al menos <var>abs(m)</var> y
<var>abs(n)</var> puntos, pudiéndose considerar esto como una función especial de enrejado.
Con valores nulos, esto es <code>interpolate_color=[0,0]</code>, se seleccionará un número 
óptimo de puntos interpolados en la superficie.
</p>
<p>Además, <code>interpolate_color=true</code> es equivalente a <code>interpolate_color=[0,0]</code>.
</p>
<p>La interpolación de colores en superficies paramétricas puede dar resultados
imprevisibles.
</p>
<p>Ejemplos:
</p>
<p>Interpolación de color con funciones explícitas.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
        enhanced3d   = sin(x*y),
        explicit(20*exp(-x^2-y^2)-10, x ,-3, 3, y, -3, 3)) $
(%i3) draw3d(
        interpolate_color = true,
        enhanced3d   = sin(x*y),
        explicit(20*exp(-x^2-y^2)-10, x ,-3, 3, y, -3, 3)) $
(%i4) draw3d(
        interpolate_color = [-10,0],
        enhanced3d   = sin(x*y),
        explicit(20*exp(-x^2-y^2)-10, x ,-3, 3, y, -3, 3)) $
</pre></div>

<p>Interpolación de color con el objeto <code>mesh</code>.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d( 
        enhanced3d = true,
        mesh([[1,1,3],   [7,3,1],[12,-2,4],[15,0,5]],
             [[2,7,8],   [4,3,1],[10,5,8], [12,7,1]],
             [[-2,11,10],[6,9,5],[6,15,1], [20,15,2]])) $
(%i3) draw3d( 
        enhanced3d        = true,
        interpolate_color = true,
        mesh([[1,1,3],   [7,3,1],[12,-2,4],[15,0,5]],
             [[2,7,8],   [4,3,1],[10,5,8], [12,7,1]],
             [[-2,11,10],[6,9,5],[6,15,1], [20,15,2]])) $
(%i4) draw3d( 
        enhanced3d        = true,
        interpolate_color = true,
        view=map,
        mesh([[1,1,3],   [7,3,1],[12,-2,4],[15,0,5]],
             [[2,7,8],   [4,3,1],[10,5,8], [12,7,1]],
             [[-2,11,10],[6,9,5],[6,15,1], [20,15,2]])) $
</pre></div>

<p>Véase también <code>enhanced3d</code>. 
</p>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002fip_005fgrid"></a><dl>
<dt><a name="index-ip_005fgrid"></a>Opción gráfica: <strong>ip_grid</strong></dt>
<dd><p>Valor por defecto: <code>[50, 50]</code>
</p>
<p><code>ip_grid</code> establece la rejilla del primer muestreo para los
gráficos de funciones implícitas.
</p>
<p>Esta opción sólo es relevante para funciones de tipo <code>implicit</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fip_005fgrid_005fin"></a><dl>
<dt><a name="index-ip_005fgrid_005fin"></a>Opción gráfica: <strong>ip_grid_in</strong></dt>
<dd><p>Valor por defecto: <code>[5, 5]</code>
</p>
<p><code>ip_grid_in</code> establece la rejilla del segundo muestreo para los
gráficos de funciones implícitas.
</p>
<p>Esta opción sólo es relevante para funciones de tipo <code>implicit</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fkey"></a><dl>
<dt><a name="index-key"></a>Opción gráfica: <strong>key</strong></dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vacía)
</p>
<p><code>key</code> es la clave de una función en la leyenda. Si <code>key</code>
es una cadena vacía, las funciones no tendrán clave
asociada en la leyenda.
</p>
<p>Esta opción afecta a los siguientes objetos gráficos:
</p><ul>
<li> <code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>,
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>,
<code>parametric</code> y <code>polar</code>.

</li><li> <code>gr3d</code>: <code>points</code>, <code>explicit</code>, <code>parametric</code>,
y <code>parametric_surface</code>.
</li></ul>

<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(key   = &quot;Sinus&quot;,
             explicit(sin(x),x,0,10),
             key   = &quot;Cosinus&quot;,
             color = red,
             explicit(cos(x),x,0,10) )$
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002fkey_005fpos"></a><dl>
<dt><a name="index-key_005fpos"></a>Opción gráfica: <strong>key_pos</strong></dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vacía)
</p>
<p>La opción <code>key_pos</code> establece en qué posición se colocará la leyenda.
Si <code>key</code> es una cadena vacía, entonces se utilizará por defecto la
posición <code>&quot;top_right&quot;</code>.
Los valores disponibles para esta opción son: <code>top_left</code>, <code>top_center</code>,
<code>top_right</code>, <code>center_left</code>, <code>center</code>, <code>center_right</code>,
<code>bottom_left</code>, <code>bottom_center</code> y <code>bottom_right</code>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        key_pos = top_left,
        key     = &quot;x&quot;,
        explicit(x,  x,0,10),
        color   = red,
        key     = &quot;x squared&quot;,
        explicit(x^2,x,0,10))$
(%i3) draw3d(
        key_pos = center,
        key     = &quot;x&quot;,
        explicit(x+y,x,0,10,y,0,10),
        color= red,
        key     = &quot;x squared&quot;,
        explicit(x^2+y^2,x,0,10,y,0,10))$
</pre></div>

</dd></dl>



<a name="Item_003a-draw_002fdefvr_002flabel_005falignment"></a><dl>
<dt><a name="index-label_005falignment"></a>Opción gráfica: <strong>label_alignment</strong></dt>
<dd><p>Valor por defecto: <code>center</code>
</p>
<p><code>label_alignment</code> se utiliza para especificar dónde se escribirán
las etiquetas con respecto a las coordenadas de referencia. Los valores posibles para
esta opción son: <code>center</code>, <code>left</code> y <code>right</code>.
</p>
<p>Esta opción sólo es relevante para objetos de tipo <code>label</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xrange          = [0,10],
             yrange          = [0,10],
             points_joined   = true,
             points([[5,0],[5,10]]),
             color           = blue,
             label([&quot;Centered alignment (default)&quot;,5,2]),
             label_alignment = 'left,
             label([&quot;Left alignment&quot;,5,5]),
             label_alignment = 'right,
             label([&quot;Right alignment&quot;,5,8]))$
</pre></div>

<p>Véanse también <code>label_orientation</code> y <code>color</code>. 
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002flabel_005forientation"></a><dl>
<dt><a name="index-label_005forientation"></a>Opción gráfica: <strong>label_orientation</strong></dt>
<dd><p>Valor por defecto: <code>horizontal</code>
</p>
<p><code>label_orientation</code> se utiliza para especificar la orientación
de las etiquetas. Los valores posibles para esta opción son:
<code>horizontal</code> y <code>vertical</code>.
</p>
<p>Esta opción sólo es relevante para objetos de tipo <code>label</code>.
</p>
<p>Ejemplo:
</p>
<p>En este ejemplo, el punto ficticio que se añade sirve para obtener
la imagen, ya que el paquete <code>draw</code> necesita siempre de datos para
construir la escena.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xrange     = [0,10],
             yrange     = [0,10],
             point_size = 0,
             points([[5,5]]),
             color      = navy,
             label([&quot;Horizontal orientation (default)&quot;,5,2]),
             label_orientation = 'vertical,
             color             = &quot;#654321&quot;,
             label([&quot;Vertical orientation&quot;,1,5]))$
</pre></div>

<p>Véanse también <code>label_alignment</code> y <code>color</code>. 
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fline_005ftype"></a><dl>
<dt><a name="index-line_005ftype"></a>Opción gráfica: <strong>line_type</strong></dt>
<dd><p>Valor por defecto: <code>solid</code>
</p>
<p><code>line_type</code> indica cómo se van a dibujar las líneas;
valores posibles son <code>solid</code> y <code>dots</code>, que están disponibles
en todos los terminales, y <code>dashes</code>, <code>short_dashes</code>, 
<code>short_long_dashes</code>, <code>short_short_long_dashes</code> y <code>dot_dash</code>,
que no esán disponibles en los terminales <code>png</code>, <code>jpg</code> y <code>gif</code>.
</p>
<p>Esta opción afecta a los siguientes objetos gráficos:
</p><ul>
<li> <code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>, 
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>, 
<code>parametric</code> y <code>polar</code>.

</li><li> <code>gr3d</code>: <code>points</code>, <code>explicit</code>, <code>parametric</code> y <code>parametric_surface</code>.
</li></ul>

<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(line_type = dots,
             explicit(1 + x^2,x,-1,1),
             line_type = solid, /* default */
             explicit(2 + x^2,x,-1,1))$
</pre></div>

<p>Véase también <code>line_width</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fline_005fwidth"></a><dl>
<dt><a name="index-line_005fwidth"></a>Opción gráfica: <strong>line_width</strong></dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>line_width</code> es el ancho de las líneas a dibujar.
Su valor debe ser un número positivo.
</p>
<p>Esta opción afecta a los siguientes objetos gráficos:
</p><ul>
<li> <code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>, 
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>, 
<code>parametric</code> y <code>polar</code>.

</li><li> <code>gr3d</code>: <code>points</code> y <code>parametric</code>.
</li></ul>

<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(explicit(x^2,x,-1,1), /* default width */
             line_width = 5.5,
             explicit(1 + x^2,x,-1,1),
             line_width = 10,
             explicit(2 + x^2,x,-1,1))$
</pre></div>

<p>Véase también <code>line_type</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002flogcb"></a><dl>
<dt><a name="index-logcb"></a>Opción gráfica: <strong>logcb</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>logcb</code> vale <code>true</code>, la escala de colores se dibuja 
logarítmicamente.
</p>
<p>Cuando <code>enhanced3d</code> o <code>colorbox</code> vale <code>false</code>, la 
opción <code>logcb</code> no tiene efecto alguno.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d (
        enhanced3d = true,
        color      = green,
        logcb = true,
        logz  = true,
        palette = [-15,24,-9],
        explicit(exp(x^2-y^2), x,-2,2,y,-2,2)) $
</pre></div>

<p>Véanse también <code>enhanced3d</code>, <code>colorbox</code> y <code>cbrange</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002flogx"></a><dl>
<dt><a name="index-logx-1"></a>Opción gráfica: <strong>logx</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>logx</code> vale <code>true</code>, el eje <var>x</var> se dibuja
en la escala logarítmica.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(explicit(log(x),x,0.01,5),
             logx = true)$
</pre></div>

<p>Véanse también <code>logy</code>, <code>logx_secondary</code>, <code>logy_secondary</code> y <code>logz</code>.
</p>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002flogx_005fsecondary"></a><dl>
<dt><a name="index-logx_005fsecondary"></a>Opción gráfica: <strong>logx_secondary</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>logx_secondary</code> vale <code>true</code>, el eje secundario de <var>x</var> 
se dibuja en la escala logarítmica.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        grid = true,
        key=&quot;x^2, linear scale&quot;,
        color=red,
        explicit(x^2,x,1,100),
        xaxis_secondary = true,
        xtics_secondary = true,
        logx_secondary  = true,
        key = &quot;x^2, logarithmic x scale&quot;,
        color = blue,
        explicit(x^2,x,1,100) )$
</pre></div>

<p>Véanse también <code>logx</code>, <code>logy</code>, <code>logy_secondary</code> y <code>logz</code>.
</p>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002flogy"></a><dl>
<dt><a name="index-logy-1"></a>Opción gráfica: <strong>logy</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>logy</code> vale <code>true</code>, el eje <var>y</var> se dibuja
en la escala logarítmica.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(logy = true,
             explicit(exp(x),x,0,5))$
</pre></div>

<p>Véanse también <code>logx</code>, <code>logx_secondary</code>, <code>logy_secondary</code> y <code>logz</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002flogy_005fsecondary"></a><dl>
<dt><a name="index-logy_005fsecondary"></a>Opción gráfica: <strong>logy_secondary</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>logy_secondary</code> vale <code>true</code>, el eje secundario de <var>y</var> 
se dibuja en la escala logarítmica.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        grid = true,
        key=&quot;x^2, linear scale&quot;,
        color=red,
        explicit(x^2,x,1,100),
        yaxis_secondary = true,
        ytics_secondary = true,
        logy_secondary  = true,
        key = &quot;x^2, logarithmic y scale&quot;,
        color = blue,
        explicit(x^2,x,1,100) )$
</pre></div>

<p>Véanse también <code>logx</code>, <code>logy</code>, <code>logx_secondary</code> y <code>logz</code>.
</p>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002flogz"></a><dl>
<dt><a name="index-logz"></a>Opción gráfica: <strong>logz</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>logz</code> vale <code>true</code>, el eje <var>z</var> se dibuja
en la escala logarítmica.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(logz = true,
             explicit(exp(u^2+v^2),u,-2,2,v,-2,2))$
</pre></div>

<p>Véanse también <code>logx</code> and <code>logy</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fnticks"></a><dl>
<dt><a name="index-nticks-1"></a>Opción gráfica: <strong>nticks</strong></dt>
<dd><p>Valor por defecto: 29
</p>
<p>En 2d, <code>nticks</code> es el número de puntos a utilizar por el programa
adaptativo que genera las funciones explícitas. También es el número de
puntos que se representan en las curvas paramétricas y polares.
</p>
<p>Esta opción afecta a los siguientes objetos gráficos:
</p><ul>
<li> <code>gr2d</code>: <code>ellipse</code>, <code>explicit</code>, <code>parametric</code> y <code>polar</code>.

</li><li> <code>gr3d</code>: <code>parametric</code>.
</li></ul>

<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(transparent = true,
             ellipse(0,0,4,2,0,180),
             nticks = 5,
             ellipse(0,0,4,2,180,180) )$
</pre></div>
</dd></dl>





<a name="Item_003a-draw_002fdefvr_002fpalette"></a><dl>
<dt><a name="index-palette-2"></a>Opción gráfica: <strong>palette</strong></dt>
<dd><p>Valor por defecto: <code>color</code>
</p>
<p><code>palette</code> indica cómo transformar niveles de gris en componentes cromáticas.
Trabaja conjuntamente con la opción <code>enhanced3d</code> en gráficos 3D, la cual asocia cada punto
de una superficie con un número real o nivel de gris. También trabaja con imágenes grises.
Con <code>palette</code>, estos niveles se transforman en colores.
</p>
<p>Hay dos formas de definir estas transformaciones.
</p>
<p>En primer lugar, <code>palette</code> puede ser un vector de longitud tres con sus componentes tomando
valores enteros en el rango desde -36 a +36; cada valor es un 
índice para seleccionar una fórmula que transforma los niveles
numéricos en las componentes cromáticas rojo, verde y azul:
</p><div class="example">
<pre class="example"> 0: 0               1: 0.5           2: 1
 3: x               4: x^2           5: x^3
 6: x^4             7: sqrt(x)       8: sqrt(sqrt(x))
 9: sin(90x)       10: cos(90x)     11: |x-0.5|
12: (2x-1)^2       13: sin(180x)    14: |cos(180x)|
15: sin(360x)      16: cos(360x)    17: |sin(360x)|
18: |cos(360x)|    19: |sin(720x)|  20: |cos(720x)|
21: 3x             22: 3x-1         23: 3x-2
24: |3x-1|         25: |3x-2|       26: (3x-1)/2
27: (3x-2)/2       28: |(3x-1)/2|   29: |(3x-2)/2|
30: x/0.32-0.78125 31: 2*x-0.84     32: 4x;1;-2x+1.84;x/0.08-11.5
33: |2*x - 0.5|    34: 2*x          35: 2*x - 0.5
36: 2*x - 1
</pre></div>
<p>los números negativos se interpretan como colores invertidos
de las componentes cromáticas.
<code>palette = gray</code> y <code>palette = color</code> son atajos para
<code>palette = [3,3,3]</code> y <code>palette = [7,5,15]</code>, respectivamente.
</p>
<p>En segundo lugar, <code>palette</code> puede ser una paleta de colores definida
por el usuario. En este caso, el formato para crear una paleta de longitud
<code>n</code> es <code>palette=[color_1, color_2, ..., color_n]</code>, 
donde <code>color_i</code> es un color correctamente definido (véase la opción
<code>color</code>), de tal manera que <code>color_1</code> se asigna al valor más bajo
del nivel y <code>color_n</code> al más alto. El resto de colores se interpolan.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplos:
</p>
<p>Trabaja conjuntamente con la opción <code>enhanced3d</code> en gráficos 3D.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
        enhanced3d = [z-x+2*y,x,y,z],
        palette = [32, -8, 17],
        explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3))$
</pre></div>

<p>También trabaja con imágenes grises.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) im: apply(
           'matrix,
            makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) /* palette = color, default */
      draw2d(image(im,0,0,30,30))$
(%i4) draw2d(palette = gray, image(im,0,0,30,30))$
(%i5) draw2d(palette = [15,20,-4],
             colorbox=false,
             image(im,0,0,30,30))$
</pre></div>

<p><code>palette</code> puede ser una paleta de colores definida
por el usuario. En este ejemplo, valores bajos de <code>x</code>
se colorean en rojo y altos en amarillo.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
         palette = [red, blue, yellow],
         enhanced3d = x,
         explicit(x^2+y^2,x,-1,1,y,-1,1)) $
</pre></div>

<p>Véase también <code>colorbox</code> y <code>enhanced3d</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fpoint_005fsize"></a><dl>
<dt><a name="index-point_005fsize"></a>Opción gráfica: <strong>point_size</strong></dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>point_size</code> establece el tamaño de los puntos dibujados. Debe
ser un número no negativo.
</p>
<p>Esta opción no tiene efecto alguno cuando a la opción gráfica
<code>point_type</code> se le ha dado el valor <code>dot</code>.
</p>
<p>Esta opción afecta a los siguientes objetos gráficos:
</p><ul>
<li> <code>gr2d</code>: <code>points</code>.

</li><li> <code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        points(makelist([random(20),random(50)],k,1,10)),
        point_size = 5,
        points(makelist(k,k,1,20),makelist(random(30),k,1,20)))$
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002fpoint_005ftype"></a><dl>
<dt><a name="index-point_005ftype-1"></a>Opción gráfica: <strong>point_type</strong></dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>point_type</code> indica cómo se van a dibujar los puntos aislados. Los valores
para esta opción pueden ser índices enteros mayores o iguales que -1,
o también nombres de estilos: <code>$none</code> (-1), <code>dot</code> (0), <code>plus</code> (1),
<code>multiply</code> (2), <code>asterisk</code> (3), <code>square</code> (4), <code>filled_square</code> (5),
<code>circle</code> (6), <code>filled_circle</code> (7), <code>up_triangle</code> (8), 
<code>filled_up_triangle</code> (9), <code>down_triangle</code> (10), 
<code>filled_down_triangle</code> (11), <code>diamant</code> (12) y <code>filled_diamant</code> (13).
</p>
<p>Esta opción afecta a los siguientes objetos gráficos:
</p><ul>
<li> <code>gr2d</code>: <code>points</code>.

</li><li> <code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xrange = [0,10],
             yrange = [0,10],
             point_size = 3,
             point_type = diamant,
             points([[1,1],[5,1],[9,1]]),
             point_type = filled_down_triangle,
             points([[1,2],[5,2],[9,2]]),
             point_type = asterisk,
             points([[1,3],[5,3],[9,3]]),
             point_type = filled_diamant,
             points([[1,4],[5,4],[9,4]]),
             point_type = 5,
             points([[1,5],[5,5],[9,5]]),
             point_type = 6,
             points([[1,6],[5,6],[9,6]]),
             point_type = filled_circle,
             points([[1,7],[5,7],[9,7]]),
             point_type = 8,
             points([[1,8],[5,8],[9,8]]),
             point_type = filled_diamant,
             points([[1,9],[5,9],[9,9]]) )$
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002fpoints_005fjoined"></a><dl>
<dt><a name="index-points_005fjoined"></a>Opción gráfica: <strong>points_joined</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>points_joined</code> vale <code>true</code>, los puntos se unen con segmentos;
si vale <code>false</code>, se dibujarán puntos aislados. Un tercer valor posible
para esta opción gráfica es <code>impulses</code>; en tal caso, se dibujarán
segmentos verticales desde los puntos hasta el eje-x (2D) o hasta el plano-xy (3D).
</p>
<p>Esta opción afecta a los siguientes objetos gráficos:
</p><ul>
<li> <code>gr2d</code>: <code>points</code>.

</li><li> <code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xrange        = [0,10],
             yrange        = [0,4],
             point_size    = 3,
             point_type    = up_triangle,
             color         = blue,
             points([[1,1],[5,1],[9,1]]),
             points_joined = true,
             point_type    = square,
             line_type     = dots,
             points([[1,2],[5,2],[9,2]]),
             point_type    = circle,
             color         = red,
             line_width    = 7,
             points([[1,3],[5,3],[9,3]]) )$
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002fproportional_005faxes"></a><dl>
<dt><a name="index-proportional_005faxes"></a>Opción gráfica: <strong>proportional_axes</strong></dt>
<dd><p>Valor por defecto: <code>none</code>
</p>
<p>Cuando <code>proportional_axes</code> es igual a <code>xy</code> o <code>xy</code>, una escena
2D o 3D se dibujará con los ejes proporcionales a sus longitudes relativas.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Esta opción sólo funciona con Gnuplot versión 4.2.6
o superior.
</p>
<p>Ejemplos:
</p>
<p>Gráfico en 2D.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        ellipse(0,0,1,1,0,360),
        transparent=true,
        color = blue,
        line_width = 4,
        ellipse(0,0,2,1/2,0,360),
        proportional_axes = xy) $
</pre></div>

<p>Multiplot.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw(
        terminal = wxt,
        gr2d(proportional_axes = xy,
             explicit(x^2,x,0,1)),
        gr2d(explicit(x^2,x,0,1),
             xrange = [0,1],
             yrange = [0,2],
             proportional_axes=xy),
        gr2d(explicit(x^2,x,0,1)))$
</pre></div>

</dd></dl>




<a name="Item_003a-draw_002fdefvr_002fsurface_005fhide"></a><dl>
<dt><a name="index-surface_005fhide"></a>Opción gráfica: <strong>surface_hide</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>surface_hide</code> vale <code>true</code>, las partes ocultas no
se muestran en las superficies de las escenas 3d.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw(columns=2,
           gr3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3)),
           gr3d(surface_hide = true,
                explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3)) )$
</pre></div>
</dd></dl>




<a name="Item_003a-draw_002fdefvr_002fterminal"></a><dl>
<dt><a name="index-terminal"></a>Opción gráfica: <strong>terminal</strong></dt>
<dd><p>Valor por defecto: <code>screen</code>
</p>
<p>Selecciona el terminal a utilizar por Gnuplot; valores posibles son:
<code>screen</code> (por defecto), <code>png</code>, <code>pngcairo</code>, <code>jpg</code>, <code>gif</code>, 
<code>eps</code>, <code>eps_color</code>, <code>epslatex</code>, <code>epslatex_standalone</code>, 
<code>svg</code>, <code>dumb</code>, <code>dumb_file</code>, <code>pdf</code>, <code>pdfcairo</code>, 
<code>wxt</code>, <code>animated_gif</code>, <code>multipage_pdfcairo</code>, <code>multipage_pdf</code>, 
<code>multipage_eps</code>, <code>multipage_eps_color</code> y <code>aquaterm</code>.
</p>
<p>Los terminales <code>screen</code>, <code>wxt</code> y <code>aquaterm</code> también se pueden 
definir como una lista de dos elementos: el propio nombre del terminal y un 
número entero no negativo. De esta forma se pueden abrir varias ventanas al
mismo tiempo, cada una de ellas con su número correspondiente. Esta modalidad
no funciona en plataformas Windows.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia. También puede
usarse como argumento de la función <code>draw</code>.
</p>
<p>pdfcairo necesita Gnuplot 4.3. 
<code>pdf</code> necesita que Gnuplot haya sido compilado con la opción <code>--enable-pdf</code> y libpdf debe
estar instalado (<a href="http://www.pdflib.com/en/download/pdflib-family/pdflib-lite/">http://www.pdflib.com/en/download/pdflib-family/pdflib-lite/</a>).
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) /* screen terminal (default) */
      draw2d(explicit(x^2,x,-1,1))$
(%i3) /* png file */
      draw2d(terminal  = 'png,
             explicit(x^2,x,-1,1))$
(%i4) /* jpg file */
      draw2d(terminal   = 'jpg,
             dimensions = [300,300],
             explicit(x^2,x,-1,1))$
(%i5) /* eps file */
      draw2d(file_name = &quot;myfile&quot;,
             explicit(x^2,x,-1,1),
             terminal  = 'eps)$
(%i6) /* pdf file */
      draw2d(file_name = &quot;mypdf&quot;,
             dimensions = 100*[12.0,8.0],
             explicit(x^2,x,-1,1),
             terminal  = 'pdf)$
(%i7) /* wxwidgets window */
      draw2d(explicit(x^2,x,-1,1),
             terminal  = 'wxt)$
</pre></div>

<p>Ventanas múltiples.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(explicit(x^5,x,-2,2), terminal=[screen, 3])$
(%i3) draw2d(explicit(x^2,x,-2,2), terminal=[screen, 0])$
</pre></div>

<p>Un fichero gif animado.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw(
        delay     = 100,
        file_name = &quot;zzz&quot;,
        terminal  = 'animated_gif,
        gr2d(explicit(x^2,x,-1,1)),
        gr2d(explicit(x^3,x,-1,1)),
        gr2d(explicit(x^4,x,-1,1)));
End of animation sequence
(%o2)          [gr2d(explicit), gr2d(explicit), gr2d(explicit)]
</pre></div>

<p>La opción <code>delay</code> sólo se activa en caso de gifs animados; se ignora en
cualquier otro caso.
</p>
<p>Salida multipágina en formato eps.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw(
        file_name = &quot;parabol&quot;,
        terminal  = multipage_eps,
        dimensions = 100*[10,10],
        gr2d(explicit(x^2,x,-1,1)),
        gr3d(explicit(x^2+y^2,x,-1,1,y,-1,1))) $
</pre></div>

<p>Véanse también <code>file_name</code>, <code>pic_width</code>, <code>pic_height</code> y <code>delay</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002ftitle"></a><dl>
<dt><a name="index-title"></a>Opción gráfica: <strong>title</strong></dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vacía)
</p>
<p>La opción <code>title</code> almacena una cadena con el 
título de la escena. Por defecto, no se escribe
título alguno.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(explicit(exp(u),u,-2,2),
             title = &quot;Exponential function&quot;)$
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002ftransform"></a><dl>
<dt><a name="index-transform"></a>Opción gráfica: <strong>transform</strong></dt>
<dd><p>Valor por defecto: <code>none</code>
</p>
<p>Si <code>transform</code> vale <code>none</code>, el espacio no sufre transformación
alguna y los objetos gráficos se representan tal cual se definen. Si es
necesario transformar el espacio, se debe asignar una lista a la opción
<code>transform</code>. En caso de una escena 2D, la lista toma la forma
<code>[f1(x,y), f2(x,y), x, y]</code>.
En caso de una escena 3D, la lista debe ser de la forma
<code>[f1(x,y,z), f2(x,y,z), f3(x,y,z), x, y, z]</code>.
</p>
<p>Los nombres de las variables definidas en las listas pueden ser diferentes
de aquellas utilizadas en las definiciones de los objetos gráficos.
</p>
<p>Ejemplos:
</p>
<p>Rotación en 2D.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) th : %pi / 4$
(%i3) draw2d(
        color = &quot;#e245f0&quot;,
        proportional_axes = 'xy,
        line_width = 8,
        triangle([3,2],[7,2],[5,5]),
        border     = false,
        fill_color = yellow,
        transform  = [cos(th)*x - sin(th)*y,
                      sin(th)*x + cos(th)*y, x, y],
        triangle([3,2],[7,2],[5,5]) )$
</pre></div>

<p>Traslación en 3D.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
        color     = &quot;#a02c00&quot;,
        explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3),
        transform = [x+10,y+10,z+10,x,y,z],
        color     = blue,
        explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3) )$
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002ftransparent"></a><dl>
<dt><a name="index-transparent"></a>Opción gráfica: <strong>transparent</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>transparent</code> vale <code>false</code>, las regiones internas de 
los polígonos se rellenan de acuerdo con <code>fill_color</code>.
</p>
<p>Esta opción afecta a los siguientes objetos gráficos:
</p><ul>
<li> <code>gr2d</code>: <code>polygon</code>, <code>rectangle</code> y <code>ellipse</code>.
</li></ul>

<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(polygon([[3,2],[7,2],[5,5]]),
             transparent = true,
             color       = blue,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002funit_005fvectors"></a><dl>
<dt><a name="index-unit_005fvectors"></a>Opción gráfica: <strong>unit_vectors</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>unit_vectors</code> vale <code>true</code>, los vectores se dibujan con módulo unidad.
Esta opción es útil para representar campos vectoriales. Cuando <code>unit_vectors</code> vale <code>false</code>,
los vectores se dibujan con su longitud original.
</p>
<p>Esta opción sólo es relevante para objetos de tipo <code>vector</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xrange      = [-1,6],
             yrange      = [-1,6],
             head_length = 0.1,
             vector([0,0],[5,2]),
             unit_vectors = true,
             color        = red,
             vector([0,3],[5,2]))$
</pre></div>
</dd></dl>




<a name="Item_003a-draw_002fdefvr_002fuser_005fpreamble"></a><dl>
<dt><a name="index-user_005fpreamble"></a>Opción gráfica: <strong>user_preamble</strong></dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vacía)
</p>
<p>Usuarios expertos en Gnuplot pueden hacer uso de esta opción para
afinar el comportamiento de Gnuplot escribiendo código que será
enviado justo antes de la instrucción <code>plot</code> o <code>splot</code>.
</p>
<p>El valor dado a esta opción debe ser una cadena alfanumérica o
una lista de cadenas (una por línea).
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<p>Se le indica a Gnuplot que dibuje los ejes encima de todos los demás objetos,
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        xaxis =true, xaxis_type=solid,
        yaxis =true, yaxis_type=solid,
        user_preamble=&quot;set grid front&quot;,
        region(x^2+y^2&lt;1 ,x,-1.5,1.5,y,-1.5,1.5))$
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002fview"></a><dl>
<dt><a name="index-view"></a>Opción gráfica: <strong>view</strong></dt>
<dd><p>Valor por defecto: <code>[60,30]</code>
</p>
<p>Un par de ángulos, medidos en grados, indicando la direcciÃ³n del 
observador en una escena 3D. El primer ángulo es la rotación 
vertical alrededor del eje <var>x</var>, dentro del intervalo <em>[0, 360]</em>.
El segundo es la rotación horizontal alrededor del eje <var>z</var>, dentro
del intervalo <em>[0, 360]</em>.
</p>
<p>Dándole a la opción <code>view</code> el valor <code>map</code>, la dirección del 
observador se sitúa perpendicularmente al plano-xy.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(view = [170, 50],
             enhanced3d = true,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
(%i3) draw3d(view = map,
             enhanced3d = true,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre></div>
</dd></dl>




<a name="Item_003a-draw_002fdefvr_002fwired_005fsurface"></a><dl>
<dt><a name="index-wired_005fsurface"></a>Opción gráfica: <strong>wired_surface</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Indica si las superficies en 3D en modo <code>enhanced3d</code> deben mostrar o no la malla que
unen los puntos.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
        enhanced3d    = [sin(x),x,y],
        wired_surface = true,
        explicit(x^2+y^2,x,-1,1,y,-1,1)) $
</pre></div>

</dd></dl>




<a name="Item_003a-draw_002fdefvr_002fx_005fvoxel"></a><dl>
<dt><a name="index-x_005fvoxel"></a>Opción gráfica: <strong>x_voxel</strong></dt>
<dd><p>Valor por defecto: 10
</p>
<p><code>x_voxel</code> es el número de voxels en la dirección x a utilizar
por el algoritmo <i>marching cubes</i> implementado por el objeto 
<code>implicit</code> tridimensional. También se utiliza como opción
del objeto gráfico <code>region</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fxaxis"></a><dl>
<dt><a name="index-xaxis"></a>Opción gráfica: <strong>xaxis</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>xaxis</code> vale <code>true</code>, se dibujará el eje <var>x</var>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             xaxis       = true,
             xaxis_color = blue)$
</pre></div>

<p>Véanse también <code>xaxis_width</code>, <code>xaxis_type</code> y <code>xaxis_color</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fxaxis_005fcolor"></a><dl>
<dt><a name="index-xaxis_005fcolor"></a>Opción gráfica: <strong>xaxis_color</strong></dt>
<dd><p>Valor por defecto: <code>&quot;black&quot;</code>
</p>
<p><code>xaxis_color</code> especifica el color para el eje <var>x</var>. Véase
<code>color</code> para ver cómo se definen los colores.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             xaxis       = true,
             xaxis_color = red)$
</pre></div>

<p>Véanse también <code>xaxis</code>, <code>xaxis_width</code> y <code>xaxis_type</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fxaxis_005fsecondary"></a><dl>
<dt><a name="index-xaxis_005fsecondary"></a>Opción gráfica: <strong>xaxis_secondary</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>xaxis_secondary</code> vale <code>true</code>, los valores de las funciones se pueden representar
respecto del eje <var>x</var> secundario, el cual se dibuja en la parte superior de la escena.
</p>
<p>Nótese que esta es una opción gráfica local que sólo afecta a objetos 2d.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
         key   = &quot;Bottom x-axis&quot;,
         explicit(x+1,x,1,2),
         color = red,
         key   = &quot;Above x-axis&quot;,
         xtics_secondary = true,
         xaxis_secondary = true,
         explicit(x^2,x,-1,1)) $
</pre></div>

<p>Véanse también <code>xrange_secondary</code>, <code>xtics_secondary</code>, <code>xtics_rotate_secondary</code>,
<code>xtics_axis_secondary</code> y <code>xaxis_secondary</code>.
</p>
</dd></dl>




<a name="Item_003a-draw_002fdefvr_002fxaxis_005ftype"></a><dl>
<dt><a name="index-xaxis_005ftype"></a>Opción gráfica: <strong>xaxis_type</strong></dt>
<dd><p>Valor por defecto: <code>dots</code>
</p>
<p><code>xaxis_type</code> indica cómo se debe dibujar el eje <var>x</var>; 
valores admisibles son <code>solid</code> y <code>dots</code>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             xaxis       = true,
             xaxis_type  = solid)$
</pre></div>

<p>Véanse también <code>xaxis</code>, <code>xaxis_width</code> y <code>xaxis_color</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fxaxis_005fwidth"></a><dl>
<dt><a name="index-xaxis_005fwidth"></a>Opción gráfica: <strong>xaxis_width</strong></dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>xaxis_width</code> es el ancho del eje <var>x</var>.
Su valor debe ser un número positivo.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             xaxis       = true,
             xaxis_width = 3)$
</pre></div>

<p>Véanse también <code>xaxis</code>, <code>xaxis_type</code> y <code>xaxis_color</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fxlabel"></a><dl>
<dt><a name="index-xlabel-1"></a>Opción gráfica: <strong>xlabel</strong></dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code>
</p>
<p>La opción <code>xlabel</code> almacena una cadena con la
etiqueta del eje <var>x</var>. Por defecto, el eje tiene etiqueta <code>&quot;x&quot;</code>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xlabel = &quot;Time&quot;,
             explicit(exp(u),u,-2,2),
             ylabel = &quot;Population&quot;)$
</pre></div>

<p>Véanse también <code>xlabel_secondary</code>, <code>ylabel</code>, <code>ylabel_secondary</code> y <code>zlabel</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fxlabel_005fsecondary"></a><dl>
<dt><a name="index-xlabel_005fsecondary"></a>Opción gráfica: <strong>xlabel_secondary</strong></dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vacía)
</p>
<p>La opción <code>xlabel_secondary</code> almacena una cadena con la
etiqueta del eje <var>x</var> secundario. Por defecto, el eje no tiene etiqueta.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
         xaxis_secondary=true,yaxis_secondary=true,
         xtics_secondary=true,ytics_secondary=true,
         xlabel_secondary=&quot;t[s]&quot;,
         ylabel_secondary=&quot;U[V]&quot;,
         explicit(sin(t),t,0,10) )$
</pre></div>

<p>Véanse también <code>xlabel</code>, <code>ylabel</code>, <code>ylabel_secondary</code> y <code>zlabel</code>.
</p>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002fxrange"></a><dl>
<dt><a name="index-xrange"></a>Opción gráfica: <strong>xrange</strong></dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Cuando <code>xrange</code> vale <code>auto</code>, el rango de la coordenada <var>x</var>
se calcula de forma automática.
</p>
<p>Si el usuario quiere especificar un intervalo para <var>x</var>, éste debe
expresarse como una lista de Maxima, como en <code>xrange=[-2, 3]</code>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xrange = [-3,5],
             explicit(x^2,x,-1,1))$
</pre></div>

<p>Véanse también <code>yrange</code> y <code>zrange</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fxrange_005fsecondary"></a><dl>
<dt><a name="index-xrange_005fsecondary"></a>Opción gráfica: <strong>xrange_secondary</strong></dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Cuando <code>xrange_secondary</code> vale <code>auto</code>, el rango del eje <var>x</var>
secundario se calcula de forma automática.
</p>
<p>Si el usuario quiere especificar un intervalo para el eje <var>x</var> secundario, éste debe
expresarse como una lista de Maxima, como en <code>xrange_secondary=[-2, 3]</code>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Véanse también <code>xrange</code>, <code>yrange</code>, <code>zrange</code> y <code>yrange_secondary</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fxtics"></a><dl>
<dt><a name="index-xtics"></a>Opción gráfica: <strong>xtics</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Esta opción gráfica controla la forma en la que se dibujarán las marcas
del eje <var>x</var>.
</p>
<ul>
<li> Cuando a <code>xtics</code> se le da el valor <var>true</var>, las marcas se dibujarán de
forma automática.

</li><li> Cuando a <code>xtics</code> se le da el valor <var>false</var>, no habrá marcas en los ejes.

</li><li> Cuando a <code>xtics</code> se le da un valor numérico positivo, se interpretará como la
distancia entre dos marcas consecutivas.

</li><li> Cuando a <code>xtics</code> se le da una lista de longitud tres de la forma 
<code>[start,incr,end]</code>, las marcas se dibujarán desde <code>start</code> 
hasta <code>end</code> a intervalos de longitud <code>incr</code>.

</li><li> Cuando a <code>xtics</code> se le da un conjunto de números de la forma
<code>{n1, n2, ...}</code>, las marcas se dibujarán exactamente en los valores
<code>n1</code>, <code>n2</code>, ...

</li><li> Cuando a <code>xtics</code> se le da un conjunto de pares de la forma
<code>{[&quot;label1&quot;, n1], [&quot;label2&quot;, n2], ...}</code>, las marcas correspondientes a los valores
<code>n1</code>, <code>n2</code>, ... se etiquetarán con <code>&quot;label1&quot;</code>, <code>&quot;label2&quot;</code>, ..., respectivamente.
</li></ul>

<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplos:
</p>
<p>Marcas desactivadas.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xtics = 'false,
             explicit(x^3,x,-1,1)  )$
</pre></div>

<p>Marcas cada 1/4 unidades.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xtics = 1/4,
             explicit(x^3,x,-1,1)  )$
</pre></div>

<p>Marcas desde -3/4 hasta 3/4 en saltos de 1/8.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xtics = [-3/4,1/8,3/4],
             explicit(x^3,x,-1,1)  )$
</pre></div>

<p>Marcas en los puntos -1/2, -1/4 y 3/4.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xtics = {-1/2,-1/4,3/4},
             explicit(x^3,x,-1,1)  )$
</pre></div>

<p>Marcas etiquetadas.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xtics = {[&quot;High&quot;,0.75],[&quot;Medium&quot;,0],[&quot;Low&quot;,-0.75]},
             explicit(x^3,x,-1,1)  )$
</pre></div>
</dd></dl>




<a name="Item_003a-draw_002fdefvr_002fxtics_005faxis"></a><dl>
<dt><a name="index-xtics_005faxis"></a>Opción gráfica: <strong>xtics_axis</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>xtics_axis</code> vale <code>true</code>, las marcas y sus etiquetas se dibujan sobre
el propio eje <var>x</var>, si vale <code>false</code> las marcas se colocan a lo largo del borde
del gráfico.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fxtics_005frotate"></a><dl>
<dt><a name="index-xtics_005frotate"></a>Opción gráfica: <strong>xtics_rotate</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>xtics_rotate</code> vale <code>true</code>, las marcas del eje <var>x</var> se giran 
90 grados.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fxtics_005frotate_005fsecondary"></a><dl>
<dt><a name="index-xtics_005frotate_005fsecondary"></a>Opción gráfica: <strong>xtics_rotate_secondary</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>xtics_rotate_secondary</code> vale <code>true</code>, las marcas del eje <var>x</var> 
secundario se giran 90 grados.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fxtics_005fsecondary"></a><dl>
<dt><a name="index-xtics_005fsecondary"></a>Opción gráfica: <strong>xtics_secondary</strong></dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Esta opción gráfica controla la forma en la que se dibujarán las marcas
del eje <var>x</var> secundario.
</p>
<p>Véase <code>xtics</code> para una descripción completa.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fxtics_005fsecondary_005faxis"></a><dl>
<dt><a name="index-xtics_005fsecondary_005faxis"></a>Opción gráfica: <strong>xtics_secondary_axis</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>xtics_secondary_axis</code> vale <code>true</code>, las marcas y sus etiquetas se dibujan sobre
el propio eje <var>x</var> secundario, si vale <code>false</code> las marcas se colocan a lo largo del borde
del gráfico.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fxu_005fgrid"></a><dl>
<dt><a name="index-xu_005fgrid"></a>Opción gráfica: <strong>xu_grid</strong></dt>
<dd><p>Valor por defecto: 30
</p>
<p><code>xu_grid</code> es el número de coordenadas de la primera variable
(<code>x</code> en superficies explcítas y <code>u</code> en las
paramétricas) para formar la rejilla de puntos muestrales.
</p>
<p>Esta opción afecta a los siguientes objetos gráficos:
</p><ul>
<li> <code>gr3d</code>: <code>explicit</code> y <code>parametric_surface</code>.
</li></ul>

<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(xu_grid = 10,
             yv_grid = 50,
             explicit(x^2+y^2,x,-3,3,y,-3,3) )$
</pre></div>

<p>Véase también <code>yv_grid</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fxy_005ffile"></a><dl>
<dt><a name="index-xy_005ffile"></a>Opción gráfica: <strong>xy_file</strong></dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vacía)
</p>
<p><code>xy_file</code> es el nombre del fichero donde se almacenarán las
coordenadas después de hacer clic con el botón del ratón en un
punto de la imagen y pulsado la tecla &rsquo;x&rsquo;. Por defecto, las 
coordenadas no se almacenan.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fxyplane"></a><dl>
<dt><a name="index-xyplane"></a>Graphic option: <strong>xyplane</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Coloca el plano-xy en escenas 3D. Si <code>xyplane</code> vale <code>false</code>,
el plano-xy se coloca automáticamente; en cambio, si toma un
valor real, el plano-xy intersectará con el eje <var>z</var> a ese nivel.
Esta opción no tiene efecto alguno en escenas 2D.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(xyplane = %e-2,
             explicit(x^2+y^2,x,-1,1,y,-1,1))$
</pre></div>
</dd></dl>




<a name="Item_003a-draw_002fdefvr_002fy_005fvoxel"></a><dl>
<dt><a name="index-y_005fvoxel"></a>Opción gráfica: <strong>y_voxel</strong></dt>
<dd><p>Valor por defecto: 10
</p>
<p><code>y_voxel</code> es el número de voxels en la dirección y a utilizar
por el algoritmo <i>marching cubes</i> implementado por el objeto 
<code>implicit</code> tridimensional. También se utiliza como opción
del objeto gráfico <code>region</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fyaxis"></a><dl>
<dt><a name="index-yaxis"></a>Opción gráfica: <strong>yaxis</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>yaxis</code> vale <code>true</code>, se dibujará el eje <var>y</var>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             yaxis       = true,
             yaxis_color = blue)$
</pre></div>

<p>Véanse también <code>yaxis_width</code>, <code>yaxis_type</code> y <code>yaxis_color</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fyaxis_005fcolor"></a><dl>
<dt><a name="index-yaxis_005fcolor"></a>Opción gráfica: <strong>yaxis_color</strong></dt>
<dd><p>Valor por defecto: <code>&quot;black&quot;</code>
</p>
<p><code>yaxis_color</code> especifica el color para el eje <var>y</var>. Véase
<code>color</code> para ver cómo se definen los colores.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             yaxis       = true,
             yaxis_color = red)$
</pre></div>

<p>Véanse también <code>yaxis</code>, <code>yaxis_width</code> y <code>yaxis_type</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fyaxis_005fsecondary"></a><dl>
<dt><a name="index-yaxis_005fsecondary"></a>Opción gráfica: <strong>yaxis_secondary</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>yaxis_secondary</code> vale <code>true</code>, los valores de las funciones se pueden representar
respecto del eje <var>y</var> secundario, el cual se dibuja al lado derecho de la escena.
</p>
<p>Nótese que esta es una opción gráfica local que sólo afecta a objetos 2d.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
         explicit(sin(x),x,0,10),
         yaxis_secondary = true,
         ytics_secondary = true,
         color = blue,
         explicit(100*sin(x+0.1)+2,x,0,10));
</pre></div>

<p>Véanse también <code>yrange_secondary</code>, <code>ytics_secondary</code>, <code>ytics_rotate_secondary</code>
y <code>ytics_axis_secondary</code>.
</p>
</dd></dl>




<a name="Item_003a-draw_002fdefvr_002fyaxis_005ftype"></a><dl>
<dt><a name="index-yaxis_005ftype"></a>Opción gráfica: <strong>yaxis_type</strong></dt>
<dd><p>Valor por defecto: <code>dots</code>
</p>
<p><code>yaxis_type</code> indica cómo se debe dibujar el eje <var>y</var>; 
valores admisibles son <code>solid</code> y <code>dots</code>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             yaxis       = true,
             yaxis_type  = solid)$
</pre></div>

<p>Véanse también <code>yaxis</code>, <code>yaxis_width</code> y <code>yaxis_color</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fyaxis_005fwidth"></a><dl>
<dt><a name="index-yaxis_005fwidth"></a>Opción gráfica: <strong>yaxis_width</strong></dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>yaxis_width</code> es el ancho del eje <var>y</var>.
Su valor debe ser un número positivo.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             yaxis       = true,
             yaxis_width = 3)$
</pre></div>

<p>Véanse también <code>yaxis</code>, <code>yaxis_type</code> y <code>yaxis_color</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fylabel"></a><dl>
<dt><a name="index-ylabel-1"></a>Opción gráfica: <strong>ylabel</strong></dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code>
</p>
<p>La opción <code>ylabel</code> almacena una cadena con la
etiqueta del eje <var>y</var>. Por defecto, el eje tiene etiqueta <code>&quot;y&quot;</code>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xlabel = &quot;Time&quot;,
             ylabel = &quot;Population&quot;,
             explicit(exp(u),u,-2,2) )$
</pre></div>

<p>Véanse también <code>xlabel</code>, <code>xlabel_secondary</code>, <code>ylabel_secondary</code> y <code>zlabel</code>.
</p></dd></dl>







<a name="Item_003a-draw_002fdefvr_002fylabel_005fsecondary"></a><dl>
<dt><a name="index-ylabel_005fsecondary"></a>Opción gráfica: <strong>ylabel_secondary</strong></dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vacía)
</p>

<p>La opción <code>ylabel_secondary</code> almacena una cadena con la
etiqueta del eje <var>y</var> secundario. Por defecto, el eje no tiene etiqueta.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        key=&quot;current&quot;,
        xlabel=&quot;t[s]&quot;,
        ylabel=&quot;I[A]&quot;,ylabel_secondary=&quot;P[W]&quot;,
        explicit(sin(t),t,0,10),
        yaxis_secondary=true,
        ytics_secondary=true,
        color=red,key=&quot;Power&quot;,
        explicit((sin(t))^2,t,0,10)
    )$
</pre></div>

<p>Véanse también <code>xlabel</code>, <code>xlabel_secondary</code>, <code>ylabel</code> and <code>zlabel</code>.
</p>
</dd></dl>



<a name="Item_003a-draw_002fdefvr_002fyrange"></a><dl>
<dt><a name="index-yrange"></a>Opción gráfica: <strong>yrange</strong></dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Cuando <code>yrange</code> vale <code>auto</code>, el rango de la coordenada <var>y</var>
se calcula de forma automática.
</p>
<p>Si el usuario quiere especificar un intervalo para <var>y</var>, éste debe
expresarse como una lista de Maxima, como en <code>yrange=[-2, 3]</code>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(yrange = [-2,3],
             explicit(x^2,x,-1,1),
             xrange = [-3,3])$
</pre></div>

<p>Véanse también <code>xrange</code> y <code>zrange</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdefvr_002fyrange_005fsecondary"></a><dl>
<dt><a name="index-yrange_005fsecondary"></a>Opción gráfica: <strong>yrange_secondary</strong></dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Cuando <code>yrange_secondary</code> vale <code>auto</code>, el rango del eje <var>y</var>
secundario se calcula de forma automática.
</p>
<p>Si el usuario quiere especificar un intervalo para el eje <var>y</var> secundario, éste debe
expresarse como una lista de Maxima, como en <code>yrange_secondary=[-2, 3]</code>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
         explicit(sin(x),x,0,10),
         yaxis_secondary = true,
         ytics_secondary = true,
         yrange = [-3, 3],
         yrange_secondary = [-20, 20],
         color = blue,
         explicit(100*sin(x+0.1)+2,x,0,10)) $
</pre></div>

<p>Véanse también <code>xrange</code>, <code>yrange</code> y <code>zrange</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fytics"></a><dl>
<dt><a name="index-ytics"></a>Opción gráfica: <strong>ytics</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Esta opción gráfica controla la forma en la que se dibujarán las marcas
del eje <var>y</var>.
</p>
<p>Véase <code>xtics</code> para una descripción completa.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fytics_005faxis"></a><dl>
<dt><a name="index-ytics_005faxis"></a>Opción gráfica: <strong>ytics_axis</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>ytics_axis</code> vale <code>true</code>, las marcas y sus etiquetas se dibujan sobre
el propio eje <var>y</var>, si vale <code>false</code> las marcas se colocan a lo largo del borde
del gráfico.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fytics_005frotate"></a><dl>
<dt><a name="index-ytics_005frotate"></a>Opción gráfica: <strong>ytics_rotate</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>ytics_rotate</code> vale <code>true</code>, las marcas del eje <var>y</var> se giran 
90 grados.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fytics_005frotate_005fsecondary"></a><dl>
<dt><a name="index-ytics_005frotate_005fsecondary"></a>Opción gráfica: <strong>ytics_rotate_secondary</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>ytics_rotate_secondary</code> vale <code>true</code>, las marcas del eje <var>y</var> 
secundario se giran 90 grados.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fytics_005fsecondary"></a><dl>
<dt><a name="index-ytics_005fsecondary"></a>Opción gráfica: <strong>ytics_secondary</strong></dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Esta opción gráfica controla la forma en la que se dibujarán las marcas
del eje <var>y</var> secundario.
</p>
<p>Véase <code>xtics</code> para una descripción completa.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fytics_005fsecondary_005faxis"></a><dl>
<dt><a name="index-ytics_005fsecondary_005faxis"></a>Opción gráfica: <strong>ytics_secondary_axis</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>ytics_secondary_axis</code> vale <code>true</code>, las marcas y sus etiquetas se dibujan sobre
el propio eje <var>y</var> secundario, si vale <code>false</code> las marcas se colocan a lo largo del borde
del gráfico.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fyv_005fgrid"></a><dl>
<dt><a name="index-yv_005fgrid"></a>Opción gráfica: <strong>yv_grid</strong></dt>
<dd><p>Valor por defecto: 30
</p>
<p><code>yv_grid</code> es el número de coordenadas de la segunda variable
(<code>y</code> en superficies explcítas y <code>v</code> en las
paramétricas) para formar la rejilla de puntos muestrales.
</p>
<p>Esta opción afecta a los siguientes objetos gráficos:
</p><ul>
<li> <code>gr3d</code>: <code>explicit</code> y <code>parametric_surface</code>.
</li></ul>

<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(xu_grid = 10,
             yv_grid = 50,
             explicit(x^2+y^2,x,-3,3,y,-3,3) )$
</pre></div>

<p>Véase también <code>xu_grid</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fz_005fvoxel"></a><dl>
<dt><a name="index-z_005fvoxel"></a>Opción gráfica: <strong>z_voxel</strong></dt>
<dd><p>Valor por defecto: 10
</p>
<p><code>z_voxel</code> es el número de voxels en la dirección z a utilizar
por el algoritmo <i>marching cubes</i> implementado por el objeto 
<code>implicit</code> tridimensional.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fzaxis"></a><dl>
<dt><a name="index-zaxis"></a>Opción gráfica: <strong>zaxis</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>zaxis</code> vale <code>true</code>, se dibujará el eje <var>z</var> en
escenas 3D. Esta opción no tiene efecto alguno en escenas 2D.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1),
             zaxis       = true,
             zaxis_type  = solid,
             zaxis_color = blue)$
</pre></div>

<p>Véanse también <code>zaxis_width</code>, <code>zaxis_type</code> y <code>zaxis_color</code>.
</p></dd></dl>





<a name="Item_003a-draw_002fdefvr_002fzaxis_005fcolor"></a><dl>
<dt><a name="index-zaxis_005fcolor"></a>Opción gráfica: <strong>zaxis_color</strong></dt>
<dd><p>Valor por defecto: <code>&quot;black&quot;</code>
</p>
<p><code>zaxis_color</code> especifica el color para el eje <var>z</var>. Véase
<code>color</code> para ver cómo se definen los colores.
Esta opción no tiene efecto alguno en escenas 2D.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1),
             zaxis       = true,
             zaxis_type  = solid,
             zaxis_color = red)$
</pre></div>

<p>Véanse también <code>zaxis</code>, <code>zaxis_width</code> y <code>zaxis_type</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fzaxis_005ftype"></a><dl>
<dt><a name="index-zaxis_005ftype"></a>Opción gráfica: <strong>zaxis_type</strong></dt>
<dd><p>Valor por defecto: <code>dots</code>
</p>
<p><code>zaxis_type</code> indica cómo se debe dibujar el eje <var>z</var>; 
valores admisibles son <code>solid</code> y <code>dots</code>.
Esta opción no tiene efecto alguno en escenas 2D.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1),
             zaxis       = true,
             zaxis_type  = solid)$
</pre></div>

<p>Véanse también <code>zaxis</code>, <code>zaxis_width</code> y <code>zaxis_color</code>.
</p></dd></dl>





<a name="Item_003a-draw_002fdefvr_002fzaxis_005fwidth"></a><dl>
<dt><a name="index-zaxis_005fwidth"></a>Opción gráfica: <strong>zaxis_width</strong></dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>zaxis_width</code> es el ancho del eje <var>z</var>.
Su valor debe ser un número positivo. Esta opción no tiene efecto alguno en escenas 2D.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1),
             zaxis       = true,
             zaxis_type  = solid,
             zaxis_width = 3)$
</pre></div>

<p>Véanse también <code>zaxis</code>, <code>zaxis_type</code> y <code>zaxis_color</code>.
</p></dd></dl>





<a name="Item_003a-draw_002fdefvr_002fzlabel"></a><dl>
<dt><a name="index-zlabel-1"></a>Opción gráfica: <strong>zlabel</strong></dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code>
</p>
<p>La opción <code>zlabel</code> almacena una cadena con la
etiqueta del eje <var>z</var>. Por defecto, el eje tiene etiqueta <code>&quot;z&quot;</code>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(zlabel = &quot;Z variable&quot;,
             ylabel = &quot;Y variable&quot;,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2),
             xlabel = &quot;X variable&quot; )$
</pre></div>

<p>Véanse también <code>xlabel</code> y <code>ylabel</code>.
</p></dd></dl>





<a name="Item_003a-draw_002fdefvr_002fzrange"></a><dl>
<dt><a name="index-zrange"></a>Opción gráfica: <strong>zrange</strong></dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Cuando <code>zrange</code> vale <code>auto</code>, el rango de la coordenada <var>z</var>
se calcula de forma automática.
</p>
<p>Si el usuario quiere especificar un intervalo para <var>z</var>, éste debe
expresarse como una lista de Maxima, como en <code>zrange=[-2, 3]</code>.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(yrange = [-3,3],
             zrange = [-2,5],
             explicit(x^2+y^2,x,-1,1,y,-1,1),
             xrange = [-3,3])$
</pre></div>

<p>Véanse también <code>xrange</code> y <code>yrange</code>.
</p></dd></dl>




<a name="Item_003a-draw_002fdefvr_002fztics"></a><dl>
<dt><a name="index-ztics"></a>Opción gráfica: <strong>ztics</strong></dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Esta opción gráfica controla la forma en la que se dibujarán las marcas
del eje <var>z</var>.
</p>
<p>Véase <code>xtics</code> para una descripción completa.
</p></dd></dl>





<a name="Item_003a-draw_002fdefvr_002fztics_005faxis"></a><dl>
<dt><a name="index-ztics_005faxis"></a>Opción gráfica: <strong>ztics_axis</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>ztics_axis</code> vale <code>true</code>, las marcas y sus etiquetas se dibujan sobre
el propio eje <var>z</var>, si vale <code>false</code> las marcas se colocan a lo largo del borde
del gráfico.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p></dd></dl>





<a name="Item_003a-draw_002fdefvr_002fztics_005frotate"></a><dl>
<dt><a name="index-ztics_005frotate"></a>Opción gráfica: <strong>ztics_rotate</strong></dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>ztics_rotate</code> vale <code>true</code>, las marcas del eje <var>z</var> se giran 
90 grados.
</p>
<p>Puesto que ésta es una opción global, su posición dentro de la
descripción de la escena no reviste importancia.
</p></dd></dl>




<a name="Objetos-graficos"></a>
<h4 class="subsection">47.2.4 Objetos gráficos</h4>



<a name="Item_003a-draw_002fdeffn_002fbars"></a><dl>
<dt><a name="index-bars"></a>Objeto gráfico: <strong>bars</strong> <em>([<var>x1</var>,<var>h1</var>,<var>w1</var>], [<var>x2</var>,<var>h2</var>,<var>w2</var>, ...])</em></dt>
<dd><p>Dibuja barras verticales en 2D.
</p>
<p><b>2D</b>
</p>
<p><code>bars ([<var>x1</var>,<var>h1</var>,<var>w1</var>], [<var>x2</var>,<var>h2</var>,<var>w2</var>, ...])</code> 
dibuja barras centradas en los valores <var>x1</var>, <var>x2</var>, ... de alturas <var>h1</var>, <var>h2</var>, ...
y anchos <var>w1</var>, <var>w2</var>, ...
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>key</code>, 
<code>fill_color</code>, <code>fill_density</code> y <code>line_width</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
       key          = &quot;Grupo A&quot;,
       fill_color   = blue,
       fill_density = 0.2,
       bars([0.8,5,0.4],[1.8,7,0.4],[2.8,-4,0.4]),
       key          = &quot;Grupo B&quot;,
       fill_color   = red,
       fill_density = 0.6,
       line_width   = 4,
       bars([1.2,4,0.4],[2.2,-2,0.4],[3.2,5,0.4]),
       xaxis = true);
</pre></div>
</dd></dl>






<a name="Item_003a-draw_002fdeffn_002fcylindrical"></a><dl>
<dt><a name="index-cylindrical"></a>Objeto gráfico: <strong>cylindrical</strong> <em>(<var>radius</var>,<var>z</var>,<var>minz</var>,<var>maxz</var>,<var>azi</var>,<var>minazi</var>,<var>maxazi</var>)</em></dt>
<dd><p>Dibuja funciones 3D definidas en coordenadas cilíndricas.
</p>
<p><b>3D</b>
</p>
<p><code>cylindrical (<var>radius</var>,<var>z</var>,<var>minz</var>,<var>maxz</var>,<var>azi</var>,<var>minazi</var>,<var>maxazi</var>)</code>
dibuja la función <code><var>radius</var>(<var>z</var>,<var>azi</var>)</code> definida en coordenadas cilíndricas, con la variable
<var>z</var> tomando valores desde <var>minz</var> hasta <var>maxz</var> y el <i>azimut</i> <var>azi</var> tomando valores desde
<var>minazi</var> hasta <var>maxazi</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>key</code>, <code>wired_surface</code>, <code>enhanced3d</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(cylindrical(1,z,-2,2,az,0,2*%pi))$
</pre></div>
</dd></dl>




<a name="Item_003a-draw_002fdeffn_002felevation_005fgrid"></a><dl>
<dt><a name="index-elevation_005fgrid"></a>Objeto gráfico: <strong>elevation_grid</strong> <em>(<var>mat</var>,<var>x0</var>,<var>y0</var>,<var>width</var>,<var>height</var>)</em></dt>
<dd><p>Dibuja la matriz <var>mat</var> en 3D. Los valores <var>z</var> se toman de <var>mat</var>,
las abscisas van desde <var>x0</var> hasta <em><var>x0</var> + <var>width</var></em>
y las ordenadas desde <var>y0</var> hasta <em><var>y0</var> + <var>height</var></em>. El elemento <em>a(1,1)</em>
se proyecta sobre el punto <em>(x0,y0+height)</em>, <em>a(1,n)</em> sobre <em>(x0+width,y0+height)</em>,
<em>a(m,1)</em> sobre <em>(x0,y0)</em> y <em>a(m,n)</em> sobre <em>(x0+width,y0)</em>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>line_type</code>,
<code>line_width</code>, <code>key</code>, <code>wired_surface</code>, <code>enhanced3d</code> y <code>color</code>.
</p>
<p>En versiones antiguas de Maxima, <code>elevation_grid</code> se llamaba <code>mesh</code>.
Véase también <code>mesh</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) m: apply(
            matrix,
            makelist(makelist(random(10.0),k,1,30),i,1,20)) $
(%i3) draw3d(
         color = blue,
         elevation_grid(m,0,0,3,2),
         xlabel = &quot;x&quot;,
         ylabel = &quot;y&quot;,
         surface_hide = true);
</pre></div>

</dd></dl>





<a name="Item_003a-draw_002fdeffn_002fellipse"></a><dl>
<dt><a name="index-ellipse"></a>Objeto gráfico: <strong>ellipse</strong> <em>(<var>xc</var>, <var>yc</var>, <var>a</var>, <var>b</var>, <var>ang1</var>, <var>ang2</var>)</em></dt>
<dd><p>Dibuja elipses y círculos en 2D.
</p>

<p><b>2D</b>
</p>
<p><code>ellipse (<var>xc</var>, <var>yc</var>, <var>a</var>, <var>b</var>, <var>ang1</var>, <var>ang2</var>)</code>
dibuja una elipse de centro <code>[<var>xc</var>, <var>yc</var>]</code> con semiejes horizontal y vertical
<var>a</var> y <var>b</var>, respectivamente, comenzando en el ángulo <var>ang1</var> y trazando un arco
de amplitud igual al ángulo <var>ang2</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>nticks</code>, 
<code>transparent</code>, <code>fill_color</code>, <code>border</code>, <code>line_width</code>, 
<code>line_type</code>, <code>key</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(transparent = false,
             fill_color  = red,
             color       = gray30,
             transparent = false,
             line_width  = 5,
             ellipse(0,6,3,2,270,-270),
             /* center (x,y), a, b, start &amp; end in degrees */
             transparent = true,
             color       = blue,
             line_width  = 3,
             ellipse(2.5,6,2,3,30,-90),
             xrange      = [-3,6],
             yrange      = [2,9] )$
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdeffn_002ferrors"></a><dl>
<dt><a name="index-errors"></a>Objeto gráfico: <strong>errors</strong> <em>([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...])</em></dt>
<dd><p>Dibuja puntos con barras de error asociadas horizontales, verticales o de
ambos tipos, según sea el valor de la opción <code>error_type</code>.
</p>
<p><b>2D</b>
</p>
<p>Si <code>error_type=x</code>, los argumentos a <code>errors</code> deben ser de la forma 
<code>[x,y,xdelta]</code> o <code>[x,y,xlow,xhigh]</code>. Si <code>error_type=y</code>, 
los argumentos deben ser del tipo <code>[x,y,ydelta]</code> o <code>[x,y,ylow,yhigh]</code>.
Si <code>error_type=xy</code> o <code>error_type=boxes</code>, los argumentos deben ser de la
forma <code>[x,y,xdelta,ydelta]</code> o <code>[x,y,xlow,xhigh,ylow,yhigh]</code>.
</p>
<p>Véase también <code>error_type</code>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>error_type</code>, 
<code>points_joined</code>, <code>line_width</code>, <code>key</code>, <code>line_type</code>, 
<code>color</code>, <code>fill_density</code>, <code>xaxis_secondary</code> y <code>yaxis_secondary</code>.
</p>
<p>La opción <code>fill_density</code> solo es relevante cuando <code>error_type=boxes</code>.
</p>
<p>Ejemplos:
</p>
<p>Barras de error horizontales.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        error_type = y,
        errors([[1,2,1], [3,5,3], [10,3,1], [17,6,2]]))$
</pre></div>

<p>Barras de error horizontales y verticales.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        error_type = xy,
        points_joined = true,
        color = blue,
        errors([[1,2,1,2], [3,5,2,1], [10,3,1,1], [17,6,1/2,2]])); 
</pre></div>

</dd></dl>



<a name="Item_003a-draw_002fdeffn_002fexplicit"></a><dl>
<dt><a name="index-explicit"></a>Objeto gráfico: <strong>explicit</strong> <em>(<var>fcn</var>,<var>var</var>,<var>minval</var>,<var>maxval</var>)</em></dt>
<dt><a name="index-explicit-1"></a>Objeto gráfico: <strong>explicit</strong> <em>(<var>fcn</var>,<var>var1</var>,<var>minval1</var>,<var>maxval1</var>,<var>var2</var>,<var>minval2</var>,<var>maxval2</var>)</em></dt>
<dd><p>Dibuja funciones explícitas en 2D y 3D.
</p>
<p><b>2D</b>
</p>
<p><code>explicit (<var>fcn</var>,<var>var</var>,<var>minval</var>,<var>maxval</var>)</code> dibuja la función explícita <var>fcn</var>,
con la variable <var>var</var> tomando valores desde <var>minval</var> hasta <var>maxval</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>nticks</code>, 
<code>adapt_depth</code>, <code>draw_realpart</code>, <code>line_width</code>, <code>line_type</code>, <code>key</code>, 
<code>filled_func</code>, <code>fill_color</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(line_width = 3,
             color      = blue,
             explicit(x^2,x,-3,3) )$
(%i3) draw2d(fill_color  = brown,
             filled_func = true,
             explicit(x^2,x,-3,3) )$
</pre></div>

<p><b>3D</b>
</p>
<p><code>explicit (<var>fcn</var>,<var>var1</var>,<var>minval1</var>,<var>maxval1</var>,<var>var2</var>,<var>minval2</var>,<var>maxval2</var>)</code>
dibuja la función explícita <var>fcn</var>, con la variable 
<code>var1</code> tomando valores desde <var>minval1</var> hasta <var>maxval1</var> y 
la variable <var>var2</var> tomando valores desde <var>minval2</var> hasta <var>maxval2</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>draw_realpart</code>, <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>line_width</code>, <code>key</code>, <code>wired_surface</code>, <code>enhanced3d</code>
y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(key   = &quot;Gauss&quot;,
             color = &quot;#a02c00&quot;,
             explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3),
             yv_grid     = 10,
             color = blue,
             key   = &quot;Plane&quot;,
             explicit(x+y,x,-5,5,y,-5,5),
             surface_hide = true)$
</pre></div>

<p>Véase también <code>filled_func</code> para el relleno de curvas.
</p></dd></dl>




<a name="Item_003a-draw_002fdeffn_002fimage"></a><dl>
<dt><a name="index-image"></a>Objeto gráfico: <strong>image</strong> <em>(<var>im</var>,<var>x0</var>,<var>y0</var>,<var>width</var>,<var>height</var>)</em></dt>
<dd><p>Reproduce una imagen en 2D.
</p>
<p><b>2D</b>
</p>
<p><code>image (<var>im</var>,<var>x0</var>,<var>y0</var>,<var>width</var>,<var>height</var>)</code>:
dibuja la imagen <var>im</var> en la región rectangular desde el vértice <code>(<var>x0</var>,<var>y0</var>)</code>
hasta el <code>(x0+<var>width</var>,y0+<var>height</var>)</code> del plano real. El argumento <var>im</var> debe ser una
matriz de números reales, una matriz de vectores de longitud tres o un objeto
de tipo <code>picture</code>.
</p>
<p>Si <var>im</var> es una matriz de números reales, los valores de los
píxeles se interpretan según indique la opción
gráfica <code>palette</code>, que es un vector de longitud tres con sus componentes tomando
valores enteros en el rango desde -36 a +36; cada valor es un 
índice para seleccionar una fórmula que transforma los niveles
numéricos en las componentes cromáticas rojo, verde y azul:
</p><div class="example">
<pre class="example"> 0: 0               1: 0.5           2: 1
 3: x               4: x^2           5: x^3
 6: x^4             7: sqrt(x)       8: sqrt(sqrt(x))
 9: sin(90x)       10: cos(90x)     11: |x-0.5|
12: (2x-1)^2       13: sin(180x)    14: |cos(180x)|
15: sin(360x)      16: cos(360x)    17: |sin(360x)|
18: |cos(360x)|    19: |sin(720x)|  20: |cos(720x)|
21: 3x             22: 3x-1         23: 3x-2
24: |3x-1|         25: |3x-2|       26: (3x-1)/2
27: (3x-2)/2       28: |(3x-1)/2|   29: |(3x-2)/2|
30: x/0.32-0.78125 31: 2*x-0.84
32: 4x;1;-2x+1.84;x/0.08-11.5
33: |2*x - 0.5|    34: 2*x          35: 2*x - 0.5
36: 2*x - 1
</pre></div>
<p>los números negativos se interpretan como colores invertidos
de las componentes cromáticas.
</p>
<p><code>palette = gray</code> y <code>palette = color</code> son atajos para
<code>palette = [3,3,3]</code> y <code>palette = [7,5,15]</code>, respectivamente.
</p>
<p>Si <var>im</var> es una matriz de vectores de longitud tres, éstos se
interpretarán como las componentes cromáticas rojo, verde y azul.
</p>
<p>Ejemplos:
</p>
<p>Si <var>im</var> es una matriz de números reales, los valores de los
píxeles se interpretan según indique la opción
gráfica <code>palette</code>.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) im: apply(
           'matrix,
            makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) /* palette = color, default */
      draw2d(image(im,0,0,30,30))$
(%i4) draw2d(palette = gray, image(im,0,0,30,30))$
(%i5) draw2d(palette = [15,20,-4],
             colorbox=false,
             image(im,0,0,30,30))$
</pre></div>

<p>Véase también <code>colorbox</code>.
</p>
<p>Si <var>im</var> es una matriz de vectores de longitud tres, éstos se
interpretarán como las componentes cromáticas rojo, verde y azul.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) im: apply(
            'matrix,
             makelist(
               makelist([random(300),
                         random(300),
                         random(300)],i,1,30),i,1,30))$
(%i3) draw2d(image(im,0,0,30,30))$
</pre></div>

<p>El paquete <code>draw</code> carga automáticamente el paquete <code>picture</code>. 
En este ejemplo, una imagen de niveles se define a mano, reproduciéndola
a continuación.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) im: make_level_picture([45,87,2,134,204,16],3,2);
(%o2)       picture(level, 3, 2, {Array:  #(45 87 2 134 204 16)})
(%i3) /* default color palette */
      draw2d(image(im,0,0,30,30))$
(%i4) /* gray palette */
      draw2d(palette = gray,
             image(im,0,0,30,30))$
</pre></div>

<p>Se lee un fichero xpm y se reproduce.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) im: read_xpm(&quot;myfile.xpm&quot;)$
(%i3) draw2d(image(im,0,0,10,7))$
</pre></div>

<p>Véanse también <code>make_level_picture</code>, <code>make_rgb_picture</code> y <code>read_xpm</code>.
</p>
<p>En <a href="http://www.telefonica.net/web2/biomates/maxima/gpdraw/image">http://www.telefonica.net/web2/biomates/maxima/gpdraw/image</a>
se encuentran ejemplos más elaborados.
</p></dd></dl>





<a name="Item_003a-draw_002fdeffn_002fimplicit"></a><dl>
<dt><a name="index-implicit"></a>Objeto gráfico: <strong>implicit</strong> <em>(<var>fcn</var>,<var>x</var>,<var>xmin</var>,<var>xmax</var>,<var>y</var>,<var>ymin</var>,<var>ymax</var>)</em></dt>
<dt><a name="index-implicit-1"></a>Objeto gráfico: <strong>implicit</strong> <em>(<var>fcn</var>,<var>x</var>,<var>xmin</var>,<var>xmax</var>,<var>y</var>,<var>ymin</var>,<var>ymax</var>,<var>z</var>,<var>zmin</var>,<var>zmax</var>)</em></dt>
<dd><p>Dibuja funciones implícitas en 2D y 3D.
</p>
<p><b>2D</b>
</p>
<p><code>implicit (<var>fcn</var>,<var>x</var>,<var>xmin</var>,<var>xmax</var>,<var>y</var>,<var>ymin</var>,<var>ymax</var>)</code>
dibuja la función implícita <var>fcn</var>, con la variable
<code>x</code> tomando valores desde <var>xmin</var> hasta <var>xmax</var>,
y la variable <var>y</var> tomando valores desde <var>ymin</var> hasta <var>ymax</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>ip_grid</code>, 
<code>ip_grid_in</code>, <code>line_width</code>, <code>line_type</code>, <code>key</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(terminal  = eps,
             grid      = true,
             line_type = solid,
             key       = &quot;y^2=x^3-2*x+1&quot;,
             implicit(y^2=x^3-2*x+1, x, -4,4, y, -4,4),
             line_type = dots,
             key       = &quot;x^3+y^3 = 3*x*y^2-x-1&quot;,
             implicit(x^3+y^3 = 3*x*y^2-x-1, x,-4,4, y,-4,4),
             title     = &quot;Two implicit functions&quot; )$
</pre></div>

<p><b>3D</b>
</p>
<p><code>implicit (<var>fcn</var>,<var>x</var>,<var>xmin</var>,<var>xmax</var>, <var>y</var>,<var>ymin</var>,<var>ymax</var>, <var>z</var>,<var>zmin</var>,<var>zmax</var>)</code>
dibuja la función implícita <var>fcn</var>, con la variable <var>x</var> 
tomando valores desde <var>xmin</var> hasta <var>xmax</var>, la variable <var>y</var> tomando 
valores desde <var>ymin</var> hasta <var>ymax</var> y la variable <var>z</var> tomando 
valores desde <var>zmin</var> hasta <var>zmax</var>. Este objeto está programado con el 
algoritmo <i>marching cubes</i>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>x_voxel</code>, 
<code>y_voxel</code>, <code>z_voxel</code>, <code>line_width</code>, <code>line_type</code>, <code>key</code>, 
<code>wired_surface</code>, <code>enhanced3d</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
        color=blue,
        implicit((x^2+y^2+z^2-1)*(x^2+(y-1.5)^2+z^2-0.5)=0.015,
                 x,-1,1,y,-1.2,2.3,z,-1,1),
        surface_hide=true);
</pre></div>
</dd></dl>





<a name="Item_003a-draw_002fdeffn_002flabel"></a><dl>
<dt><a name="index-label"></a>Objeto gráfico: <strong>label</strong> <em>([<var>string</var>,<var>x</var>,<var>y</var>],...)</em></dt>
<dt><a name="index-label-1"></a>Objeto gráfico: <strong>label</strong> <em>([<var>string</var>,<var>x</var>,<var>y</var>,<var>z</var>],...)</em></dt>
<dd><p>Escribe etiquetas en 2D y 3D.
</p>
<p>Las etiquetas coloreadas sólo trabajan con Gnuplot 4.3. Este es un fallo conocido del
paquete <code>draw</code>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>label_alignment</code>, 
<code>label_orientation</code> y <code>color</code>.
</p>
<p><b>2D</b>
</p>
<p><code>label([<var>string</var>,<var>x</var>,<var>y</var>])</code> escribe la cadena de caracteres <var>string</var> 
en el punto <code>[<var>x</var>,<var>y</var>]</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(yrange = [0.1,1.4],
             color = red,
             label([&quot;Label in red&quot;,0,0.3]),
             color = &quot;#0000ff&quot;,
             label([&quot;Label in blue&quot;,0,0.6]),
             color = light_blue,
             label([&quot;Label in light-blue&quot;,0,0.9],
                   [&quot;Another light-blue&quot;,0,1.2])  )$
</pre></div>

<p><b>3D</b>
</p>
<p><code>label([<var>string</var>,<var>x</var>,<var>y</var>,<var>z</var>])</code> escribe la cadena de caracteres <var>string</var>
en el punto <code>[<var>x</var>,<var>y</var>,<var>z</var>]</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3),
             color = red,
             label([&quot;UP 1&quot;,-2,0,3], [&quot;UP 2&quot;,1.5,0,4]),
             color = blue,
             label([&quot;DOWN 1&quot;,2,0,-3]) )$
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdeffn_002fmesh"></a><dl>
<dt><a name="index-mesh"></a>Objeto gráfico: <strong>mesh</strong> <em>(<var>fila_1</var>,<var>fila_2</var>,...)</em></dt>
<dd><p>Dibuja un enrejado cuadrangular en 3D.
</p>
<p><b>3D</b>
</p>
<p>El argumento <var>fila_i</var> es una lista de <var>n</var> puntos en 3D de la forma
<code>[[x_i1,y_i1,z_i1], ...,[x_in,y_in,z_in]]</code>, siendo todas las filas de
igual longitud. Todos estos puntos definen una superficie arbitraria en 3D.
En cierto sentido, se trata de una generalización del objeto <code>elevation_grid</code>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>line_type</code>, 
<code>line_width</code>, <code>color</code>, <code>key</code>, <code>wired_surface</code>, <code>enhanced3d</code> y <code>transform</code>.
</p>
<p>Ejemplos:
</p>
<p>Un sencillo ejemplo.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d( 
         mesh([[1,1,3],   [7,3,1],[12,-2,4],[15,0,5]],
              [[2,7,8],   [4,3,1],[10,5,8], [12,7,1]],
              [[-2,11,10],[6,9,5],[6,15,1], [20,15,2]])) $
</pre></div>

<p>Dibujando un triángulo en 3D.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
        line_width = 2,
        mesh([[1,0,0],[0,1,0]],
             [[0,0,1],[0,0,1]])) $
</pre></div>

<p>Dos cuadriláteros.
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
        surface_hide = true,
        line_width   = 3,
        color = red,
        mesh([[0,0,0], [0,1,0]],
             [[2,0,2], [2,2,2]]),
        color = blue,
        mesh([[0,0,2], [0,1,2]],
             [[2,0,4], [2,2,4]])) $
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdeffn_002fparametric"></a><dl>
<dt><a name="index-parametric"></a>Objeto gráfico: <strong>parametric</strong> <em>(<var>xfun</var>,<var>yfun</var>,<var>par</var>,<var>parmin</var>,<var>parmax</var>)</em></dt>
<dt><a name="index-parametric-1"></a>Objeto gráfico: <strong>parametric</strong> <em>(<var>xfun</var>,<var>yfun</var>,<var>zfun</var>,<var>par</var>,<var>parmin</var>,<var>parmax</var>)</em></dt>
<dd><p>Dibuja funciones paramétricas en 2D y 3D.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>nticks</code>, 
<code>line_width</code>, <code>line_type</code>, <code>key</code>, <code>color</code> y <code>enhanced3d</code>.
</p>
<p><b>2D</b>
</p>
<p><code>parametric (<var>xfun</var>,<var>yfun</var>,<var>par</var>,<var>parmin</var>,<var>parmax</var>)</code> dibuja la función paramétrica 
<code>[<var>xfun</var>,<var>yfun</var>]</code>, con el parámetro <var>par</var> tomando valores desde 
<var>parmin</var> hasta <var>parmax</var>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(explicit(exp(x),x,-1,3),
             color = red,
             key   = &quot;This is the parametric one!!&quot;,
             parametric(2*cos(rrr),rrr^2,rrr,0,2*%pi))$
</pre></div>

<p><b>3D</b>
</p>
<p><code>parametric (<var>xfun</var>,<var>yfun</var>,<var>zfun</var>,<var>par</var>,<var>parmin</var>,<var>parmax</var>)</code> 
dibuja la curva paramétrica <code>[<var>xfun</var>,<var>yfun</var>,<var>zfun</var>]</code>, con el parámetro
<var>par</var> tomando valores desde <var>parmin</var> hasta <var>parmax</var>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3),
             color = royalblue,
             parametric(cos(5*u)^2,sin(7*u),u-2,u,0,2),
             color      = turquoise,
             line_width = 2,
             parametric(t^2,sin(t),2+t,t,0,2),
             surface_hide = true,
             title = &quot;Surface &amp; curves&quot; )$
</pre></div>
</dd></dl>





<a name="Item_003a-draw_002fdeffn_002fparametric_005fsurface"></a><dl>
<dt><a name="index-parametric_005fsurface"></a>Objeto gráfico: <strong>parametric_surface</strong> <em>(<var>xfun</var>,<var>yfun</var>,<var>zfun</var>,<var>par1</var>,<var>par1min</var>,<var>par1max</var>,<var>par2</var>,<var>par2min</var>,<var>par2max</var>)</em></dt>
<dd><p>Dibuja superficies paramétricas en 3D.
</p>
<p><b>3D</b>
</p>
<p><code>parametric_surface (<var>xfun</var>,<var>yfun</var>,<var>zfun</var>,<var>par1</var>,<var>par1min</var>,<var>par1max</var>,<var>par2</var>,<var>par2min</var>,<var>par2max</var>)</code>
dibuja la superficie paramétrica <code>[<var>xfun</var>,<var>yfun</var>,<var>zfun</var>]</code>, 
con el parámetro <var>par1</var> tomando valores desde <var>par1min</var> hasta <var>par1max</var>
y el parámetro <var>par2</var> tomando valores desde <var>par2min</var> hasta <var>par2max</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>draw_realpart</code>, <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>line_width</code>, <code>key</code>, <code>wired_surface</code>, <code>enhanced3d</code>
y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(title          = &quot;Sea shell&quot;,
             xu_grid        = 100,
             yv_grid        = 25,
             view           = [100,20],
             surface_hide   = true,
             parametric_surface(0.5*u*cos(u)*(cos(v)+1),
                           0.5*u*sin(u)*(cos(v)+1),
                           u*sin(v) - ((u+3)/8*%pi)^2 - 20,
                           u, 0, 13*%pi, v, -%pi, %pi) )$
</pre></div>
</dd></dl>




<a name="Item_003a-draw_002fdeffn_002fpoints"></a><dl>
<dt><a name="index-points"></a>Objeto gráfico: <strong>points</strong> <em>([[<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>],...])</em></dt>
<dt><a name="index-points-1"></a>Objeto gráfico: <strong>points</strong> <em>([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...])</em></dt>
<dt><a name="index-points-2"></a>Objeto gráfico: <strong>points</strong> <em>([<var>y1</var>,<var>y2</var>,...])</em></dt>
<dt><a name="index-points-3"></a>Objeto gráfico: <strong>points</strong> <em>([[<var>x1</var>,<var>y1</var>,<var>z1</var>], [<var>x2</var>,<var>y2</var>,<var>z2</var>],...])</em></dt>
<dt><a name="index-points-4"></a>Objeto gráfico: <strong>points</strong> <em>([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...], [<var>z1</var>,<var>z2</var>,...])</em></dt>
<dt><a name="index-points-5"></a>Objeto gráfico: <strong>points</strong> <em>(<var>matrix</var>)</em></dt>
<dt><a name="index-points-6"></a>Objeto gráfico: <strong>points</strong> <em>(<var>1d_y_array</var>)</em></dt>
<dt><a name="index-points-7"></a>Objeto gráfico: <strong>points</strong> <em>(<var>1d_x_array</var>, <var>1d_y_array</var>)</em></dt>
<dt><a name="index-points-8"></a>Objeto gráfico: <strong>points</strong> <em>(<var>1d_x_array</var>, <var>1d_y_array</var>, <var>1d_z_array</var>)</em></dt>
<dt><a name="index-points-9"></a>Objeto gráfico: <strong>points</strong> <em>(<var>2d_xy_array</var>)</em></dt>
<dt><a name="index-points-10"></a>Objeto gráfico: <strong>points</strong> <em>(<var>2d_xyz_array</var>)</em></dt>
<dd>
<p>Dibuja puntos en 2D y 3D.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>point_size</code>, 
<code>point_type</code>, <code>points_joined</code>, <code>line_width</code>, <code>key</code>,
<code>line_type</code> y <code>color</code>. En modo 3D también se ve afectado por <code>enhanced3d</code>.
</p>
<p><b>2D</b>
</p>
<p><code>points ([[<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>],...])</code> o 
<code>points ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...])</code>
dibuja los puntos <code>[<var>x1</var>,<var>y1</var>]</code>, <code>[<var>x2</var>,<var>y2</var>]</code>, etc. Si no se dan las abscisas,
éstas se asignan automáticamente a enteros positivos consecutivos, de forma que
<code>points([<var>y1</var>,<var>y2</var>,...])</code> dibuja los puntos <code>[1,<var>y1</var>]</code>, <code>[2,<var>y2</var>]</code>, etc.
Si <var>matrix</var> es una matriz de dos columnas o de dos filas, <code>points (<var>matrix</var>)</code>
dibuja los puntos asociados.
</p>
<p>Si <var>1d_y_array</var> es un array lisp de números en 1D, <code>points (<var>1d_y_array</var>)</code>
los dibujará asignando las abscisas a números enteros consecutivos.
<code>points (<var>1d_x_array</var>, <var>1d_y_array</var>)</code> dibuja los puntos cuyas coordenadas
se toman de los dos arrays pasados como argumentos. Si <var>2d_xy_array</var> es un array lisp
2D de dos filas, o de dos columnas, <code>points (<var>2d_xy_array</var>)</code> dibuja los correspondientes
puntos del plano.
</p>
<p>Ejemplos:
</p>
<p>Dos tipos de argumentos para <code>points</code>, una lista de pares ordenados
y dos listas con las coordenadas separadas.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        key = &quot;Small points&quot;,
        points(makelist([random(20),random(50)],k,1,10)),
        point_type    = circle,
        point_size    = 3,
        points_joined = true,
        key           = &quot;Great points&quot;,
        points(makelist(k,k,1,20),makelist(random(30),k,1,20)),
        point_type    = filled_down_triangle,
        key           = &quot;Automatic abscissas&quot;,
        color         = red,
        points([2,12,8]))$
</pre></div>

<p>Dibujando impulsos.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        points_joined = impulses,
        line_width    = 2,
        color         = red,
        points(makelist([random(20),random(50)],k,1,10)))$
</pre></div>

<p>Array con ordenadas.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) a: make_array (flonum, 100) $
(%i3) for i:0 thru 99 do a[i]: random(1.0) $
(%i4) draw2d(points(a)) $
</pre></div>

<p>Dos arrays con coordenadas separadas.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) x: make_array (flonum, 100) $
(%i3) y: make_array (fixnum, 100) $
(%i4) for i:0 thru 99 do (
        x[i]: float(i/100),
        y[i]: random(10) ) $
(%i5) draw2d(points(x, y)) $
</pre></div>

<p>Un array 2D de dos columnas.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) xy: make_array(flonum, 100, 2) $
(%i3) for i:0 thru 99 do (
        xy[i, 0]: float(i/100),
        xy[i, 1]: random(10) ) $
(%i4) draw2d(points(xy)) $
</pre></div>

<p>Dibujando un array rellenado con la función <code>read_array</code>.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) a: make_array(flonum,100) $
(%i3) read_array (file_search (&quot;pidigits.data&quot;), a) $
(%i4) draw2d(points(a)) $
</pre></div>

<p><b>3D</b>
</p>
<p><code>points ([[<var>x1</var>,<var>y1</var>,<var>z1</var>], [<var>x2</var>,<var>y2</var>,<var>z2</var>],...])</code> o 
<code>points ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...], [<var>z1</var>,<var>z2</var>,...])</code>
dibuja los puntos <code>[<var>x1</var>,<var>y1</var>,<var>z1</var>]</code>, <code>[<var>x2</var>,<var>y2</var>,<var>z2</var>]</code>, etc.
Si <var>matrix</var> es una matriz de tres columnas o de tres filas, <code>points (<var>matrix</var>)</code>
dibuja los puntos asociados. Si <var>matrix</var> es una matriz columna o fila, las abscisas 
se asignan automáticamente. 
</p>
<p>En caso de que los argumentos sean arrays lisp, <code>points (<var>1d_x_array</var>, <var>1d_y_array</var>, <var>1d_z_array</var>)</code>
toma las coordenadas de los tres arrays unidimensionales. Si <var>2d_xyz_array</var> es un array 2D de tres columnas,
o de tres filas, entonces <code>points (<var>2d_xyz_array</var>)</code> dibuja los puntos correspondientes.
</p>
<p>Ejemplos:
</p>
<p>Una muestra tridimensional,
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) load (&quot;numericalio&quot;)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) draw3d(title = &quot;Daily average wind speeds&quot;,
             point_size = 2,
             points(args(submatrix (s2, 4, 5))) )$
</pre></div>

<p>Dos muestras tridimensionales,
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) load (&quot;numericalio&quot;)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) draw3d(
         title = &quot;Daily average wind speeds. Two data sets&quot;,
         point_size = 2,
         key        = &quot;Sample from stations 1, 2 and 3&quot;,
         points(args(submatrix (s2, 4, 5))),
         point_type = 4,
         key        = &quot;Sample from stations 1, 4 and 5&quot;,
         points(args(submatrix (s2, 2, 3))) )$
</pre></div>

<p>Arrays unidimensionales,
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) x: make_array (fixnum, 10) $
(%i3) y: make_array (fixnum, 10) $
(%i4) z: make_array (fixnum, 10) $
(%i5) for i:0 thru 9 do (
        x[i]: random(10),
        y[i]: random(10),
        z[i]: random(10) ) $
(%i6) draw3d(points(x,y,z)) $
</pre></div>

<p>Array bidimensional coloreado,
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) xyz: make_array(fixnum, 10, 3) $
(%i3) for i:0 thru 9 do (
        xyz[i, 0]: random(10),
        xyz[i, 1]: random(10),
        xyz[i, 2]: random(10) ) $
(%i4) draw3d(
         enhanced3d = true,
         points_joined = true,
         points(xyz)) $
</pre></div>

<p>Números de colores especificados explícitamente
por el usuario.
</p><div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) pts: makelist([t,t^2,cos(t)], t, 0, 15)$
(%i3) col_num: makelist(k, k, 1, length(pts))$
(%i4) draw3d(
        enhanced3d = ['part(col_num,k),k],
        point_size = 3,
        point_type = filled_circle,
        points(pts))$
</pre></div>
</dd></dl>




<a name="Item_003a-draw_002fdeffn_002fpolar"></a><dl>
<dt><a name="index-polar"></a>Objeto gráfico: <strong>polar</strong> <em>(<var>radius</var>,<var>ang</var>,<var>minang</var>,<var>maxang</var>)</em></dt>
<dd><p>Dibuja funciones 2D definidas en coordenadas polares.
</p>
<p><b>2D</b>
</p>
<p><code>polar (<var>radius</var>,<var>ang</var>,<var>minang</var>,<var>maxang</var>)</code> dibuja la función
<code><var>radius</var>(<var>ang</var>)</code> definida en coordenadas polares, con la variable 
<var>ang</var> tomando valores desde <var>minang</var> hasta <var>maxang</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>nticks</code>, 
<code>line_width</code>, <code>line_type</code>, <code>key</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(user_preamble = &quot;set grid polar&quot;,
             nticks        = 200,
             xrange        = [-5,5],
             yrange        = [-5,5],
             color         = blue,
             line_width    = 3,
             title         = &quot;Hyperbolic Spiral&quot;,
             polar(10/theta,theta,1,10*%pi) )$
</pre></div>
</dd></dl>





<a name="Item_003a-draw_002fdeffn_002fpolygon"></a><dl>
<dt><a name="index-polygon"></a>Objeto gráfico: <strong>polygon</strong> <em>([[<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>],...])</em></dt>
<dt><a name="index-polygon-1"></a>Objeto gráfico: <strong>polygon</strong> <em>([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...])</em></dt>
<dd><p>Dibuja polígonos en 2D.
</p>
<p><b>2D</b>
</p>
<p><code>polygon ([[<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>],...])</code> o 
<code>polygon ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...])</code>:
dibuja en el plano un polígono de vértices 
<code>[<var>x1</var>,<var>y1</var>]</code>, <code>[<var>x2</var>,<var>y2</var>]</code>, etc..
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>transparent</code>, 
<code>fill_color</code>, <code>border</code>, <code>line_width</code>, <code>key</code>,
 <code>line_type</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(color      = &quot;#e245f0&quot;,
             line_width = 8,
             polygon([[3,2],[7,2],[5,5]]),
             border      = false,
             fill_color  = yellow,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdeffn_002fquadrilateral"></a><dl>
<dt><a name="index-quadrilateral"></a>Objeto gráfico: <strong>quadrilateral</strong> <em>(<var>point_1</var>, <var>point_2</var>, <var>point_3</var>, <var>point_4</var>)</em></dt>
<dd><p>Dibuja un cuadrilátero.
</p>
<p><b>2D</b>
</p>
<p><code>quadrilateral ([<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>], [<var>x3</var>,<var>y3</var>], [<var>x4</var>,<var>y4</var>])</code> dibuja un cuadrilátero de vértices <code>[<var>x1</var>,<var>y1</var>]</code>, 
<code>[<var>x2</var>,<var>y2</var>]</code>, <code>[<var>x3</var>,<var>y3</var>]</code> y <code>[<var>x4</var>,<var>y4</var>]</code>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>transparent</code>, 
<code>fill_color</code>, <code>border</code>, <code>line_width</code>, <code>key</code>, <code>xaxis_secondary</code>, 
<code>yaxis_secondary</code>, <code>line_type</code>, <code>transform</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        quadrilateral([1,1],[2,2],[3,-1],[2,-2]))$
</pre></div>

<p><b>3D</b>
</p>
<p><code>quadrilateral ([<var>x1</var>,<var>y1</var>,<var>z1</var>], [<var>x2</var>,<var>y2</var>,<var>z2</var>], [<var>x3</var>,<var>y3</var>,<var>z3</var>], [<var>x4</var>,<var>y4</var>,<var>z4</var>])</code> dibuja un cuadrilátero de vértices
<code>[<var>x1</var>,<var>y1</var>,<var>z1</var>]</code>, <code>[<var>x2</var>,<var>y2</var>,<var>z2</var>]</code>,
<code>[<var>x3</var>,<var>y3</var>,<var>z3</var>]</code> y <code>[<var>x4</var>,<var>y4</var>,<var>z4</var>]</code>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>line_type</code>, 
<code>line_width</code>, <code>color</code>, <code>key</code>, <code>enhanced3d</code> y <code>transform</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdeffn_002frectangle"></a><dl>
<dt><a name="index-rectangle"></a>Objeto gráfico: <strong>rectangle</strong> <em>([<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>])</em></dt>
<dd><p>Dibuja rectángulos en 2D.
</p>
<p><b>2D</b>
</p>
<p><code>rectangle ([<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>])</code> dibuja un rectángulo de vértices opuestos
<code>[<var>x1</var>,<var>y1</var>]</code> y <code>[<var>x2</var>,<var>y2</var>]</code>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>transparent</code>, 
<code>fill_color</code>, <code>border</code>, <code>line_width</code>, <code>key</code>,
<code>line_type</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(fill_color  = red,
             line_width  = 6,
             line_type   = dots,
             transparent = false,
             fill_color  = blue,
             rectangle([-2,-2],[8,-1]), /* opposite vertices */
             transparent = true,
             line_type   = solid,
             line_width  = 1,
             rectangle([9,4],[2,-1.5]),
             xrange      = [-3,10],
             yrange      = [-3,4.5] )$
</pre></div>
</dd></dl>






<a name="Item_003a-draw_002fdeffn_002fregion"></a><dl>
<dt><a name="index-region"></a>Objeto gráfico: <strong>region</strong> <em>(<var>expr</var>,<var>var1</var>,<var>minval1</var>,<var>maxval1</var>,<var>var2</var>,<var>minval2</var>,<var>maxval2</var>)</em></dt>
<dd><p>Dibuja una región del plano definida por desigualdades.
</p>
<p><b>2D</b>
<var>expr</var> es una expresión formada por desigualdades y los operadores lógicos
<code>and</code>, <code>or</code> y <code>not</code>. La región está acotada por el rectángulo
definido por <em>[<var>minval1</var>, <var>maxval1</var>]</em> y
<em>[<var>minval2</var>, <var>maxval2</var>]</em>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>fill_color</code>, 
<code>key</code>, <code>x_voxel</code> y <code>y_voxel</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        x_voxel = 30,
        y_voxel = 30,
        region(x^2+y^2&lt;1 and x^2+y^2 &gt; 1/2,
               x, -1.5, 1.5, y, -1.5, 1.5));
</pre></div>
</dd></dl>





<a name="Item_003a-draw_002fdeffn_002fspherical"></a><dl>
<dt><a name="index-spherical"></a>Objeto gráfico: <strong>spherical</strong> <em>(<var>radius</var>,<var>azi</var>,<var>minazi</var>,<var>maxazi</var>,<var>zen</var>,<var>minzen</var>,<var>maxzen</var>)</em></dt>
<dd><p>Dibuja funciones 3D definidas en coordenadas esféricas.
</p>
<p><b>3D</b>
</p>
<p><code>spherical (<var>radius</var>,<var>azi</var>,<var>minazi</var>,<var>maxazi</var>,<var>zen</var>,<var>minzen</var>,<var>maxzen</var>)</code>
dibuja la función <code><var>radius</var>(<var>azi</var>,<var>zen</var>)</code> definida en coordenadas esféricas, con el <i>azimut</i>
<var>azi</var> tomando valores desde <var>minazi</var> hasta <var>maxazi</var> y el <i>zenit</i> <var>zen</var> tomando valores desde
<var>minzen</var> hasta <var>maxzen</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>key</code>, <code>wired_surface</code>, <code>enhanced3d</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(spherical(1,a,0,2*%pi,z,0,%pi))$
</pre></div>
</dd></dl>



<a name="Item_003a-draw_002fdeffn_002ftriangle"></a><dl>
<dt><a name="index-triangle"></a>Objeto gráfico: <strong>triangle</strong> <em>(<var>punto_1</var>, <var>punto_2</var>, <var>punto_3</var>)</em></dt>
<dd><p>Dibuja un triángulo.
</p>
<p><b>2D</b>
</p>
<p><code>triangle ([<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>], [<var>x3</var>,<var>y3</var>])</code> dibuja
un triángulo de vértices <code>[<var>x1</var>,<var>y1</var>]</code>, <code>[<var>x2</var>,<var>y2</var>]</code> y
<code>[<var>x3</var>,<var>y3</var>]</code>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>transparent</code>, 
<code>fill_color</code>, <code>border</code>, <code>line_width</code>, <code>key</code>, <code>xaxis_secondary</code>, 
<code>yaxis_secondary</code>, <code>line_type</code>, <code>transform</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(
        triangle([1,1],[2,2],[3,-1]))$
</pre></div>

<p><b>3D</b>
</p>
<p><code>triangle ([<var>x1</var>,<var>y1</var>,<var>z1</var>], [<var>x2</var>,<var>y2</var>,<var>z2</var>], [<var>x3</var>,<var>y3</var>,<var>z3</var>])</code> dibuja un triángulo de vértices <code>[<var>x1</var>,<var>y1</var>,<var>z1</var>]</code>,
<code>[<var>x2</var>,<var>y2</var>,<var>z2</var>]</code> y <code>[<var>x3</var>,<var>y3</var>,<var>z3</var>]</code>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>line_type</code>, 
<code>line_width</code>, <code>color</code>, <code>key</code>, <code>enhanced3d</code> y <code>transform</code>.
</p></dd></dl>



<a name="Item_003a-draw_002fdeffn_002ftube"></a><dl>
<dt><a name="index-tube"></a>Objeto gráfico: <strong>tube</strong> <em>(<var>xfun</var>,<var>yfun</var>,<var>zfun</var>,<var>rfun</var>,<var>p</var>,<var>pmin</var>,<var>pmax</var>)</em></dt>
<dd><p>Dibuja un tubo en 3D de diámetro variable.
</p>
<p><b>3D</b>
</p>
<p><code>[<var>xfun</var>,<var>yfun</var>,<var>zfun</var>]</code>
es la curva paramétrica de parámetro <var>p</var>, el cual toma valores entre
<var>pmin</var> y <var>pmax</var>. Se colocan círculos de radio <var>rfun</var>
con sus centros sobre la curva paramétrica y perpendiculares a ella.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>line_width</code>, <code>key</code>, <code>wired_surface</code>, <code>enhanced3d</code>,
<code>color</code> y <code>capping</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(
        enhanced3d = true,
        xu_grid    = 50,
        tube(cos(a), a, 0, cos(a/10)^2,
             a, 0, 4*%pi) )$
</pre></div>

</dd></dl>




<a name="Item_003a-draw_002fdeffn_002fvector"></a><dl>
<dt><a name="index-vector"></a>Objeto gráfico: <strong>vector</strong> <em>([<var>x</var>,<var>y</var>], [<var>dx</var>,<var>dy</var>])</em></dt>
<dt><a name="index-vector-1"></a>Objeto gráfico: <strong>vector</strong> <em>([<var>x</var>,<var>y</var>,<var>z</var>], [<var>dx</var>,<var>dy</var>,<var>dz</var>])</em></dt>
<dd><p>Dibuja vectores en 2D y 3D.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gráficas</i>: <code>head_both</code>, 
<code>head_length</code>, <code>head_angle</code>, <code>head_type</code>, <code>line_width</code>, 
<code>line_type</code>, <code>key</code> y <code>color</code>.
</p>
<p><b>2D</b>
</p>
<p><code>vector ([<var>x</var>,<var>y</var>], [<var>dx</var>,<var>dy</var>])</code> dibuja el vector 
<code>[<var>dx</var>,<var>dy</var>]</code> con origen en <code>[<var>x</var>,<var>y</var>]</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,10],
             head_length = 1,
             vector([0,1],[5,5]), /* default type */
             head_type = 'empty,
             vector([3,1],[5,5]),
             head_both = true,
             head_type = 'nofilled,
             line_type = dots,
             vector([6,1],[5,5]))$
</pre></div>

<p><b>3D</b>
</p>
<p><code>vector([<var>x</var>,<var>y</var>,<var>z</var>], [<var>dx</var>,<var>dy</var>,<var>dz</var>])</code>
dibuja el vector <code>[<var>dx</var>,<var>dy</var>,<var>dz</var>]</code> con 
origen en <code>[<var>x</var>,<var>y</var>,<var>z</var>]</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) load(&quot;draw&quot;)$
(%i2) draw3d(color = cyan,
             vector([0,0,0],[1,1,1]/sqrt(3)),
             vector([0,0,0],[1,-1,0]/sqrt(2)),
             vector([0,0,0],[1,1,-2]/sqrt(6)) )$
</pre></div>
</dd></dl>










<a name="Item_003a-draw_002fnode_002fFunciones-y-variables-para-picture"></a><hr>
<div class="header">
<p>
Siguiente: <a href="maxima_201.html#Funciones-y-variables-para-picture" accesskey="n" rel="next">Funciones y variables para picture</a>, Previous: <a href="maxima_199.html#Introducci_00f3n-a-draw" accesskey="p" rel="previous">Introducción a draw</a>, Subir: <a href="maxima_198.html#draw" accesskey="u" rel="up">draw</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="&Iacute;ndice general" rel="contents">&Iacute;ndice general</a>][<a href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" title="&Iacute;ndice" rel="index">&Iacute;ndice</a>]</p>
</div>



</body>
</html>
