<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 6.8, https://www.gnu.org/software/texinfo/ -->
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Funciones y variables para ezunits (Manual de Maxima 5.47.0)</title>

<meta name="description" content="Funciones y variables para ezunits (Manual de Maxima 5.47.0)">
<meta name="keywords" content="Funciones y variables para ezunits (Manual de Maxima 5.47.0)">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta name="viewport" content="width=device-width,initial-scale=1">

<link href="maxima_toc.html" rel="start" title="Top">
<link href="maxima_304.html" rel="index" title="Índice de Funciones y Variables">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="Índice general">
<link href="maxima_210.html" rel="up" title="ezunits">
<link href="maxima_212.html" rel="prev" title="Introducción a physical_constants">
<style type="text/css">
<!--
a.copiable-anchor {visibility: hidden; text-decoration: none; line-height: 0em}
a.summary-letter {text-decoration: none}
blockquote.indentedblock {margin-right: 0em}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
kbd {font-style: oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
span.nolinebreak {white-space: nowrap}
span.roman {font-family: initial; font-weight: normal}
span.sansserif {font-family: sans-serif; font-weight: normal}
span:hover a.copiable-anchor {visibility: visible}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="figures/favicon.ico">
<script src="https://polyfill.io/v3/polyfill.min.js?features=es6>"></script>
<script type='text/javascript'>
MathJax = {
  options: {
    skipHtmlTags: {'[-]': ['pre']},
    ignoreHtmlClass: 'tex2jax_ignore',
    processHtmlClass: 'tex2jax_process'
  },
};
</script><script type="text/javascript" id="MathJax-script" async
  src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-svg.js">
</script>
</head>

<body lang="es" class="tex2jax_ignore">
<div class="section" id="Funciones-y-variables-para-ezunits">
<div class="header">
<p>
Anterior: <a href="maxima_212.html" accesskey="p" rel="prev">Introducción a physical_constants</a>, Subir: <a href="maxima_210.html" accesskey="u" rel="up">ezunits</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Índice general" rel="contents">Índice general</a>][<a href="maxima_304.html" title="Índice" rel="index">Índice</a>]</p>
</div>
<span id="Funciones-y-variables-para-ezunits-1"></span><h3 class="section">50.3 Funciones y variables para ezunits</h3>

<span id="Item_003a-ezunits_002fdeffn_002f_0060"></span><dl class="def">
<dt id="index-_0060"><span class="category">Operador: </span><span><strong>`</strong><a href='#index-_0060' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Operador de magnitud dimensional. 
Una expresión tal como <em class='tex2jax_process'>\(a ` b\)</em> representa una magnitud dimensional, siendo
<code>a</code> una magnitud adimensional y <code>b</code> las unidades.
Se puede utilizar un símbolo como unidad, sin necesidad
de declararlo como tal ni de que deba cumplir propiedades especiales.
Tanto la magnitud como la unidad de una expresión de la forma <em class='tex2jax_process'>\(a ` b\)</em>
pueden extraerse invocando las funciones <code>qty</code> y <code>units</code>,
respectivamente.
</p>
<p>Las operaciones aritméticas con magnitudes dimensionales se realizan
de la forma convencional.
</p>
<ul>
<li> <code>(x ` a) * (y ` b)</code> es igual a <em class='tex2jax_process'>\((x * y) ` (a * b)\)</em>.
</li><li> <code>(x ` a) + (y ` a)</code> es igual a <em class='tex2jax_process'>\((x + y) ` a\)</em>.
</li><li> <code>(x ` a)^y</code> es igual a <em class='tex2jax_process'>\(x^y ` a^y\)</em> si <code>y</code> es adimensional.
</li></ul>

<p><code>ezunits</code> no necesita que las unidades en una suma tengan las mismas 
dimensiones; estos términos serán sumados sin emitirse mensaje de error.
</p>
<p>Para utilizar este operador ejecútese primero <code>load(&quot;ezunits&quot;)</code>.
</p>
<p>Ejemplos:
</p>
<p>Unidades del Sistema Internacional.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) foo : 10 ` m;
(%o2)                        10 ` m
(%i3) qty (foo);
(%o3)                          10
(%i4) units (foo);
(%o4)                           m
(%i5) dimensions (foo);
(%o5)                        length
</pre></div>


<p>Unidades definidas por el usuario.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) bar : x ` acre;
(%o2)                       x ` acre
(%i3) dimensions (bar);
                                   2
(%o3)                        length
(%i4) fundamental_units (bar);
                                2
(%o4)                          m
</pre></div>

<p>Unidades ad hoc.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) baz : 3 ` sheep + 8 ` goat + 1 ` horse;
(%o2)           8 ` goat + 3 ` sheep + 1 ` horse
(%i3) subst ([sheep = 3*goat, horse = 10*goat], baz);
(%o3)                       27 ` goat
(%i4) baz2 : 1000`gallon/fortnight;
                                gallon
(%o4)                   1000 ` ---------
                               fortnight
(%i5) subst (fortnight = 14*day, baz2);
                          500   gallon
(%o5)                     --- ` ------
                           7     day
</pre></div>


<p>Operaciones aritméticas y magnitudes dimensionales.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) 100 ` kg + 200 ` kg;
(%o2)                       300 ` kg
(%i3) 100 ` m^3 - 100 ` m^3;
                                  3
(%o3)                        0 ` m
(%i4) (10 ` kg) * (17 ` m/s^2);
                                 kg m
(%o4)                      170 ` ----
                                   2
                                  s
(%i5) (x ` m) / (y ` s);
                              x   m
(%o5)                         - ` -
                              y   s
(%i6) (a ` m)^2;
                              2    2
(%o6)                        a  ` m
</pre></div>


</dd></dl>

<span id="Item_003a-ezunits_002fdeffn_002f_0060_0060"></span><dl class="def">
<dt id="index-_0060_0060"><span class="category">Operador: </span><span><strong>`<!-- /@w -->`</strong><a href='#index-_0060_0060' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Operador de conversión de unidades.
Una expresión tal como <em class='math'>a ` b `<!-- /@w -->` c</em> convierte las unidades <code>b</code>
en <code>c</code>. El paquete <code>ezunits</code> contiene funciones conversoras para
unidades fundamentales del SI, unidades derivadas, así como
algunas otras unidades ajenas al SI.
Las conversiones entre unidades que no estén programadas en <code>ezunits</code>
podrán declararse a posteriori.
Las conversiones conocidas por <code>ezunits</code> están especificadas en la
variable global <code>known_unit_conversions</code>, incluyendo tanto las ya
declaradas por defecto como aquéllas introducidas por el usuario.
Las conversiones para los productos, cocientes y potencias de unidades
se derivan del conjunto de conversiones ya conocidas.
</p>
<p>No hay un sistema de representación de unidades que se considere preferible,
razón por la cual las unidades no se convierten a otras a menos que se
indique de forma explícita. Del mismo modo, <code>ezunits</code>
no transforma prefijos (milli-, centi-, deci-, etc) a menos que se le
indique.
</p>
<p>Para utilizar este operador ejecútese primero <code>load(&quot;ezunits&quot;)</code>.
</p>
<p>Ejemplos:
</p>
<p>Conjunto de conversiones conocidas.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) display2d : false$
(%i3) known_unit_conversions;
(%o3) {acre = 4840*yard^2,Btu = 1055*J,cfm = feet^3/minute,
       cm = m/100,day = 86400*s,feet = 381*m/1250,ft = feet,
       g = kg/1000,gallon = 757*l/200,GHz = 1000000000*Hz,
       GOhm = 1000000000*Ohm,GPa = 1000000000*Pa,
       GWb = 1000000000*Wb,Gg = 1000000*kg,Gm = 1000000000*m,
       Gmol = 1000000*mol,Gs = 1000000000*s,ha = hectare,
       hectare = 100*m^2,hour = 3600*s,Hz = 1/s,inch = feet/12,
       km = 1000*m,kmol = 1000*mol,ks = 1000*s,l = liter,
       lbf = pound_force,lbm = pound_mass,liter = m^3/1000,
       metric_ton = Mg,mg = kg/1000000,MHz = 1000000*Hz,
       microgram = kg/1000000000,micrometer = m/1000000,
       micron = micrometer,microsecond = s/1000000,
       mile = 5280*feet,minute = 60*s,mm = m/1000,
       mmol = mol/1000,month = 2629800*s,MOhm = 1000000*Ohm,
       MPa = 1000000*Pa,ms = s/1000,MWb = 1000000*Wb,
       Mg = 1000*kg,Mm = 1000000*m,Mmol = 1000000000*mol,
       Ms = 1000000*s,ns = s/1000000000,ounce = pound_mass/16,
       oz = ounce,Ohm = s*J/C^2,
       pound_force = 32*ft*pound_mass/s^2,
       pound_mass = 200*kg/441,psi = pound_force/inch^2,
       Pa = N/m^2,week = 604800*s,Wb = J/A,yard = 3*feet,
       year = 31557600*s,C = s*A,F = C^2/J,GA = 1000000000*A,
       GC = 1000000000*C,GF = 1000000000*F,GH = 1000000000*H,
       GJ = 1000000000*J,GK = 1000000000*K,GN = 1000000000*N,
       GS = 1000000000*S,GT = 1000000000*T,GV = 1000000000*V,
       GW = 1000000000*W,H = J/A^2,J = m*N,kA = 1000*A,
       kC = 1000*C,kF = 1000*F,kH = 1000*H,kHz = 1000*Hz,
       kJ = 1000*J,kK = 1000*K,kN = 1000*N,kOhm = 1000*Ohm,
       kPa = 1000*Pa,kS = 1000*S,kT = 1000*T,kV = 1000*V,
       kW = 1000*W,kWb = 1000*Wb,mA = A/1000,mC = C/1000,
       mF = F/1000,mH = H/1000,mHz = Hz/1000,mJ = J/1000,
       mK = K/1000,mN = N/1000,mOhm = Ohm/1000,mPa = Pa/1000,
       mS = S/1000,mT = T/1000,mV = V/1000,mW = W/1000,
       mWb = Wb/1000,MA = 1000000*A,MC = 1000000*C,
       MF = 1000000*F,MH = 1000000*H,MJ = 1000000*J,
       MK = 1000000*K,MN = 1000000*N,MS = 1000000*S,
       MT = 1000000*T,MV = 1000000*V,MW = 1000000*W,
       N = kg*m/s^2,R = 5*K/9,S = 1/Ohm,T = J/(m^2*A),V = J/C,
       W = J/s}
</pre></div>


<p>Converiones de unidades fundamentales.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) 1 ` ft `` m;
Computing conversions to base units; may take a moment. 
                            381
(%o2)                       ---- ` m
                            1250
(%i3) %, numer;
(%o3)                      0.3048 ` m
(%i4) 1 ` kg `` lbm;
                            441
(%o4)                       --- ` lbm
                            200
(%i5) %, numer;
(%o5)                      2.205 ` lbm
(%i6) 1 ` W `` Btu/hour;
                           720   Btu
(%o6)                      --- ` ----
                           211   hour
(%i7) %, numer;
                                        Btu
(%o7)               3.412322274881517 ` ----
                                        hour
(%i8) 100 ` degC `` degF;
(%o8)                      212 ` degF
(%i9) -40 ` degF `` degC;
(%o9)                     (- 40) ` degC
(%i10) 1 ` acre*ft `` m^3;
                        60228605349    3
(%o10)                  ----------- ` m
                         48828125
(%i11) %, numer;
                                          3
(%o11)                1233.48183754752 ` m
</pre></div>

<p>Transformando pies a metros y viceversa.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) 100 ` m + 100 ` ft;
(%o2)                  100 ` m + 100 ` ft
(%i3) (100 ` m + 100 ` ft) `` ft;
                           163100
(%o3)                      ------ ` ft
                            381
(%i4) %, numer;
(%o4)                428.0839895013123 ` ft
(%i5) (100 ` m + 100 ` ft) `` m;
                            3262
(%o5)                       ---- ` m
                             25
(%i6) %, numer;
(%o6)                      130.48 ` m
</pre></div>

<p>Análisis dimensional para encontrar dimensiones y unidades fundamentales.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) foo : 1 ` acre * ft;
(%o2)                      1 ` acre ft
(%i3) dimensions (foo);
                                   3
(%o3)                        length
(%i4) fundamental_units (foo);
                                3
(%o4)                          m
(%i5) foo `` m^3;
                        60228605349    3
(%o5)                   ----------- ` m
                         48828125
(%i6) %, numer;
                                          3
(%o6)                 1233.48183754752 ` m
</pre></div>

<p>Declaración de conversiones.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) declare_unit_conversion (MMBtu = 10^6*Btu, kW = 1000*W);
(%o2)                         done
(%i3) declare_unit_conversion (kWh = kW*hour, MWh = 1000*kWh,
                               bell = 1800*s);
(%o3)                         done
(%i4) 1 ` kW*s `` MWh;
Computing conversions to base units; may take a moment. 
                             1
(%o4)                     ------- ` MWh
                          3600000
(%i5) 1 ` kW/m^2 `` MMBtu/bell/ft^2;
                       1306449      MMBtu
(%o5)                 ---------- ` --------
                      8242187500          2
                                   bell ft
</pre></div>
</dd></dl>

<span id="Item_003a-ezunits_002fdeffn_002fconstvalue"></span><dl class="def">
<dt id="index-constvalue"><span class="category">Función: </span><span><strong>constvalue</strong> <em>(<var>x</var>)</em><a href='#index-constvalue' class='copiable-anchor'> &para;</a></span></dt>
<dd><span id="Item_003a-ezunits_002fdeffn_002fdeclare_005fconstvalue"></span></dd><dt id="index-declare_005fconstvalue"><span class="category">Función: </span><span><strong>declare_constvalue</strong> <em>(<var>a</var>, <var>x</var>)</em><a href='#index-declare_005fconstvalue' class='copiable-anchor'> &para;</a></span></dt>
<dd><span id="Item_003a-ezunits_002fdeffn_002fremove_005fconstvalue"></span></dd><dt id="index-remove_005fconstvalue"><span class="category">Función: </span><span><strong>remove_constvalue</strong> <em>(<var>a</var>)</em><a href='#index-remove_005fconstvalue' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve la constante declarada para un símbolo.
Los valores constantes se declaran con <code>declare_constvalue</code>.
</p>
<p>Los valores constantes reconocidos por <code>constvalue</code>
son distintos de los valores declarados por <code>numerval</code>
y reconocidos por <code>constantp</code>.
</p>
<p>El paquete <code>physical_units</code> declara los valores constantes
de las constantes físicas.
</p>
<p><code>remove_constvalue</code> deshace la acción de <code>declare_constvalue</code>.
</p>
<p>Para utilizar estas funciones ejecútese primero <code>load(&quot;ezunits&quot;)</code>.
</p>
<p>Ejemplos:
</p>
<p>Valor de una constante física.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;physical_constants&quot;)$
(%i2) constvalue (%G);
                                     3
                                    m
(%o2)                    6.67428 ` -----
                                       2
                                   kg s
(%i3) get ('%G, 'description);
(%o3)           Newtonian constant of gravitation
</pre></div>

<p>Declarando una nueva constante.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) declare_constvalue (FOO, 100 ` lbm / acre);
                                 lbm
(%o2)                      100 ` ----
                                 acre
(%i3) FOO * (50 ` acre);
(%o3)                     50 FOO ` acre
(%i4) constvalue (%);
(%o4)                      5000 ` lbm
</pre></div>

</dd></dl>

<span id="Item_003a-ezunits_002fdeffn_002funits"></span><dl class="def">
<dt id="index-units"><span class="category">Función: </span><span><strong>units</strong> <em>(<var>x</var>)</em><a href='#index-units' class='copiable-anchor'> &para;</a></span></dt>
<dd><span id="Item_003a-ezunits_002fdeffn_002fdeclare_005funits"></span></dd><dt id="index-declare_005funits"><span class="category">Función: </span><span><strong>declare_units</strong> <em>(<var>a</var>, <var>u</var>)</em><a href='#index-declare_005funits' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve las unidades de la magnitud dimensional <var>x</var>,
o 1 en caso de que <var>x</var> sea adimensional.
</p>
<p><var>x</var> puede ser una expresión literal dimensional <em class='tex2jax_process'>\(a ` b\)</em>,
un símbolo con unidades declaradas por
medio de <code>declare_units</code>, o una expresión 
que contenga cualquiera o ambos de los anteriores.
</p>
<p><code>declare_constvalue</code> declara que <code>units(<var>a</var>)</code>
debe devolver <var>u</var>, siendo <var>u</var> una expresión.
</p>
<p>Para utilizar estas funciones ejecútese primero <code>load(&quot;ezunits&quot;)</code>.
</p>
<p>Ejemplos:
</p>
<p><code>units</code> aplicado a expresiones dimensionales literales.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) foo : 100 ` kg;
(%o2)                              100 ` kg
(%i3) bar : x ` m/s;
                                         m
(%o3)                                x ` -
                                         s
(%i4) units (foo);
(%o4)                                 kg
(%i5) units (bar);
                                       m
(%o5)                                  -
                                       s
(%i6) units (foo * bar);
                                     kg m
(%o6)                                ----
                                      s
(%i7) units (foo / bar);
                                     kg s
(%o7)                                ----
                                      m
(%i8) units (foo^2);
                                        2
(%o8)                                 kg
</pre></div>

<p><code>units</code> aplicado a símbolos con unidades declaradas.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) linenum:0;
(%o0)                                  0
(%i1) units (aa);
(%o1)                                  1
(%i2) declare_units (aa, J);
(%o2)                                  J
(%i3) units (aa);
(%o3)                                  J
(%i4) units (aa^2);
                                       2
(%o4)                                 J
(%i5) foo : 100 ` kg;
(%o5)                              100 ` kg
(%i6) units (aa * foo);
(%o6)                                kg J
</pre></div>

</dd></dl>

<span id="Item_003a-ezunits_002fdeffn_002fqty"></span><dl class="def">
<dt id="index-qty"><span class="category">Función: </span><span><strong>qty</strong> <em>(<var>x</var>)</em><a href='#index-qty' class='copiable-anchor'> &para;</a></span></dt>
<dd><span id="Item_003a-ezunits_002fdeffn_002fdeclare_005fqty"></span></dd><dt id="index-declare_005fqty"><span class="category">Función: </span><span><strong>declare_qty</strong> <em>(<var>a</var>, <var>x</var>)</em><a href='#index-declare_005fqty' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p><code>qty</code> devuelve la parte adimensional de la magnitud dimensional <var>x</var>,
o <var>x</var>, si <var>x</var> es adimensional.
<var>x</var> puede ser una expresión literal dimensional <em class='tex2jax_process'>\(a ` b\)</em>,
un símbolo con unidades declaradas o una expresión 
que contenga cualquiera o ambos de los anteriores.
</p>
<p><code>declare_qty</code> declara que <code>qty(<var>a</var>)</code>
debe devolver <var>x</var>, siendo <var>x</var> una magnitud dimensional.
</p>
<p>Para utilizar estas funciones ejecútese primero <code>load(&quot;ezunits&quot;)</code>.
</p>
<p>Ejemplos:
</p>
<p><code>qty</code> aplicado a expresiones dimensionales literales.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) foo : 100 ` kg;
(%o2)                       100 ` kg
(%i3) qty (foo);
(%o3)                          100
(%i4) bar : v ` m/s;
                                  m
(%o4)                         v ` -
                                  s
(%i5) foo * bar;
                                  kg m
(%o5)                     100 v ` ----
                                   s
(%i6) qty (foo * bar);
(%o6)                         100 v
</pre></div>

<p><code>qty</code> aplicado a símbolos con unidades declaradas.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) declare_qty (aa, xx);
(%o2)                          xx
(%i3) qty (aa);
(%o3)                          xx
(%i4) qty (aa^2);
                                 2
(%o4)                          xx
(%i5) foo : 100 ` kg;
(%o5)                       100 ` kg
(%i6) qty (aa * foo);
(%o6)                        100 xx
</pre></div>

</dd></dl>

<span id="Item_003a-ezunits_002fdeffn_002funitp"></span><dl class="def">
<dt id="index-unitp"><span class="category">Función: </span><span><strong>unitp</strong> <em>(<var>x</var>)</em><a href='#index-unitp' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve <code>true</code> si <var>x</var> es una expresión dimensional
literal, un símbolo declarado como dimensional o
una expresión en la que su operador principal ha sido declarado
como dimensional. En cualquier otro caso, <code>unitp</code> devuelve
<code>false</code>.
</p>
<p>Para utilizar esta función ejecútese primero <code>load(&quot;ezunits&quot;)</code>.
</p>
<p>Ejemplos:
</p>
<p><code>unitp</code> aplicado a expresiones dimensionales literales.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) unitp (100 ` kg);
(%o2)                         true
</pre></div>

<p><code>unitp</code> applied to a symbol declared dimensional.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) unitp (foo);
(%o2)                         false
(%i3) declare (foo, dimensional);
(%o3)                         done
(%i4) unitp (foo);
(%o4)                         true
</pre></div>

<p><code>unitp</code> aplicado a una expresión en la que el operador
principal se declara dimensional.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) unitp (bar (x, y, z));
(%o2)                         false
(%i3) declare (bar, dimensional);
(%o3)                         done
(%i4) unitp (bar (x, y, z));
(%o4)                         true
</pre></div>

</dd></dl>

<span id="Item_003a-ezunits_002fdeffn_002fdeclare_005funit_005fconversion"></span><dl class="def">
<dt id="index-declare_005funit_005fconversion"><span class="category">Función: </span><span><strong>declare_unit_conversion</strong> <em>(<var>u</var> = <var>v</var>, ...)</em><a href='#index-declare_005funit_005fconversion' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Añade las ecuaciones <var>u</var> = <var>v</var>, ... a la lista de conversiones
de unidades conocidas por el operador de conversión <em class='math'>`<!-- /@w -->`</em>.
<var>u</var> y <var>v</var> son términos multiplicativos en las que las
variables son unidades o expresiones dimensionales literales.
</p>
<p>De momento, es imperativo expresar las conversiones de forma
que el miembro izquierdo de cada ecuación sea una unidad simple
(en opsición a una expresión multiplicativa) o una expresión
dimensional literal con la cantidad igual a 1 y con unidad simple.
Está previsto eliminar esta restricción en versiones futuras.
</p>
<p><code>known_unit_conversions</code> es la lista de conversiones de unidades conocidas.
</p>
<p>Para utilizar esta función ejecútese primero <code>load(&quot;ezunits&quot;)</code>.
</p>
<p>Ejemplos:
</p>
<p>Conversión de unidades expresadas por ecuaciones con términos multiplicativos.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) declare_unit_conversion (nautical_mile = 1852 * m,
                               fortnight = 14 * day);
(%o2)                         done
(%i3) 100 ` nautical_mile / fortnight `` m/s;
Computing conversions to base units; may take a moment. 
                            463    m
(%o3)                       ---- ` -
                            3024   s
</pre></div>

<p>Conversión de unidades expresadas por ecuaciones con expresiones dimensionales
literales.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) declare_unit_conversion (1 ` fluid_ounce = 2 ` tablespoon);
(%o2)                         done
(%i3) declare_unit_conversion (1 ` tablespoon = 3 ` teaspoon);
(%o3)                         done
(%i4) 15 ` fluid_ounce `` teaspoon;
Computing conversions to base units; may take a moment. 
(%o4)                     90 ` teaspoon
</pre></div>


</dd></dl>


<span id="Item_003a-ezunits_002fdeffn_002fdeclare_005fdimensions"></span><dl class="def">
<dt id="index-declare_005fdimensions"><span class="category">Función: </span><span><strong>declare_dimensions</strong> <em>(<var>a_1</var>, <var>d_1</var>, ..., <var>a_n</var>, <var>d_n</var>)</em><a href='#index-declare_005fdimensions' class='copiable-anchor'> &para;</a></span></dt>
<dd><span id="Item_003a-ezunits_002fdeffn_002fremove_005fdimensions"></span></dd><dt id="index-remove_005fdimensions"><span class="category">Función: </span><span><strong>remove_dimensions</strong> <em>(<var>a_1</var>, ..., <var>a_n</var>)</em><a href='#index-remove_005fdimensions' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p><code>declare_dimensions</code> declara <var>a_1</var>, ..., <var>a_n</var>
con las dimensiones <var>d_1</var>, ..., <var>d_n</var>, respectivamente.
</p>
<p>Cada <var>a_k</var> es un símbolo o lista de símbolos.
En caso de ser una lista, cada símbolo en <var>a_k</var> se
declara de dimensión <var>d_k</var>.
</p>
<p><code>remove_dimensions</code> invierte el efecto de <code>declare_dimensions</code>.
</p>
<p>Ejecútese <code>load(&quot;ezunits&quot;)</code> para hacer uso de estas funciones.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;) $
(%i2) declare_dimensions ([x, y, z], length, [t, u], time);
(%o2)                         done
(%i3) dimensions (y^2/u);
                                   2
                             length
(%o3)                        -------
                              time
(%i4) fundamental_units (y^2/u);
0 errors, 0 warnings
                                2
                               m
(%o4)                          --
                               s
</pre></div>

</dd></dl>

<span id="Item_003a-ezunits_002fdeffn_002fdeclare_005ffundamental_005fdimensions"></span><dl class="def">
<dt id="index-declare_005ffundamental_005fdimensions"><span class="category">Función: </span><span><strong>declare_fundamental_dimensions</strong> <em>(<var>d_1</var>, <var>d_2</var>, <var>d_3</var>, ...)</em><a href='#index-declare_005ffundamental_005fdimensions' class='copiable-anchor'> &para;</a></span></dt>
<dd><span id="Item_003a-ezunits_002fdeffn_002fremove_005ffundamental_005fdimensions"></span></dd><dt id="index-remove_005ffundamental_005fdimensions"><span class="category">Función: </span><span><strong>remove_fundamental_dimensions</strong> <em>(<var>d_1</var>, <var>d_2</var>, <var>d_3</var>, ...)</em><a href='#index-remove_005ffundamental_005fdimensions' class='copiable-anchor'> &para;</a></span></dt>
<dd><span id="Item_003a-ezunits_002fdeffn_002ffundamental_005fdimensions"></span></dd><dt id="index-fundamental_005fdimensions"><span class="category">Variable global: </span><span><strong>fundamental_dimensions</strong><a href='#index-fundamental_005fdimensions' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p><code>declare_fundamental_dimensions</code> declara dimensiones fundamentales.
Los símbolos <var>d_1</var>, <var>d_2</var>, <var>d_3</var>, ... se añaden a la lista
de dimensiones fundamentales si no están ya presentes en la lista.
</p>
<p><code>remove_fundamental_dimensions</code> invierte el efecto de <code>declare_fundamental_dimensions</code>.
</p>
<p><code>fundamental_dimensions</code> es la lista de dimensiones fundamentales.
Por defecto, la lista comprende algunas dimensiones físicas.
</p>
<p>Ejecútese <code>load(&quot;ezunits&quot;)</code> para hacer uso de estas funciones.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;) $
(%i2) fundamental_dimensions;
(%o2) [length, mass, time, current, temperature, quantity]
(%i3) declare_fundamental_dimensions (money, cattle, happiness);
(%o3)                         done
(%i4) fundamental_dimensions;
(%o4) [length, mass, time, current, temperature, quantity, 
                                        money, cattle, happiness]
(%i5) remove_fundamental_dimensions (cattle, happiness);
(%o5)                         done
(%i6) fundamental_dimensions;
(%o6) [length, mass, time, current, temperature, quantity, money]
</pre></div>

</dd></dl>


<span id="Item_003a-ezunits_002fdeffn_002fdeclare_005ffundamental_005funits"></span><dl class="def">
<dt id="index-declare_005ffundamental_005funits"><span class="category">Función: </span><span><strong>declare_fundamental_units</strong> <em>(<var>u_1</var>, <var>d_1</var>, ..., <var>u_n</var>, <var>d_n</var>)</em><a href='#index-declare_005ffundamental_005funits' class='copiable-anchor'> &para;</a></span></dt>
<dd><span id="Item_003a-ezunits_002fdeffn_002fremove_005ffundamental_005funits"></span></dd><dt id="index-remove_005ffundamental_005funits"><span class="category">Función: </span><span><strong>remove_fundamental_units</strong> <em>(<var>u_1</var>, ..., <var>u_n</var>)</em><a href='#index-remove_005ffundamental_005funits' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p><code>declare_fundamental_units</code> declara <var>u_1</var>, ..., <var>u_n</var>
de dimensiones <var>d_1</var>, ..., <var>d_n</var>, respectivamente.
Todos los argumentos deben símbolos.
</p>
<p>Tras la llamada a <code>declare_fundamental_units</code>,
<code>dimensions(<var>u_k</var>)</code> devuelve <var>d_k</var> para cada argumento <var>u_1</var>, ..., <var>u_n</var>,
y <code>fundamental_units(<var>d_k</var>)</code> devuelve <var>u_k</var> para cada <var>d_1</var>, ..., <var>d_n</var>.
</p>
<p><code>remove_fundamental_units</code> invierte el efecto de <code>declare_fundamental_units</code>.
</p>
<p>Ejecútese <code>load(&quot;ezunits&quot;)</code> para hacer uso de estas funciones.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;) $
(%i2) declare_fundamental_dimensions (money, cattle, happiness);
(%o2)                         done
(%i3) declare_fundamental_units (dollar, money, goat, cattle,
                                 smile, happiness);
(%o3)                 [dollar, goat, smile]
(%i4) dimensions (100 ` dollar/goat/km^2);
                             money
(%o4)                    --------------
                                      2
                         cattle length
(%i5) dimensions (x ` smile/kg);
                            happiness
(%o5)                       ---------
                              mass
(%i6) fundamental_units (money*cattle/happiness);
0 errors, 0 warnings
                           dollar goat
(%o6)                      -----------
                              smile
</pre></div>

</dd></dl>


<span id="Item_003a-ezunits_002fdeffn_002fdimensions"></span><dl class="def">
<dt id="index-dimensions"><span class="category">Función: </span><span><strong>dimensions</strong> <em>(<var>x</var>)</em><a href='#index-dimensions' class='copiable-anchor'> &para;</a></span></dt>
<dd><span id="Item_003a-ezunits_002fdeffn_002fdimensions_005fas_005flist"></span></dd><dt id="index-dimensions_005fas_005flist"><span class="category">Función: </span><span><strong>dimensions_as_list</strong> <em>(<var>x</var>)</em><a href='#index-dimensions_005fas_005flist' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p><code>dimensions</code> devuelve las dimensiones de la magnitud dimensional <var>x</var>
en forma de expresión que contiene productos y potencias de dimensiones
fundamentales.
</p>
<p><code>dimensions_as_list</code> devuelve las dimensiones de la magnitud dimensional <var>x</var>
en forma de lista, cuyos elementos indican las potencias de las dimensiones
fundamentales correspondientes.
</p>
<p>Para utilizar estas funciones ejecútese primero <code>load(&quot;ezunits&quot;)</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) dimensions (1000 ` kg*m^2/s^3);
                                2
                          length  mass
(%o2)                     ------------
                                 3
                             time
(%i3) declare_units (foo, acre*ft/hour);
                             acre ft
(%o3)                        -------
                              hour
(%i4) dimensions (foo);
                                   3
                             length
(%o4)                        -------
                              time
</pre></div>


<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) fundamental_dimensions;
(%o2)  [length, mass, time, charge, temperature, quantity]
(%i3) dimensions_as_list (1000 ` kg*m^2/s^3);
(%o3)                 [2, 1, - 3, 0, 0, 0]
(%i4) declare_units (foo, acre*ft/hour);
                             acre ft
(%o4)                        -------
                              hour
(%i5) dimensions_as_list (foo);
(%o5)                 [3, 0, - 1, 0, 0, 0]
</pre></div>


</dd></dl>



<span id="Item_003a-ezunits_002fdeffn_002ffundamental_005funits"></span><dl class="def">
<dt id="index-fundamental_005funits"><span class="category">Función: </span><span><strong>fundamental_units</strong> <em>(<var>x</var>)</em><a href='#index-fundamental_005funits' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-fundamental_005funits-1"><span class="category">Función: </span><span><strong>fundamental_units</strong> <em>()</em><a href='#index-fundamental_005funits-1' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p><code>fundamental_units(<var>x</var>)</code> devuelve las unidades
asociadas a las dimensiones fundamentales de <var>x</var>,
tal como queda determinada por <code>dimensions(<var>x</var>)</code>.
</p>
<p><var>x</var> puede ser una expresión literal dimensional <em class='tex2jax_process'>\(a ` b\)</em>,
un símbolo con unidades declaradas a través de
<code>declare_units</code> o una expresión que contenga a ambos.
</p>
<p><code>fundamental_units()</code> devuelve una lista con las unidades
fundamentales conocidas, tal como fueron declaradas por <code>declare_fundamental_units</code>.
</p>
<p>Para utilizar esta función ejecútese primero <code>load(&quot;ezunits&quot;)</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;)$
(%i2) fundamental_units ();
(%o2)                 [m, kg, s, A, K, mol]
(%i3) fundamental_units (100 ` mile/hour);
                                m
(%o3)                           -
                                s
(%i4) declare_units (aa, g/foot^2);
                                g
(%o4)                         -----
                                  2
                              foot
(%i5) fundamental_units (aa);
                               kg
(%o5)                          --
                                2
                               m
</pre></div>

</dd></dl>

<span id="Item_003a-ezunits_002fdeffn_002fdimensionless"></span><dl class="def">
<dt id="index-dimensionless"><span class="category">Función: </span><span><strong>dimensionless</strong> <em>(<var>L</var>)</em><a href='#index-dimensionless' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Devuelve una expresión sin dimensiones que se puede formar
a partir de una lista <var>L</var> de cantidades dimensionales 
</p>
<p>Para utilizar esta función ejecútese primero <code>load(&quot;ezunits&quot;)</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;) $
(%i2) dimensionless ([x ` m, y ` m/s, z ` s]);
0 errors, 0 warnings
0 errors, 0 warnings
                               y z
(%o2)                         [---]
                                x
</pre></div>

<p>Cantidades adimensionales obtenidas a partir de cantidades físicas.
Nótese que el primer elemento de la lista es proporcional a la
constante de estructura fina.
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;ezunits&quot;) $
(%i2) load (&quot;physical_constants&quot;) $
(%i3) dimensionless([%h_bar, %m_e, %m_P, %%e, %c, %e_0]);
0 errors, 0 warnings
0 errors, 0 warnings
                              2
                           %%e        %m_e
(%o3)                [--------------, ----]
                      %c %e_0 %h_bar  %m_P
</pre></div>

</dd></dl>


<span id="Item_003a-ezunits_002fdeffn_002fnatural_005funit"></span><dl class="def">
<dt id="index-natural_005funit"><span class="category">Función: </span><span><strong>natural_unit</strong> <em>(<var>expr</var>, [<var>v_1</var>, ..., <var>v_n</var>])</em><a href='#index-natural_005funit' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Busca los exponentes <var>e_1</var>, ..., <var>e_n</var> tales que
<code>dimension(<var>expr</var>) = dimension(<var>v_1</var>^<var>e_1</var> ... <var>v_n</var>^<var>e_n</var>)</code>.
</p>
<p>Para utilizar esta función ejecútese primero <code>load(&quot;ezunits&quot;)</code>.
</p>
</dd></dl>






</div>
<hr>
<div class="header">
<p>
Anterior: <a href="maxima_212.html" accesskey="p" rel="prev">Introducción a physical_constants</a>, Subir: <a href="maxima_210.html" accesskey="u" rel="up">ezunits</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Índice general" rel="contents">Índice general</a>][<a href="maxima_304.html" title="Índice" rel="index">Índice</a>]</p>
</div>


<a href='js_licenses.html' rel='jslicense'><small>Información de licencia de JavaScript</small></a>
</body>
</html>
