<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 5.1, http://www.gnu.org/software/texinfo/ -->
<head>
<title>Manual de Maxima 5.46.0: Funciones y variables para las propiedades</title>

<meta name="description" content="Manual de Maxima 5.46.0: Funciones y variables para las propiedades">
<meta name="keywords" content="Manual de Maxima 5.46.0: Funciones y variables para las propiedades">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="maxima_toc.html#Top" rel="start" title="Top">
<link href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" rel="index" title="Índice de Funciones y Variables">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="&Iacute;ndice General">
<link href="maxima_57.html#Base-de-datos-de-Maxima" rel="up" title="Base de datos de Maxima">
<link href="maxima_60.html#Funciones-y-variables-para-los-hechos" rel="next" title="Funciones y variables para los hechos">
<link href="maxima_58.html#Introducci_00f3n-a-la-base-de-datos-de-Maxima" rel="previous" title="Introducción a la base de datos de Maxima">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
blockquote.smallquotation {font-size: smaller}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
div.indentedblock {margin-left: 3.2em}
div.lisp {margin-left: 3.2em}
div.smalldisplay {margin-left: 3.2em}
div.smallexample {margin-left: 3.2em}
div.smallindentedblock {margin-left: 3.2em; font-size: smaller}
div.smalllisp {margin-left: 3.2em}
kbd {font-style:oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: inherit; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: inherit; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.nocodebreak {white-space:nowrap}
span.nolinebreak {white-space:nowrap}
span.roman {font-family:serif; font-weight:normal}
span.sansserif {font-family:sans-serif; font-weight:normal}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="figures/favicon.ico">

</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">
<a name="Funciones-y-variables-para-las-propiedades"></a>
<div class="header">
<p>
Siguiente: <a href="maxima_60.html#Funciones-y-variables-para-los-hechos" accesskey="n" rel="next">Funciones y variables para los hechos</a>, Previous: <a href="maxima_58.html#Introducci_00f3n-a-la-base-de-datos-de-Maxima" accesskey="p" rel="previous">Introducción a la base de datos de Maxima</a>, Subir: <a href="maxima_57.html#Base-de-datos-de-Maxima" accesskey="u" rel="up">Base de datos de Maxima</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="&Iacute;ndice general" rel="contents">&Iacute;ndice general</a>][<a href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" title="&Iacute;ndice" rel="index">&Iacute;ndice</a>]</p>
</div>
<a name="Funciones-y-variables-para-las-propiedades-1"></a>
<h3 class="section">11.2 Funciones y variables para las propiedades</h3>

<a name="Item_003a-Database_002ees_002fdefvr_002falphabetic"></a><dl>
<dt><a name="index-alphabetic"></a>Propiedad: <strong>alphabetic</strong></dt>
<dd>
<p><code>alphabetic</code> es un tipo de propiedad reconocida por <code>declare</code>.
La expresión <code>declare(<var>s</var>, alphabetic)</code> le indica a Maxima que reconozca
como alfabéticos todos los caracteres que haya en <var>s</var>, que debe ser una cadena de texto.
</p>
<p>Véase también <code>Identifiers</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) xx\~yy\`\@ : 1729;
(%o1)                         1729
(%i2) declare (&quot;~`@&quot;, alphabetic);
(%o2)                         done
(%i3) xx~yy`@ + @yy`xx + `xx@@yy~;
(%o3)               `xx@@yy~ + @yy`xx + 1729
(%i4) listofvars (%);
(%o4)                  [@yy`xx, `xx@@yy~]
</pre></div>
</dd></dl>

<a name="Item_003a-Database_002ees_002fdefvr_002fbindtest"></a><dl>
<dt><a name="index-bindtest"></a>Propiedad: <strong>bindtest</strong></dt>
<dd><p>La sentencia <code>declare(<var>x</var>, bindtest</code> le indica a Maxima que devuelva un mensaje
de error cuando el símbolo <var>x</var> no tenga asociado valor alguno.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) aa + bb;
(%o1)                        bb + aa
(%i2) declare (aa, bindtest);
(%o2)                         done
(%i3) aa + bb;
aa unbound variable
 -- an error.  Quitting.  To debug this try debugmode(true);
(%i4) aa : 1234;
(%o4)                         1234
(%i5) aa + bb;
(%o5)                       bb + 1234
</pre></div>
</dd></dl>


<a name="Item_003a-Database_002ees_002fdeffn_002fconstant"></a><dl>
<dt><a name="index-constant"></a>Propiedad: <strong>constant</strong></dt>
<dd><p><code>declare(<var>a</var>, constant)</code> declara <var>a</var> como constante.  La declaración
de un símbolo como constante no impide que se le asigne un valor no
constante al símbolo.
</p>
<p>Véanse <code>constantp</code> y <code>declare</code>
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) declare(c, constant);
(%o1)                         done
(%i2) constantp(c);
(%o2)                         true
(%i3) c : x;
(%o3)                           x
(%i4) constantp(c);
(%o4)                         false
</pre></div>
</dd></dl>



<a name="Item_003a-Database_002ees_002fdeffn_002fconstantp"></a><dl>
<dt><a name="index-constantp"></a>Función: <strong>constantp</strong> <em>(<var>expr</var>)</em></dt>
<dd><p>Devuelve <code>true</code> si <var>expr</var> es una expresión constante y
<code>false</code> en caso contrario.
</p>
<p>Una expresión se considera constante si sus argumentos son números 
(incluidos los números racionales que se muestran con <code>/R/</code>), 
constantes simbólicas como <code>%pi</code>, <code>%e</code> o <code>%i</code>, variables 
con valor constante o declarada como constante por <code>declare</code>,
o funciones cuyos argumentos son constantes.
</p>
<p>La función <code>constantp</code> evalúa sus argumentos.
</p>
<p>Ejemplos:
</p>

<div class="example">
<pre class="example">(%i1) constantp (7 * sin(2));
(%o1)                                true
(%i2) constantp (rat (17/29));
(%o2)                                true
(%i3) constantp (%pi * sin(%e));
(%o3)                                true
(%i4) constantp (exp (x));
(%o4)                                false
(%i5) declare (x, constant);
(%o5)                                done
(%i6) constantp (exp (x));
(%o6)                                true
(%i7) constantp (foo (x) + bar (%e) + baz (2));
(%o7)                                false
(%i8) 
</pre></div>
</dd></dl>



<a name="Item_003a-Database_002ees_002fdeffn_002fdeclare"></a><dl>
<dt><a name="index-declare"></a>Función: <strong>declare</strong> <em>(<var>a_1</var>, <var>f_1</var>, <var>a_2</var>, <var>f_2</var>, ...)</em></dt>
<dd><p>Asigna al átomo o lista de átomos <var>a_i</var> la propiedad o lista de 
propiedades<var>p_i</var>. Si <var>a_i</var> y/o <var>p_i</var> son listas, cada uno de
los átomos adquiere todas las propiedades.
</p>
<p>La función <code>declare</code> no evalúa sus argumentos y siempre devuelve la
expresión <code>done</code>.
</p>
<p>La llamada <code>featurep (<var>object</var>, <var>feature</var>)</code> devuelve <code>true</code>
si <var>object</var> ha sido previamente declarado como poseedor de la propiedad
<var>feature</var>.
</p>
<p>Véase también <code>features</code>.
</p>
<p>La función <code>declare</code> reconoce las siguientes propiedades:
</p>
<dl compact="compact">
<dt><code>additive</code></dt>
<dd><p>Hace que Maxima simplifique las expresiones <var>a_i</var>
      haciendo uso de la sustitución 
      <code><var>a_i</var>(x + y + z + ...)</code> <code>--&gt;</code>
      <code><var>a_i</var>(x) + <var>a_i</var>(y) + <var>a_i</var>(z) + ...</code>.
      Tal sustitución se aplica únicamente al primer argumento.
</p>
</dd>
<dt><code>alphabetic</code></dt>
<dd><p>Indica a Maxima que reconozca todos los caracteres de la cadena alfanumérica
      <var>a_i</var> como caracteres alfabéticos.
</p>
</dd>
<dt><code>antisymmetric, commutative, symmetric</code></dt>
<dd><p>Hace que Maxima reconozca a <var>a_i</var> como una función simétrica o
      antisimétrica. La propiedad <code>commutative</code> equivale a <code>symmetric</code>.
</p>
</dd>
<dt><code>bindtest</code></dt>
<dd><p>Hace que Maxima envíe un error si <var>a_i</var> es evaluado sin habérsele
      asignado un valor.
</p>
</dd>
<dt><code>constant</code></dt>
<dd><p>Hace que Maxima considere a <var>a_i</var> como una constante
      simbólica.
</p>
</dd>
<dt><code>even, odd</code></dt>
<dd><p>Hace que Maxima reconozca a <var>a_i</var> como una variable entera par o impar.
</p>
</dd>
<dt><code>evenfun, oddfun</code></dt>
<dd><p>Hace que Maxima reconozca a <var>a_i</var> como una función par o impar.
</p>
</dd>
<dt><code>evflag</code></dt>
<dd><p>Hace que <var>a_i</var> sea reconocida por <code>ev</code>, de manera que a <var>a_i</var> se le
      asigne el valor <code>true</code> durante la ejecución de <code>ev</code> cuando <var>a_i</var> 
      aparezca como argumento de control de <code>ev</code>. Véase también <code>evflag</code>.
</p>
</dd>
<dt><code>evfun</code></dt>
<dd><p>Hace que <var>a_i</var> sea reconocida por <code>ev</code>, de manera que la función
      nombrada por <var>a_i</var> se aplique cuando <var>a_i</var> aparezca como argumento
      de control de <code>ev</code>. Véase también <code>evfun</code>.
</p>
</dd>
<dt><code>feature</code></dt>
<dd><p>Hace que Maxima considere a <var>a_i</var> como el nombre de una propiedad.
      Otros átomos podrán ser declarados entonces como poseedores de
      la propiedad <var>a_i</var>.
</p>
</dd>
<dt><code>increasing, decreasing</code></dt>
<dd><p>Hace que Maxima reconozca a <var>a_i</var> como una función creciente o decreciente.
</p>
</dd>
<dt><code>integer, noninteger</code></dt>
<dd><p>Hace que Maxima reconozca a <var>a_i</var> como una variable entera o no entera.
</p>
</dd>
<dt><code>integervalued</code></dt>
<dd><p>Hace que Maxima reconozca a <var>a_i</var> como una función de valor entero.
</p>
</dd>
<dt><code>lassociative, rassociative</code></dt>
<dd><p>Hace que Maxima reconozca a <var>a_i</var> como una función asociativa por la derecha o
      por la izquierda.
</p>
</dd>
<dt><code>linear</code></dt>
<dd><p>Equivale a declarar <var>a_i</var> conjuntamente como <code>outative</code> y <code>additive</code>.
</p>
</dd>
<dt><code>mainvar</code></dt>
<dd><p>Hace que Maxima considere a <var>a_i</var> como una &quot;variable principal&quot;,
      dándole prioridad frente a cualesquiera otras constantes o
      variables en la ordenación canónica de expresiones de Maxima,
      tal como determina <code>ordergreatp</code>.
</p>
</dd>
<dt><code>multiplicative</code></dt>
<dd><p>Hace que Maxima simplifique las expresiones <var>a_i</var>
      haciendo uso de la sustitución 
      <code><var>a_i</var>(x * y * z * ...)</code> <code>--&gt;</code> <code><var>a_i</var>(x) * <var>a_i</var>(y) * <var>a_i</var>(z) * ...</code>.
      Tal sustitución se aplica únicamente al primer argumento.
</p>
</dd>
<dt><code>nary</code></dt>
<dd><p>Hace que Maxima reconozca a <var>a_i</var> como una función n-aria.
</p>
<p>La declaración <code>nary</code> no es equivalente a la función <code>nary</code>.
      El único efecto de <code>declare(foo, nary)</code> consiste en hacer que
      el simplificador de Maxima reduzca expresiones anidadas; por ejemplo, 
      para transformar <code>foo(x, foo(y, z))</code> a <code>foo(x, y, z)</code>.
</p>
</dd>
<dt><code>nonarray</code></dt>
<dd><p>Indica que Maxima no debe considerar <var>a_i</var> como un array. Esta declaración
      evita la evaluación múltiple de variables subindicadas.
</p>
</dd>
<dt><code>nonscalar</code></dt>
<dd><p>Hace que Maxima considere a <var>a_i</var> como una variable no escalar.
      Se aplica comúnmente para declarar una variable como un vector simbólico
      o una matriz simbólica.
</p>
</dd>
<dt><code>noun</code></dt>
<dd><p>Hace que Maxima considere a <var>a_i</var> como un nombre. El efecto
      que se obtiene es que se reemplazan todas las expresiones <var>a_i</var>
      por <code>'<var>a_i</var></code> o <code>nounify (<var>a_i</var>)</code>,
      dependiendo del contexto.
</p>
</dd>
<dt><code>outative</code></dt>
<dd><p>Hace que Maxima simplifique las expresiones <var>a_i</var>
      extrayendo los factores constantes del primer argumento.
</p>
<p>Cuando <var>a_i</var> tenga un único argumento, un factor se considerará constante
      si es una constante literal o declarada.
</p>
<p>Cuando <var>a_i</var> tenga dos o más argumentos, un factor se considerará constante
      si el segundo argumento es un símbolo y el factor no contiene al
      segundo argumento.
</p>
</dd>
<dt><code>posfun</code></dt>
<dd><p>Hace que Maxima reconozca a <var>a_i</var> como una función positiva.
</p>
</dd>
<dt><code>rational, irrational</code></dt>
<dd><p>Hace que Maxima reconozca a <var>a_i</var> como una variable real racional o irracional.
</p>
</dd>
<dt><code>real, imaginary, complex</code></dt>
<dd><p>Hace que Maxima reconozca a <var>a_i</var> como una variable real, imaginaria o compleja.
</p>
</dd>
<dt><code>scalar</code></dt>
<dd><p>Hace que Maxima considere a <var>a_i</var> como una variable escalar.
</p>
</dd>
</dl>

<p>Ejemplos sobre el uso de estas propiedades están disponibles en la 
documentación correspondiente a cada propiedad por separado.
</p></dd></dl>



<a name="Item_003a-Database_002ees_002fdefvr_002fdecreasing"></a><dl>
<dt><a name="index-decreasing"></a>Propiedad: <strong>decreasing</strong></dt>
<dd><a name="Item_003a-Database_002ees_002fdefvr_002fincreasing"></a></dd><dt><a name="index-increasing"></a>Propiedad: <strong>increasing</strong></dt>
<dd>
<p>Las instrucciones <code>declare(<var>f</var>, decreasing)</code> y
<code>declare(<var>f</var>, increasing</code> le indican a Maxima que reconozca la función
<var>f</var> como una función decreciente o creciente.
</p>
<p>Véase también <code>declare</code> para más propiedades.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) assume(a &gt; b);
(%o1)                        [a &gt; b]
(%i2) is(f(a) &gt; f(b));
(%o2)                        unknown
(%i3) declare(f, increasing);
(%o3)                         done
(%i4) is(f(a) &gt; f(b));
(%o4)                         true
</pre></div>
</dd></dl>


<a name="Item_003a-Database_002ees_002fdefvr_002feven"></a><dl>
<dt><a name="index-even"></a>Propiedad: <strong>even</strong></dt>
<dd><a name="Item_003a-Database_002ees_002fdefvr_002fodd"></a></dd><dt><a name="index-odd"></a>Propiedad: <strong>odd</strong></dt>
<dd>
<p><code>declare(<var>a</var>, even)</code> y <code>declare(<var>a</var>, odd)</code> le indican a Maxima
que reconozca el símbolo <var>a</var> como entero par o impar.  Las
propiedades <code>even</code> y <code>odd</code> no son reconocidas por las funciones 
<code>evenp</code>, <code>oddp</code> y <code>integerp</code>.
</p>
<p>Véanse también <code>declare</code> y <code>askinteger</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) declare(n, even);
(%o1)                         done
(%i2) askinteger(n, even);
(%o2)                          yes
(%i3) askinteger(n);
(%o3)                          yes
(%i4) evenp(n);
(%o4)                         false
</pre></div>
</dd></dl>



<a name="Item_003a-Database_002ees_002fdefvr_002ffeature"></a><dl>
<dt><a name="index-feature"></a>Propiedad: <strong>feature</strong></dt>
<dd>
<p>Maxima interpreta dos tipos diferentes de propiedades, del sistema y las que
se aplican a expresiones matemáticas. Véase <code>status</code> para obtener
información sobre propiedades del sistema, así como
<code>features</code> y <code>featurep</code> para propiedades de las expresiones matemáticas.
</p>
<p><code>feature</code> no es el nombre de ninguna función o variable.
</p></dd></dl>


<a name="Item_003a-Database_002ees_002fdeffn_002ffeaturep"></a><dl>
<dt><a name="index-featurep"></a>Función: <strong>featurep</strong> <em>(<var>a</var>, <var>f</var>)</em></dt>
<dd>
<p>Intenta determinar si el objeto <var>a</var> tiene la propiedad <var>f</var> en base a los
hechos almacenados en la base de datos. En caso afirmativo, devuelve <code>true</code>,
o <code>false</code> en caso contrario.
</p>
<p>Nótese que <code>featurep</code> devuelve <code>false</code> cuando no se puedan verificar ni
<var>f</var> ni su negación.
</p>
<p><code>featurep</code> evalúa su argumento.
</p>
<p>Véanse también <code>declare</code> y <code>features</code>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) declare (j, even)$
(%i2) featurep (j, integer);
(%o2)                           true
</pre></div>
</dd></dl>



<a name="Item_003a-Database_002ees_002fdefvr_002ffeatures"></a><dl>
<dt><a name="index-features"></a>Declaración: <strong>features</strong></dt>
<dd><p>Maxima reconoce ciertas propiedades matemáticas sobre funciones y variables.
</p>
<p>La llamada <code>declare (<var>x</var>, <var>foo</var>)</code> asocia la propiedad <var>foo</var> a la función o variable <var>x</var>.
</p>
<p>La llamada <code>declare (<var>foo</var>, feature)</code> declara una nueva propiedad <var>foo</var>. 
Por ejemplo, <code>declare ([rojo, verde, azul], feature)</code> declara tres nuevas propiedades, 
<code>rojo</code>, <code>verde</code> y <code>azul</code>.
</p>
<p>El predicado <code>featurep (<var>x</var>, <var>foo</var>)</code>
devuelve <code>true</code> si <var>x</var> goza de la propiedad <var>foo</var>, y <code>false</code> en caso contrario.
</p>
<p>La lista <code>features</code> contiene las propiedades que reconoce Maxima; a saber,
</p>
<pre class="verbatim">   integer        noninteger      even
   odd            rational        irrational
   real           imaginary       complex
   analytic       increasing      decreasing
   oddfun         evenfun         posfun
   commutative    lassociative    rassociative
   symmetric      antisymmetric
</pre>
<p>junto con las definidas por el usuario.
</p>
<p>La lista <code>features</code> sólo contiene propiedades matemáticas. 
Hay otra lista con propiedades no matemáticas; Véase <code>status</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) declare (FOO, feature);
(%o1)                         done
(%i2) declare (x, FOO);
(%o2)                         done
(%i3) featurep (x, FOO);
(%o3)                         true
</pre></div>
</dd></dl>



<a name="Item_003a-Database_002ees_002fdeffn_002fget"></a><dl>
<dt><a name="index-get"></a>Función: <strong>get</strong> <em>(<var>a</var>, <var>i</var>)</em></dt>
<dd>
<p>Recupera la propiedad de usuario indicada por <var>i</var> asociada al átomo <var>a</var> 
o devuelve <code>false</code> si <var>a</var> no tiene la propiedad <var>i</var>.
</p>
<p>La función <code>get</code> evalúa sus argumentos.
</p>
<p>Véanse también <code>put</code> y <code>qput</code>.
</p>
<div class="example">
<pre class="example">(%i1) put (%e, 'transcendental, 'type);
(%o1)                    transcendental
(%i2) put (%pi, 'transcendental, 'type)$
(%i3) put (%i, 'algebraic, 'type)$
(%i4) typeof (expr) := block ([q],
        if numberp (expr)
        then return ('algebraic),
        if not atom (expr)
        then return (maplist ('typeof, expr)),
        q: get (expr, 'type),
        if q=false
        then errcatch (error(expr,&quot;is not numeric.&quot;)) else q)$
(%i5) typeof (2*%e + x*%pi);
x is not numeric.
(%o5)  [[transcendental, []], [algebraic, transcendental]]
(%i6) typeof (2*%e + %pi);
(%o6)     [transcendental, [algebraic, transcendental]]
</pre></div>
</dd></dl>


<a name="Item_003a-Database_002ees_002fdefvr_002finteger"></a><dl>
<dt><a name="index-integer"></a>Propiedad: <strong>integer</strong></dt>
<dd><a name="Item_003a-Database_002ees_002fdefvr_002fnoninteger"></a></dd><dt><a name="index-noninteger"></a>Propiedad: <strong>noninteger</strong></dt>
<dd>
<p><code>declare(<var>a</var>, integer)</code> o <code>declare(<var>a</var>, noninteger)</code> indica a
Maxima que reconozca <var>a</var> como una variable entera o no entera.
</p>
<p>Véase también <code>declare</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) declare(n, integer, x, noninteger);
(%o1)                         done
(%i2) askinteger(n);
(%o2)                          yes
(%i3) askinteger(x);
(%o3)                          no
</pre></div>
</dd></dl>



<a name="Item_003a-Database_002ees_002fdefvr_002fintegervalued"></a><dl>
<dt><a name="index-integervalued"></a>Propiedad: <strong>integervalued</strong></dt>
<dd>
<p><code>declare(<var>f</var>, integervalued)</code> indica a MAxima que reconozca <var>f</var> como
una función que toma valores enteros.
</p>
<p>Véase también <code>declare</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) exp(%i)^f(x);
                              %i f(x)
(%o1)                      (%e  )
(%i2) declare(f, integervalued);
(%o2)                         done
(%i3) exp(%i)^f(x);
                              %i f(x)
(%o3)                       %e
</pre></div>
</dd></dl>



<a name="Item_003a-Database_002ees_002fdeffn_002fnonarray"></a><dl>
<dt><a name="index-nonarray"></a>Propiedad: <strong>nonarray</strong></dt>
<dd>
<p>La instrucción <code>declare(a, nonarray)</code> le indica a Maxima que
no considere <var>a</var> como un array. Esta declaración evita la 
evaluación múltiple de <var>a</var>, si ésta es una variable subindicada.
</p>
<p>Véase también <code>declare</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) a:'b$ b:'c$ c:'d$

(%i4) a[x];
(%o4)                          d
                                x
(%i5) declare(a, nonarray);
(%o5)                         done
(%i6) a[x];
(%o6)                          a
                                x
</pre></div>
</dd></dl>


<a name="Item_003a-Database_002ees_002fdefvr_002fnonscalar"></a><dl>
<dt><a name="index-nonscalar"></a>Propiedad: <strong>nonscalar</strong></dt>
<dd><p>Hace que los átomos se comporten como hace una lista o matriz 
con respecto del operador <code>.</code> del la multiplicación no conmutativa.
</p>
<p>Véase también <code>declare</code>.
</p></dd></dl>


<a name="Item_003a-Database_002ees_002fdeffn_002fnonscalarp"></a><dl>
<dt><a name="index-nonscalarp"></a>Función: <strong>nonscalarp</strong> <em>(<var>expr</var>)</em></dt>
<dd><p>Devuelve <code>true</code> si <var>expr</var> no es escalar, es decir, 
si contiene átomos declarados como no escalares, listas o matrices. 
</p></dd></dl>


<a name="Item_003a-Database_002ees_002fdefvr_002fposfun"></a><dl>
<dt><a name="index-posfun"></a>Declaración: <strong>posfun</strong></dt>
<dd><p>La instrucción <code>declare (f, posfun)</code> declara a <code>f</code> como 
función positiva, de forma que 
<code>is (f(x) &gt; 0)</code> devolverá <code>true</code>.
</p>
<p>Véase también <code>declare</code>.
</p></dd></dl>


<a name="Item_003a-Database_002ees_002fdeffn_002fprintprops"></a><dl>
<dt><a name="index-printprops"></a>Función: <strong>printprops</strong> <em>(<var>a</var>, <var>i</var>)</em></dt>
<dt><a name="index-printprops-1"></a>Función: <strong>printprops</strong> <em>([<var>a_1</var>, ..., <var>a_n</var>], <var>i</var>)</em></dt>
<dt><a name="index-printprops-2"></a>Función: <strong>printprops</strong> <em>(all, <var>i</var>)</em></dt>
<dd><p>Muestra la propiedad con el indicador <var>i</var> asociado 
con el átomo <var>a</var>. <var>a</var> puede ser también una lista de
átomos o el átomo <code>all</code> en cuyo caso todos los átomos a los cuales se les haya dado esa propiedad serán usados. 
Por ejemplo, <code>printprops ([f, g], atvalue)</code>. <code>printprops</code> es 
para propiedades que no pueden ser mostradas de otra manera, i.e. para
<code>atvalue</code>, <code>atomgrad</code>, <code>gradef</code>, y <code>matchdeclare</code>.
</p>
</dd></dl>


<a name="Item_003a-Database_002ees_002fdeffn_002fproperties"></a><dl>
<dt><a name="index-properties"></a>Función: <strong>properties</strong> <em>(<var>a</var>)</em></dt>
<dd><p>Devuelve una lista con los nombres de todas las propiedades asociadas
al t'omo <var>a</var>.
</p></dd></dl>


<a name="Item_003a-Database_002ees_002fdefvr_002fprops"></a><dl>
<dt><a name="index-props"></a>Variable del sistema: <strong>props</strong></dt>
<dd><p>Valor por defecto: <code>[]</code>
</p>
<p><code>props</code> son t'omos que tienen asociadas otras propiedades además de las
explícitamente mencionadas en <code>infolists</code>, tales como las
especificadas por <code>atvalue</code>, <code>matchdeclare</code> y la función 
<code>declare</code>.
</p></dd></dl>



<a name="Item_003a-Database_002ees_002fdeffn_002fpropvars"></a><dl>
<dt><a name="index-propvars"></a>Función: <strong>propvars</strong> <em>(<var>prop</var>)</em></dt>
<dd>
<p>Devuelve la lista con los átomos de la lista <code>props</code> que tienen
la propiedad indicada por <var>prop</var>. Así, <code>propvars (atvalue)</code> 
devuelve la lista con los átomos a los que se les ha asociado valores con
<code>atvalue</code>.
</p></dd></dl>


<a name="Item_003a-Database_002ees_002fdeffn_002fput"></a><dl>
<dt><a name="index-put"></a>Función: <strong>put</strong> <em>(<var>átomo</var>, <var>valor</var>, <var>indicador</var>)</em></dt>
<dd>
<p>Asigna el <var>valor</var> a la propiedad  (especificada por <var>indicador</var>) de <var>átomo</var>;
<var>indicador</var> puede ser el nombre de cualquier propiedad y no solamente de aquellas definidas por el sistema.
</p>
<p><code>rem</code> deshace la asignación realizada por <code>put</code>.
</p>
<p>La función <code>put</code> evalúa sus argumentos y devuelve <var>valor</var>.
</p>
<p>Ejemplos:
</p>
<div class="example">
<pre class="example">(%i1) put (foo, (a+b)^5, expr);
                                   5
(%o1)                       (b + a)
(%i2) put (foo, &quot;Hello&quot;, str);
(%o2)                         Hello
(%i3) properties (foo);
(%o3)            [[user properties, str, expr]]
(%i4) get (foo, expr);
                                   5
(%o4)                       (b + a)
(%i5) get (foo, str);
(%o5)                         Hello
</pre></div>

</dd></dl>



<a name="Item_003a-Database_002ees_002fdeffn_002fqput"></a><dl>
<dt><a name="index-qput"></a>Función: <strong>qput</strong> <em>(<var>átomo</var>, <var>valor</var>, <var>indicador</var>)</em></dt>
<dd>
<p>Asigna <var>valor</var> a la propiedad de <var>átomo</var> que especifique <var>indicador</var>.
Actúa del mismo modeo que <code>put</code>, excepto que sus argumentos no son evaluados.
</p>
<p>Véase también <code>get</code>.
</p>
<p>Ejemplo:
</p>
<div class="example">
<pre class="example">(%i1) foo: aa$ 
(%i2) bar: bb$
(%i3) baz: cc$
(%i4) put (foo, bar, baz);
(%o4)                          bb
(%i5) properties (aa);
(%o5)                [[user properties, cc]]
(%i6) get (aa, cc);
(%o6)                          bb
(%i7) qput (foo, bar, baz);
(%o7)                          bar
(%i8) properties (foo);
(%o8)            [value, [user properties, baz]]
(%i9) get ('foo, 'baz);
(%o9)                          bar
</pre></div>
</dd></dl>




<a name="Item_003a-Database_002ees_002fdefvr_002frational"></a><dl>
<dt><a name="index-rational-1"></a>Propiedad: <strong>rational</strong></dt>
<dd><a name="Item_003a-Database_002ees_002fdefvr_002firrational"></a></dd><dt><a name="index-irrational"></a>Propiedad: <strong>irrational</strong></dt>
<dd>
<p><code>declare(<var>a</var>, rational)</code> o <code>declare(<var>a</var>, irrational)</code> indica a
Maxima que reconozca <var>a</var> como una variable real racional o irracional.
</p>
<p>Véase también <code>declare</code>.
</p></dd></dl>



<a name="Item_003a-Database_002ees_002fdefvr_002freal"></a><dl>
<dt><a name="index-real"></a>Propiedad: <strong>real</strong></dt>
<dd><a name="Item_003a-Database_002ees_002fdefvr_002fimaginary"></a></dd><dt><a name="index-imaginary"></a>Propiedad: <strong>imaginary</strong></dt>
<dd><a name="Item_003a-Database_002ees_002fdefvr_002fcomplex"></a></dd><dt><a name="index-complex"></a>Propiedad: <strong>complex</strong></dt>
<dd>
<p><code>declare(<var>a</var>, real)</code>, <code>declare(<var>a</var>, imaginary)</code> o
<code>declare(<var>a</var>, complex)</code> indican a Maxima que reconozca <var>a</var> como variable real,
imaginaria puro o compleja, respectivamente.
</p>
<p>Véase también <code>declare</code>.
</p></dd></dl>



<a name="Item_003a-Database_002ees_002fdeffn_002frem"></a><dl>
<dt><a name="index-rem"></a>Función: <strong>rem</strong> <em>(<var>átomo</var>, <var>indicador</var>)</em></dt>
<dd>
<p>Elimina del <var>átomo</var> la propiedad indicada por <var>indicador</var>.
<code>rem</code> deshace la asignación realizada por <code>put</code>.
</p>
<p><code>rem</code> devuelve <code>done</code> si <var>átomo</var> tenía la 
propiedad <var>indicador</var> cuando <code>rem</code> fue invocado, devolviendo
<code>false</code> si carecía tal propiedad.
</p>
</dd></dl>



<a name="Item_003a-Database_002ees_002fdeffn_002fremove"></a><dl>
<dt><a name="index-remove"></a>Función: <strong>remove</strong> <em>(<var>a_1</var>, <var>p_1</var>, ..., <var>a_n</var>, <var>p_n</var>)</em></dt>
<dt><a name="index-remove-1"></a>Función: <strong>remove</strong> <em>([<var>a_1</var>, ..., <var>a_m</var>], [<var>p_1</var>, ..., <var>p_n</var>], ...)</em></dt>
<dt><a name="index-remove-2"></a>Función: <strong>remove</strong> <em>(&quot;<var>a</var>&quot;, operator)</em></dt>
<dt><a name="index-remove-3"></a>Función: <strong>remove</strong> <em>(<var>a</var>, transfun)</em></dt>
<dt><a name="index-remove-4"></a>Función: <strong>remove</strong> <em>(all, <var>p</var>)</em></dt>
<dd>
<p>Elimina propiedades asociadas con átomos.
</p>
<p>La llamada <code>remove (<var>a_1</var>, <var>p_1</var>, ..., <var>a_n</var>, <var>p_n</var>)</code>
elimina la propiedad <code>p_k</code> del átomo <code>a_k</code>.
</p>
<p>La llamada <code>remove ([<var>a_1</var>, ..., <var>a_m</var>], [<var>p_1</var>, ..., <var>p_n</var>], ...)</code>
elimina las propiedades <code><var>p_1</var>, ..., <var>p_n</var></code> de los átomos <var>a_1</var>, ..., <var>a_m</var>. Puede tener más de un par de listas.
</p>
<p>La llamada <code>remove (all, <var>p</var>)</code> elimina la propiedad <var>p</var> de todos los átomos que la tengan.
</p>
<p>Las propiedades eliminadas pueden ser de las que define el sistema, como 
<code>function</code>, <code>macro</code> o <code>mode_declare</code>; <code>remove</code> no elimina
las propiedades definidas por <code>put</code>.
</p>
<p>La llamada <code>remove (&quot;<var>a</var>&quot;, operator)</code> o su equivalente <code>remove (&quot;<var>a</var>&quot;, op)</code> elimina de  <var>a</var> las propiedades de operador declaradas por <code>prefix</code>, <code>infix</code>, <code>nary</code>, <code>postfix</code>, <code>matchfix</code> o <code>nofix</code>. Nótese que el nombre del operador debe escribirse como cadena precedida de apóstrofo.
</p>
<p>La función <code>remove</code> devuelve siempre <code>done</code> independientemente que haya algún átomo con la propiedad especificada.
</p>
<p>La función <code>remove</code> no evalúa sus argumentos.
</p></dd></dl>


<a name="Item_003a-Database_002ees_002fdefvr_002fscalar"></a><dl>
<dt><a name="index-scalar"></a>Propiedad: <strong>scalar</strong></dt>
<dd>
<p><code>declare(<var>a</var>, scalar)</code> indica a Maxima que considere a <var>a</var> como
una variable escalar.
</p>
<p>Véase también <code>declare</code>.
</p></dd></dl>



<a name="Item_003a-Database_002ees_002fdeffn_002fscalarp"></a><dl>
<dt><a name="index-scalarp"></a>Función: <strong>scalarp</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p>Devuelve <code>true</code> si <var>expr</var> es un número, constante  o variable 
declarada como <code>scalar</code> con <code>declare</code>, o compuesta completamente de tales 
números, constantes o variables, pero que no contengan matrices ni listas.
</p></dd></dl>







<a name="Item_003a-Database_002ees_002fnode_002fFunciones-y-variables-para-los-hechos"></a><hr>
<div class="header">
<p>
Siguiente: <a href="maxima_60.html#Funciones-y-variables-para-los-hechos" accesskey="n" rel="next">Funciones y variables para los hechos</a>, Previous: <a href="maxima_58.html#Introducci_00f3n-a-la-base-de-datos-de-Maxima" accesskey="p" rel="previous">Introducción a la base de datos de Maxima</a>, Subir: <a href="maxima_57.html#Base-de-datos-de-Maxima" accesskey="u" rel="up">Base de datos de Maxima</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="&Iacute;ndice general" rel="contents">&Iacute;ndice general</a>][<a href="maxima_304.html#g_t_00cdndice-de-Funciones-y-Variables" title="&Iacute;ndice" rel="index">&Iacute;ndice</a>]</p>
</div>



</body>
</html>
