<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 6.8, https://www.gnu.org/software/texinfo/ -->
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Operadores Geral (Manual do Maxima)</title>

<meta name="description" content="Operadores Geral (Manual do Maxima)">
<meta name="keywords" content="Operadores Geral (Manual do Maxima)">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta name="viewport" content="width=device-width,initial-scale=1">

<link href="maxima_toc.html" rel="start" title="Top">
<link href="maxima_231.html" rel="index" title="Índice de Funções e Variáveis">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="Sum&aacute;rio">
<link href="maxima_11.html" rel="up" title="Operadores">
<link href="maxima_17.html" rel="prev" title="Operadores Relacionais">
<style type="text/css">
<!--
a.copiable-anchor {visibility: hidden; text-decoration: none; line-height: 0em}
a.summary-letter {text-decoration: none}
blockquote.indentedblock {margin-right: 0em}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
kbd {font-style: oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
span.nolinebreak {white-space: nowrap}
span.roman {font-family: initial; font-weight: normal}
span.sansserif {font-family: sans-serif; font-weight: normal}
span:hover a.copiable-anchor {visibility: visible}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="figures/favicon.ico">
<script src="https://polyfill.io/v3/polyfill.min.js?features=es6>"></script>

</head>

<body lang="pt">
<div class="section" id="Operadores-Geral">
<div class="header">
<p>
Anterior: <a href="maxima_17.html" accesskey="p" rel="prev">Operadores Relacionais</a>, Acima: <a href="maxima_11.html" accesskey="u" rel="up">Operadores</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Sum&aacute;rio" rel="contents">Conte&uacute;do</a>][<a href="maxima_231.html" title="&Iacute;ndice" rel="index">&Iacute;ndice</a>]</p>
</div>
<span id="Operadores-Geral-1"></span><h3 class="section">5.7, Operadores Geral</h3>

<span id="Item_003a-Operators_002fdeffn_002f_005e_005e"></span><dl class="def">
<dt id="index-_005e_005e"><span class="category">Operador: </span><span><strong>^^</strong><a href='#index-_005e_005e' class='copiable-anchor'> &para;</a></span></dt>
</dl>

<span id="Item_003a-Operators_002fdeffn_002f_0021"></span><dl class="def">
<dt id="index-_0021"><span class="category">Operador: </span><span><strong>!</strong><a href='#index-_0021' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>O operador fatorial.
Para qualquer número complexo <code>x</code> (incluíndo números inteiros, racionais, e reais) exceto para
inteiros negativos, <code>x!</code> é definido como <code>gamma(x+1)</code>.
</p>
<p>Para um inteiro <code>x</code>, <code>x!</code> simplifica para o produto de inteiros de 1 a <code>x</code> inclusive.
<code>0!</code> simplifica para 1.
Para um número em ponto flutuante <code>x</code>, <code>x!</code> simplifica para o valor de <code>gamma (x+1)</code>.
Para <code>x</code> igual a <code>n/2</code> onde <code>n</code> é um inteiro ímpar,
<code>x!</code> simplifica para um fator racional vezes <code>sqrt (%pi)</code>
(uma vez que <code>gamma (1/2)</code> é igual a <code>sqrt (%pi)</code>).
Se <code>x</code> for qualquer outra coisa,
<code>x!</code> não é simplificado.
</p>
<p>As variáveis
<code>factlim</code>, <code>minfactorial</code>, e <code>factcomb</code> controlam a simplificação
de expressões contendo fatoriais.
</p>
<p>As funções <code>gamma</code>, <code>bffac</code>, e <code>cbffac</code>
são variedades da função <code>gamma</code>. 
<code>makegamma</code> substitui <code>gamma</code> para funções relacionadas a fatoriais.
</p>
<p>Veja também <code>binomial</code>.
</p>
<p>O fatorial de um inteiro, inteiro dividido por dois, ou argumento em ponto flutuante é simplificado
a menos que o operando seja maior que <code>factlim</code>.
</p>
<div class="example">
<pre class="example">(%i1) factlim : 10;
(%o1)                          10
(%i2) [0!, (7/2)!, 4.77!, 8!, 20!];
+            105 sqrt(%pi)
+(%o2)   [1, -------------, 81.44668037931199, 40320, 20!]
+                 16
</pre></div>

<p>O fatorial de um número complexo, constante conhecida, ou expressão geral não é simplificado.
Ainda assim pode ser possível simplificar o fatorial após avaliar o operando.
</p>
<div class="example">
<pre class="example">(%i1) [(%i + 1)!, %pi!, %e!, (cos(1) + sin(1))!];
(%o1)      [(%i + 1)!, %pi!, %e!, (sin(1) + cos(1))!]
(%i2) ev (%, numer, %enumer);
(%o2) [(%i + 1)!, 7.188082728976037, 4.260820476357, 
                                               1.227580202486819]
</pre></div>

<p>O fatorial de um símbolo não associado não é simplificado.
</p>
<div class="example">
<pre class="example">(%i1) kill (foo);
(%o1)                         done
(%i2) foo!;
(%o2)                         foo!
</pre></div>

<p>Fatoriais são simplificados, não avaliados.
Dessa forma <code>x!</code> pode ser substituído mesmo em uma expressão com apóstrofo.
</p>
<div class="example">
<pre class="example">(%i1) '([0!, (7/2)!, 4.77!, 8!, 20!]);
          105 sqrt(%pi)
(%o1) [1, -------------, 81.44668037931199, 40320, 
               16
                                             2432902008176640000]
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002f_0021_0021"></span><dl class="def">
<dt id="index-_0021_0021"><span class="category">Operador: </span><span><strong>!!</strong><a href='#index-_0021_0021' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>O operador de duplo fatorial.
</p>
<p>Para um número inteiro, número em ponto flutuante, ou número racional <code>n</code>,
<code>n!!</code> avalia para o produto <code>n (n-2) (n-4) (n-6) ... (n - 2 (k-1))</code>
onde <code>k</code> é igual a <code>entier (n/2)</code>,
que é, o maior inteiro menor que ou igual a <code>n/2</code>.
Note que essa definição não coincide com outras definições publicadas
para argumentos que não são inteiros.
</p>
<p>Para um inteiro par (ou ímpar) <code>n</code>, <code>n!!</code> avalia para o produto de
todos os inteiros consecutivos pares (ou ímpares) de 2 (ou 1) até <code>n</code> inclusive.
</p>
<p>Para um argumento <code>n</code> que não é um número inteiro, um número em ponto flutuante, ou um número racional,
<code>n!!</code> retorna uma forma substantiva <code>genfact (n, n/2, 2)</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002f_0023"></span><dl class="def">
<dt id="index-_0023"><span class="category">Operador: </span><span><strong>#</strong><a href='#index-_0023' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Representa a negação da igualdade sintática <code>=</code>.
</p>
<p>Note que pelo fato de as regras de avaliação de expressões predicadas
(em particular pelo fato de <code>not <var>expr</var></code> fazer com que ocorra a avaliação de <var>expr</var>),
a forma <code>not <var>a</var> = <var>b</var></code> não é equivalente à forma <code><var>a</var> # <var>b</var></code> em alguns casos.
</p>
<p>Note que devido às regras para avaliação de expressões predicadas
(em particular devido a <code>not <var>expr</var></code> fazer com que a avaliação de <var>expr</var> ocorra),
<code>not <var>a</var> = <var>b</var></code> é equivalente a <code>is(<var>a</var> # <var>b</var>)</code>,
em lugar de ser equivalente a <code><var>a</var> # <var>b</var></code>.
</p>
<p>Exemplos:
</p><div class="example">
<pre class="example">(%i1) a = b;
(%o1)                         a = b
(%i2) é (a = b);
(%o2)                         false
(%i3) a # b;
(%o3)                         a # b
(%i4) not a = b;
(%o4)                         true
(%i5) é (a # b);
(%o5)                         true
(%i6) é (not a = b);
(%o6)                         true
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002f_002e"></span><dl class="def">
<dt id="index-_002e"><span class="category">Operador: </span><span><strong>.</strong><a href='#index-_002e' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>O operador ponto, para multiplicação (não comutativa) de matrizes.
Quando &quot;.&quot; é usado com essa finalidade, espaços devem ser colocados em ambos os lados desse
operador, e.g. A . B.  Isso disting&uuml;e o operador ponto plenamente de um ponto decimal em
um número em ponto flutuante.
</p>
<p>Veja também
<code>dot</code>,
<code>dot0nscsimp</code>,
<code>dot0simp</code>,
<code>dot1simp</code>,
<code>dotassoc</code>,
<code>dotconstrules</code>,
<code>dotdistrib</code>,
<code>dotexptsimp</code>,
<code>dotident</code>,
e
<code>dotscrules</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002f_003a"></span><dl class="def">
<dt id="index-_003a"><span class="category">Operador: </span><span><strong>:</strong><a href='#index-_003a' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>O operador de atribuição.  E.g. A:3 escolhe a variável A para 3.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002f_003a_003a"></span><dl class="def">
<dt id="index-_003a_003a"><span class="category">Operador: </span><span><strong>::</strong><a href='#index-_003a_003a' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Operador de atribuição.  :: atribui o valor da expressão
em seu lado direito para o valor da quantidade na sua esquerda, que pode
avaliar para uma variável atômica ou variável subscrita.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002f_003a_003a_003d"></span><dl class="def">
<dt id="index-_003a_003a_003d"><span class="category">Operador: </span><span><strong>::=</strong><a href='#index-_003a_003a_003d' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Operador de definição de função de macro.
<code>::=</code> define uma função (chamada uma &quot;macro&quot; por razões históricas)
que coloca um apóstrofo em seus argumentos (evitando avaliação),
e a expressão que é retornada (chamada a &quot;expansão de macro&quot;)
é avaliada no contexto a partir do qual a macro foi chamada.
Uma função de macro é de outra forma o mesmo que uma função comum.
</p>
<p><code>macroexpand</code> retorna uma expansão de macro (sem avaliar a expansão).
<code>macroexpand (foo (x))</code> seguida por <code>''%</code> é equivalente a <code>foo (x)</code>
quando <code>foo</code> for uma função de macro.
</p>
<p><code>::=</code> coloca o nome da nova função de macro dentro da lista global <code>macros</code>.
<code>kill</code>, <code>remove</code>, e <code>remfunction</code> desassocia definições de função de macro
e remove nomes de <code>macros</code>.
</p>
<p><code>fundef</code> e <code>dispfun</code> retornam respectivamente uma definição de função de macro
e uma atribuição dessa definição a um rótulo, respectivamente.
</p>
<p>Funções de macro comumente possuem expressões <code>buildq</code> e
<code>splice</code> para construir uma expressão,
que é então avaliada.
</p>
<p>Exemplos
</p>
<p>Uma função de macro coloca um apóstrofo em seus argumentos evitando então a avaliação,
então mensagem (1) mostra <code>y - z</code>, não o valor de <code>y - z</code>.
A expansão de macro (a expressão com apóstrofo <code>'(print (&quot;(2) x is equal to&quot;, x))</code>
é avaliada no contexto a partir do qual a macro for chamada,
mostrando a mensagem (2).
</p>
<div class="example">
<pre class="example">(%i1) x: %pi;
(%o1)                          %pi
(%i2) y: 1234;
(%o2)                         1234
(%i3) z: 1729 * w;
(%o3)                        1729 w
(%i4) printq1 (x) ::= block (print (&quot;(1) x é igual a&quot;, x), '(print (&quot;(2) x é igual a&quot;, x)));
(%o4) printq1(x) ::= block(print(&quot;(1) x é igual a&quot;, x), 
                                '(print(&quot;(2) x é igual a&quot;, x)))
(%i5) printq1 (y - z);
(1) x é igual a y - z 
(2) x é igual a %pi 
(%o5)                          %pi
</pre></div>

<p>Uma função comum avalia seus argumentos, então message (1) mostra o valor de <code>y - z</code>.
O valor de retorno não é avaliado, então mensagem (2) não é mostrada
até a avaliação explícita <code>''%</code>.
</p>
<div class="example">
<pre class="example">(%i1) x: %pi;
(%o1)                          %pi
(%i2) y: 1234;
(%o2)                         1234
(%i3) z: 1729 * w;
(%o3)                        1729 w
(%i4) printe1 (x) := block (print (&quot;(1) x é igual a&quot;, x), '(print (&quot;(2) x é igual a&quot;, x)));
(%o4) printe1(x) := block(print(&quot;(1) x é igual a&quot;, x), 
                                '(print(&quot;(2) x é igual a&quot;, x)))
(%i5) printe1 (y - z);
(1) x é igual a 1234 - 1729 w 
(%o5)              print((2) x é igual a, x)
(%i6) ''%;
(2) x é igual a %pi 
(%o6)                          %pi
</pre></div>

<p><code>macroexpand</code> retorna uma expansão de macro.
<code>macroexpand (foo (x))</code> seguido por <code>''%</code> é equivalente a <code>foo (x)</code>
quando <code>foo</code> for uma função de macro.
</p>
<div class="example">
<pre class="example">(%i1) x: %pi;
(%o1)                          %pi
(%i2) y: 1234;
(%o2)                         1234
(%i3) z: 1729 * w;
(%o3)                        1729 w
(%i4) g (x) ::= buildq ([x], print (&quot;x é igual a&quot;, x));
(%o4)    g(x) ::= buildq([x], print(&quot;x é igual a&quot;, x))
(%i5) macroexpand (g (y - z));
(%o5)              print(x é igual a, y - z)
(%i6) ''%;
x é igual a 1234 - 1729 w 
(%o6)                     1234 - 1729 w
(%i7) g (y - z);
x é igual a 1234 - 1729 w 
(%o7)                     1234 - 1729 w
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002f_003a_003d"></span><dl class="def">
<dt id="index-_003a_003d"><span class="category">Operador: </span><span><strong>:=</strong><a href='#index-_003a_003d' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>O operador de definição de função.  E.g. <code>f(x):=sin(x)</code> define
uma função <code>f</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002f_003d"></span><dl class="def">
<dt id="index-_003d"><span class="category">Operador: </span><span><strong>=</strong><a href='#index-_003d' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>O operador de equação.
</p>
<p>Uma expressão <code><var>a</var> = <var>b</var></code>, por si mesma, representa
uma equação não avaliada, a qual pode ou não se manter.
Equações não avaliadas podem aparecer como argumentos para <code>solve</code> e <code>algsys</code>
ou algumas outras funções.
</p>
<p>A função <code>is</code> avalia <code>=</code> para um valor Booleano.
<code>is(<var>a</var> = <var>b</var>)</code> avalia <code><var>a</var> = <var>b</var></code> para <code>true</code> quando <var>a</var> e <var>b</var>
forem idênticos. Isto é, <var>a</var> e <var>b</var> forem átomos que são idênticos,
ou se eles não forem átomos e seus operadores forem idênticos e seus argumentos forem idênticos.
De outra forma, <code>is(<var>a</var> = <var>b</var>)</code> avalia para <code>false</code>;
<code>is(<var>a</var> = <var>b</var>)</code> nunca avalia para <code>unknown</code>.
Quando <code>is(<var>a</var> = <var>b</var>)</code> for <code>true</code>, <var>a</var> e <var>b</var> são ditos para serem sintaticamente iguais,
em contraste para serem expressões equivalentes, para as quais <code>is(equal(<var>a</var>, <var>b</var>))</code> é <code>true</code>.
Expressões podem ser equivalentes e não sintáticamente iguais.
</p>
<p>A negação de <code>=</code> é representada por <code>#</code>.
Da mesma forma que com <code>=</code>, uma expressão <code><var>a</var> # <var>b</var></code>, por si mesma, não é avaliada.
<code>is(<var>a</var> # <var>b</var>)</code> avalia <code><var>a</var> # <var>b</var></code> para
<code>true</code> ou <code>false</code>.
</p>
<p>Complementando a função <code>is</code>,
alguns outros operadores avaliam <code>=</code> e <code>#</code> para <code>true</code> ou <code>false</code>,
a saber <code>if</code>, <code>and</code>, <code>or</code>, e <code>not</code>.
</p>
<p>Note que pelo fato de as regras de avaliação de expressões predicadas
(em particular pelo fato de <code>not <var>expr</var></code> fazer com que ocorra a avaliação de <var>expr</var>),
a forma <code>not <var>a</var> = <var>b</var></code> é equivalente a <code>is(<var>a</var> # <var>b</var>)</code>,
em lugar de ser equivalente a <code><var>a</var> # <var>b</var></code>.
</p>
<p><code>rhs</code> e <code>lhs</code> retornam o primeiro membro e o segundo membro de uma equação,
respectivamente, de uma equação ou inequação.
</p>
<p>Veja também <code>equal</code> e <code>notequal</code>.
</p>
<p>Exemplos:
</p>
<p>Uma expressão <code><var>a</var> = <var>b</var></code>, por si mesma, representa
uma equação não avaliada, a qual pode ou não se manter.
</p>
<div class="example">
<pre class="example">(%i1) eq_1 : a * x - 5 * y = 17;
(%o1)                    a x - 5 y = 17
(%i2) eq_2 : b * x + 3 * y = 29;
(%o2)                    3 y + b x = 29
(%i3) solve ([eq_1, eq_2], [x, y]);
                        196         29 a - 17 b
(%o3)          [[x = ---------, y = -----------]]
                     5 b + 3 a       5 b + 3 a
(%i4) subst (%, [eq_1, eq_2]);
         196 a     5 (29 a - 17 b)
(%o4) [--------- - --------------- = 17, 
       5 b + 3 a      5 b + 3 a
                                  196 b     3 (29 a - 17 b)
                                --------- + --------------- = 29]
                                5 b + 3 a      5 b + 3 a
(%i5) ratsimp (%);
(%o5)                  [17 = 17, 29 = 29]
</pre></div>

<p><code>is(<var>a</var> = <var>b</var>)</code> avalia <code><var>a</var> = <var>b</var></code> para <code>true</code> quando <var>a</var> e <var>b</var>
são sintaticamente iguais (isto é, identicos).
Expressões podem ser equivalentes e não sintaticamente iguais.
</p>
<div class="example">
<pre class="example">(%i1) a : (x + 1) * (x - 1);
(%o1)                    (x - 1) (x + 1)
(%i2) b : x^2 - 1;
                              2
(%o2)                        x  - 1
(%i3) [is (a = b), is (a # b)];
(%o3)                     [false, true]
(%i4) [is (equal (a, b)), is (notequal (a, b))];
(%o4)                     [true, false]
</pre></div>

<p>Alguns operadores avaliam <code>=</code> e <code>#</code> para <code>true</code> ou <code>false</code>.
</p>
<div class="example">
<pre class="example">(%i1) if expand ((x + y)^2) = x^2 + 2 * x * y + y^2 then FOO else BAR;
(%o1)                          FOO
(%i2) eq_3 : 2 * x = 3 * x;
(%o2)                       2 x = 3 x
(%i3) eq_4 : exp (2) = %e^2;
                              2     2
(%o3)                       %e  = %e
(%i4) [eq_3 and eq_4, eq_3 or eq_4, not eq_3];
(%o4)                  [false, true, true]
</pre></div>

<p>Devido a <code>not <var>expr</var></code> fazer com que a avaliação de <var>expr</var> ocorra,
<code>not <var>a</var> = <var>b</var></code> é equivalente a <code>is(<var>a</var> # <var>b</var>)</code>.
</p>
<div class="example">
<pre class="example">(%i1) [2 * x # 3 * x, not (2 * x = 3 * x)];
(%o1)                   [2 x # 3 x, true]
(%i2) is (2 * x # 3 * x);
(%o2)                         true
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fand"></span><dl class="def">
<dt id="index-and"><span class="category">Operador: </span><span><strong>and</strong><a href='#index-and' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>O operador lógico de conjunção.
<code>and</code> é um operador n-ário infixo;
seus operandos são expressões Booleanas, e seu resultado é um valor Booleano.
</p>
<p><code>and</code> força avaliação (como <code>is</code>) de um ou mais operandos,
e pode forçar a avaliação de todos os operandos.
</p>
<p>Operandos são avaliados na ordem em que aparecerem.
<code>and</code> avalia somente quantos de seus operandos forem necessários para determinar o resultado.
Se qualquer operando for <code>false</code>,
o resultado é <code>false</code> e os operandos restantes não são avaliados.
</p>
<p>O sinalizador global <code>prederror</code> governa o comportamento de <code>and</code>
quando um operando avaliado não pode ser determinado como sendo <code>true</code> ou <code>false</code>.
<code>and</code> imprime uma mensagem de erro quando <code>prederror</code> for <code>true</code>.  
De outra forma, operandos que não avaliam para <code>true</code> ou para <code>false</code> são aceitos,
and o resultado é uma expressão Booleana.
</p>
<p><code>and</code> não é comutativo:
<code>a and b</code> pode não ser igual a <code>b and a</code> devido ao tratamento de operandos indeterminados.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002for"></span><dl class="def">
<dt id="index-or"><span class="category">Operador: </span><span><strong>or</strong><a href='#index-or' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>O operador lógico de disjunção.
<code>or</code> é um operador n-ário infixo;
seus operandos são expressões Booleanas, e seu resultado é um valor Booleano.
</p>
<p><code>or</code> força avaliação (como <code>is</code>) de um ou mais operandos,
e pode forçar a avaliação de todos os operandos.
</p>
<p>Operandos são avaliados na ordem em que aparecem.
<code>or</code> avalia somente quantos de seus operandos forem necessários para determinar o resultado.
Se qualquer operando for <code>true</code>,
o resultado é <code>true</code> e os operandos restantes não são avaliados.
</p>
<p>O sinalizador global <code>prederror</code> governa o comportamento de <code>or</code>
quando um operando avaliado não puder ser determinado como sendo <code>true</code> ou <code>false</code>.
<code>or</code> imprime uma mensagem de erro quando <code>prederror</code> for <code>true</code>.
De outra forma, operandos que não avaliam para <code>true</code> ou para <code>false</code> são aceitos,
E o resultado é uma expressão Booleana.
</p>
<p><code>or</code> não é comutativo:
<code>a or b</code> pode não ser igual a <code>b or a</code> devido ao tratamento de operando indeterminados.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fnot"></span><dl class="def">
<dt id="index-not"><span class="category">Operador: </span><span><strong>not</strong><a href='#index-not' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>O operador lógico de negação.
<code>not</code> é operador prefixado;
Seu operando é uma expressão Booleana, e seu resultado é um valor Booleano.
</p>
<p><code>not</code> força a avaliação (como <code>is</code>) de seu operando.
</p>
<p>O sinalizador global <code>prederror</code> governa o comportamento de <code>not</code>
quando seu operando não pode ser determinado em termos de <code>true</code> ou <code>false</code>.
<code>not</code> imprime uma mensagem de erro quando <code>prederror</code> for <code>true</code>.
De outra forma, operandos que não avaliam para <code>true</code> ou para <code>false</code> são aceitos,
e o resultado é uma expressão Booleana.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fabs"></span><dl class="def">
<dt id="index-abs"><span class="category">Função: </span><span><strong>abs</strong> <em>(<var>expr</var>)</em><a href='#index-abs' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Retorna o valor absoluto de <var>expr</var>.  Se <var>expr</var> for um número complexo, retorna o módulo
complexo de <var>expr</var>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdefvr_002fadditive"></span><dl class="def">
<dt id="index-additive"><span class="category">Palavra chave: </span><span><strong>additive</strong><a href='#index-additive' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Se <code>declare(f,additive)</code> tiver sido executado, então:
</p>
<p>(1) Se <code>f</code> for uma função de uma única variável, sempre que o simplificador encontrar <code>f</code> aplicada
a uma adição, <code>f</code> será distribuído sobre aquela adição.  I.e. <code>f(y+x)</code> irá
simplificar para <code>f(y)+f(x)</code>.
</p>
<p>(2) Se <code>f</code> for uma função de 2 ou mais argumentos, a adição é definida como 
adição no primeiro argumento para <code>f</code>, como no caso de <code>sum</code> ou  
<code>integrate</code>, i.e. <code>f(h(x)+g(x),x)</code> irá simplificar para <code>f(h(x),x)+f(g(x),x)</code>.
Essa simplificação não ocorre quando <code>f</code> é aplicada para expressões da
forma <code>sum(x[i],i,lower-limit,upper-limit)</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdefvr_002fallbut"></span><dl class="def">
<dt id="index-allbut"><span class="category">Palavra chave: </span><span><strong>allbut</strong><a href='#index-allbut' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>trabalha com os comandos <code>part</code> (i.e. <code>part</code>, <code>inpart</code>, <code>substpart</code>,
<code>substinpart</code>, <code>dpart</code>, e <code>lpart</code>).  Por exemplo,
</p>
<div class="example">
<pre class="example">(%i1) expr : e + d + c + b + a;
(%o1)                   e + d + c + b + a
(%i2) part (expr, [2, 5]);
(%o2)                         d + a
</pre></div>

<p>enquanto
</p>
<div class="example">
<pre class="example">(%i1) expr : e + d + c + b + a;
(%o1)                   e + d + c + b + a
(%i2) part (expr, allbut (2, 5));
(%o2)                       e + c + b
</pre></div>

<p><code>allbut</code> é também reconhecido por <code>kill</code>.
</p> 
<div class="example">
<pre class="example">(%i1) [aa : 11, bb : 22, cc : 33, dd : 44, ee : 55];
(%o1)                 [11, 22, 33, 44, 55]
(%i2) kill (allbut (cc, dd));
(%o0)                         done
(%i1) [aa, bb, cc, dd];
(%o1)                   [aa, bb, 33, 44]
</pre></div>

<p><code>kill(allbut(<var>a_1</var>, <var>a_2</var>, ...))</code> tem o mesmo efeito que <code>kill(all)</code>
exceto que não elimina os símbolos <var>a_1</var>, <var>a_2</var>, ... .
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdefvr_002fantisymmetric"></span><dl class="def">
<dt id="index-antisymmetric"><span class="category">Declaração: </span><span><strong>antisymmetric</strong><a href='#index-antisymmetric' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Se <code>declare(h,antisymmetric)</code> é concluída, diz ao
simplicador que <code>h</code> é uma função antisimétrica.  E.g. <code>h(x,z,y)</code> simplificará para
<code>- h(x, y, z)</code>.  Isto é, dará (-1)^n vezes o resultado dado por
<code>symmetric</code> ou <code>commutative</code>, quando n for o número de interescolhas de dois
argumentos necessários para converter isso naquela forma.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fcabs"></span><dl class="def">
<dt id="index-cabs"><span class="category">Função: </span><span><strong>cabs</strong> <em>(<var>expr</var>)</em><a href='#index-cabs' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Retorna o valor absoluto complexo (o módulo complexo) de
<var>expr</var>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fceiling"></span><dl class="def">
<dt id="index-ceiling"><span class="category">Função: </span><span><strong>ceiling</strong> <em>(<var>x</var>)</em><a href='#index-ceiling' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Quando <var>x</var> for um número real, retorna o último inteiro que 
é maior que ou igual a <var>x</var>.  
</p>
<p>Se <var>x</var> for uma expressão constante (<code>10 * %pi</code>, por exemplo), 
<code>ceiling</code> avalia <var>x</var> usando grandes números em ponto flutuante, e 
aplica <code>ceiling</code> para o grande número em ponto flutuante resultante. Porque <code>ceiling</code> usa
avaliação de ponto flutuante, é possível, embora improvável, 
que <code>ceiling</code> possa retornar uma valor errôneo para entradas
constantes. Para prevenir erros, a avaliação de ponto flutuante
é concluída usando três valores para <code>fpprec</code>.
</p>
<p>Para entradas não constantes, <code>ceiling</code> tenta retornar um valor
simplificado.  Aqui está um exemplo de simplificações que <code>ceiling</code>
conhece:
</p>
<div class="example">
<pre class="example">(%i1) ceiling (ceiling (x));
(%o1)                      ceiling(x)
(%i2) ceiling (floor (x));
(%o2)                       floor(x)
(%i3) declare (n, integer)$
(%i4) [ceiling (n), ceiling (abs (n)), ceiling (max (n, 6))];
(%o4)                [n, abs(n), max(n, 6)]
(%i5) assume (x &gt; 0, x &lt; 1)$
(%i6) ceiling (x);
(%o6)                           1
(%i7) tex (ceiling (a));
$$\left \lceil a \right \rceil$$
(%o7)                         false
</pre></div>

<p>A função <code>ceiling</code> não mapeia automaticamente sobre listas ou matrizes.
Finalmente, para todas as entradas que forem manifestamente complexas, <code>ceiling</code> retorna 
uma forma substantiva.
</p>
<p>Se o intervalo de uma função é um subconjunto dos inteiros, o intervalo pode ser
declarado <code>integervalued</code>. Ambas as funções <code>ceiling</code> e <code>floor</code>
podem usar essa informação; por exemplo:
</p>
<div class="example">
<pre class="example">(%i1) declare (f, integervalued)$
(%i2) floor (f(x));
(%o2)                         f(x)
(%i3) ceiling (f(x) - 1);
(%o3)                       f(x) - 1
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fcharfun"></span><dl class="def">
<dt id="index-charfun"><span class="category">Função: </span><span><strong>charfun</strong> <em>(<var>p</var>)</em><a href='#index-charfun' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Retorna 0 quando o predicado <var>p</var> avaliar para <code>false</code>; retorna
1 quando o predicado avaliar para <code>true</code>.  Quando o predicado
avaliar para alguma coisa que não <code>true</code> ou <code>false</code> (<code>unknown</code>), 
retorna uma forma substantiva.
</p>
<p>Exemplos:
</p>
<div class="example">
<pre class="example">(%i1) charfun (x &lt; 1);
(%o1)                    charfun(x &lt; 1)
(%i2) subst (x = -1, %);
(%o2)                           1
(%i3) e : charfun ('&quot;and&quot; (-1 &lt; x, x &lt; 1))$
(%i4) [subst (x = -1, e), subst (x = 0, e), subst (x = 1, e)];
(%o4)                       [0, 1, 0]
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdefvr_002fcommutative"></span><dl class="def">
<dt id="index-commutative"><span class="category">Declaração: </span><span><strong>commutative</strong><a href='#index-commutative' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Se <code>declare(h,commutative)</code> é concluída, diz ao
simplicador que <code>h</code> é uma função comutativa.  E.g. <code>h(x,z,y)</code> irá
simplificar para <code>h(x, y, z)</code>.  Isto é o mesmo que <code>symmetric</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fcompare"></span><dl class="def">
<dt id="index-compare"><span class="category">Função: </span><span><strong>compare</strong> <em>(<var>x</var>, <var>y</var>)</em><a href='#index-compare' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Retorna um operador de comparação <var>op</var>
(<code>&lt;</code>, <code>&lt;=</code>, <code>&gt;</code>, <code>&gt;=</code>, <code>=</code>, ou <code>#</code>) tal que
<code>is (<var>x</var> <var>op</var> <var>y</var>)</code> avalia para <code>true</code>;
quando ou <var>x</var> ou <var>y</var> dependendo de <code>%i</code> e
<code><var>x</var> # <var>y</var></code>, retorna <code>notcomparable</code>;
Quando não existir tal operador ou
Maxima não estiver apto a determinar o operador, retorna <code>unknown</code>.
</p>
<p>Exemplos:
</p>
<div class="example">
<pre class="example">(%i1) compare (1, 2);
(%o1)                           &lt;
(%i2) compare (1, x);
(%o2)                        unknown
(%i3) compare (%i, %i);
(%o3)                           =
(%i4) compare (%i, %i + 1);
(%o4)                     notcomparable
(%i5) compare (1/x, 0);
(%o5)                           #
(%i6) compare (x, abs(x));
(%o6)                          &lt;=
</pre></div>

<p>A função <code>compare</code> não tenta de terminar se o domínio real de
seus argumentos é não vazio; dessa forma
</p>
<div class="example">
<pre class="example">(%i1) compare (acos (x^2 + 1), acos (x^2 + 1) + 1);
(%o1)                           &lt;
</pre></div>

<p>O domínio real de <code>acos (x^2 + 1)</code> é vazio.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fentier"></span><dl class="def">
<dt id="index-entier"><span class="category">Função: </span><span><strong>entier</strong> <em>(<var>x</var>)</em><a href='#index-entier' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Retorna o último inteiro menor que ou igual a <var>x</var> onde <var>x</var> é numérico.  <code>fix</code> (como em
<code>fixnum</code>) é um sinônimo disso, então <code>fix(<var>x</var>)</code> é precisamente o mesmo.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fequal"></span><dl class="def">
<dt id="index-equal"><span class="category">Função: </span><span><strong>equal</strong> <em>(<var>a</var>, <var>b</var>)</em><a href='#index-equal' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Representa a equivalência, isto é, valor igual.
</p> 
<p>Por si mesma, <code>equal</code> não avalia ou simplifica.
A função <code>is</code> tenta avaliar <code>equal</code> para um valor Booleano.
<code>is(equal(<var>a</var>, <var>b</var>))</code> 
retorna <code>true</code> (ou <code>false</code>) se
e somente se <var>a</var> e <var>b</var> forem iguais (ou não iguais) para todos os possíveis
valores de suas variáveis, como determinado através da avaliação de <code>ratsimp(<var>a</var> - <var>b</var>)</code>;
se <code>ratsimp</code> retornar 0, as duas expressões são consideradas equivalentes.
Duas expressões podem ser equivalentes mesmo se mesmo se elas não forem sintaticamente iguais (i.e., identicas).
</p>
<p>Quando <code>is</code> falhar em reduzir <code>equal</code> a <code>true</code> ou <code>false</code>,
o resultado é governado através do sinalizador global <code>prederror</code>.
Quando <code>prederror</code> for <code>true</code>,
<code>is</code> reclama com uma mensagem de erro.
De outra forma, <code>is</code> retorna <code>unknown</code>.
</p>
<p>Complementando <code>is</code>,
alguns outros operadores avaliam <code>equal</code> e <code>notequal</code> para <code>true</code> ou <code>false</code>,
a saber <code>if</code>, <code>and</code>, <code>or</code>, e <code>not</code>.
</p>

<p>A negação de <code>equal</code> é <code>notequal</code>.
</p>
<p>Exemplos:
</p>
<p>Por si mesmo, <code>equal</code> não avalia ou simplifica.
</p>
<div class="example">
<pre class="example">(%i1) equal (x^2 - 1, (x + 1) * (x - 1));
                        2
(%o1)            equal(x  - 1, (x - 1) (x + 1))
(%i2) equal (x, x + 1);
(%o2)                    equal(x, x + 1)
(%i3) equal (x, y);
(%o3)                      equal(x, y)
</pre></div>

<p>A função <code>is</code> tenta avaliar <code>equal</code> para um valor Booleano.
<code>is(equal(<var>a</var>, <var>b</var>))</code> retorna <code>true</code> quando <code>ratsimp(<var>a</var> - <var>b</var>)</code> retornar 0.
Duas expressões podem ser equivalentes mesmo se não forem sintaticamente iguais (i.e., identicas).
</p>
<div class="example">
<pre class="example">(%i1) ratsimp (x^2 - 1 - (x + 1) * (x - 1));
(%o1)                           0
(%i2) is (equal (x^2 - 1, (x + 1) * (x - 1)));
(%o2)                         true
(%i3) is (x^2 - 1 = (x + 1) * (x - 1));
(%o3)                         false
(%i4) ratsimp (x - (x + 1));
(%o4)                          - 1
(%i5) is (equal (x, x + 1));
(%o5)                         false
(%i6) is (x = x + 1);
(%o6)                         false
(%i7) ratsimp (x - y);
(%o7)                         x - y
(%i8) is (equal (x, y));
(%o8)                        unknown
(%i9) is (x = y);
(%o9)                         false
</pre></div>
 
<p>Quando <code>is</code> falha em reduzir <code>equal</code> a <code>true</code> ou <code>false</code>,
o resultado é governado através do sinalizador global <code>prederror</code>.
</p> 
<div class="example">
<pre class="example">(%i1) [aa : x^2 + 2*x + 1, bb : x^2 - 2*x - 1];
                    2             2
(%o1)             [x  + 2 x + 1, x  - 2 x - 1]
(%i2) ratsimp (aa - bb);
(%o2)                        4 x + 2
(%i3) prederror : true;
 (%o3)                         true
(%i4) is (equal (aa, bb));
Maxima was unable to evaluate the predicate:
       2             2
equal(x  + 2 x + 1, x  - 2 x - 1)
 -- an error.  Quitting.  To debug this try debugmode(true);
(%i5) prederror : false;
(%o5)                         false
(%i6) is (equal (aa, bb));
(%o6)                        unknown
</pre></div>

<p>Alguns operadores avaliam <code>equal</code> e <code>notequal</code> para <code>true</code> ou <code>false</code>.
</p>
<div class="example">
<pre class="example">(%i1) if equal (y, y - 1) then FOO else BAR;
(%o1)                          BAR
(%i2) eq_1 : equal (x, x + 1);
(%o2)                    equal(x, x + 1)
(%i3) eq_2 : equal (y^2 + 2*y + 1, (y + 1)^2);
                         2                   2
(%o3)             equal(y  + 2 y + 1, (y + 1) )
(%i4) [eq_1 and eq_2, eq_1 or eq_2, not eq_1];
(%o4)                  [false, true, true]
</pre></div>

<p>Devido a <code>not <var>expr</var></code> fazer com que ocorra a avaliação de <var>expr</var>,
<code>not equal(<var>a</var>, <var>b</var>)</code> é equivalente a <code>is(notequal(<var>a</var>, <var>b</var>))</code>.
</p>
<div class="example">
<pre class="example">(%i1) [notequal (2*z, 2*z - 1), not equal (2*z, 2*z - 1)];
(%o1)            [notequal(2 z, 2 z - 1), true]
(%i2) is (notequal (2*z, 2*z - 1));
(%o2)                         true
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002ffloor"></span><dl class="def">
<dt id="index-floor"><span class="category">Função: </span><span><strong>floor</strong> <em>(<var>x</var>)</em><a href='#index-floor' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Quando <var>x</var> for um número real, retorna o maior inteiro que 
é menor que ou igual a <var>x</var>.
</p>
<p>Se <var>x</var> for uma expressão constante (<code>10 * %pi</code>, for exemplo), 
<code>floor</code> avalia <var>x</var> usando grandes números em ponto flutuante, e 
aplica <code>floor</code> ao grande número em ponto flutuante resultante. Porque <code>floor</code> usa
avaliação em ponto flutuante, é possível, embora improvável, 
que <code>floor</code> não possa retornar um valor errôneo para entradas
constantes.  Para prevenir erros, a avaliação de ponto flutuante
é concluída usando três valores para <code>fpprec</code>.
</p>
<p>Para entradas não constantes, <code>floor</code> tenta retornar um valor
simplificado.  Aqui está exemplos de simplificações que <code>floor</code>
conhece:
</p>
<div class="example">
<pre class="example">(%i1) floor (ceiling (x));
(%o1)                      ceiling(x)
(%i2) floor (floor (x));
(%o2)                       floor(x)
(%i3) declare (n, integer)$
(%i4) [floor (n), floor (abs (n)), floor (min (n, 6))];
(%o4)                [n, abs(n), min(n, 6)]
(%i5) assume (x &gt; 0, x &lt; 1)$
(%i6) floor (x);
(%o6)                           0
(%i7) tex (floor (a));
$$\left \lfloor a \right \rfloor$$
(%o7)                         false
</pre></div>

<p>A função <code>floor</code> não mapeia automaticamente sobre listas ou matrizes.
Finalmente, para todas as entradas que forem manifestamente complexas, <code>floor</code> retorna
uma forma substantiva.
</p>
<p>Se o intervalo de uma função for um subconjunto dos inteiros, o intervalo pode ser
declarado <code>integervalued</code>. Ambas as funções <code>ceiling</code> e <code>floor</code>
podem usar essa informação; por exemplo:
</p>
<div class="example">
<pre class="example">(%i1) declare (f, integervalued)$
(%i2) floor (f(x));
(%o2)                         f(x)
(%i3) ceiling (f(x) - 1);
(%o3)                       f(x) - 1
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fnotequal"></span><dl class="def">
<dt id="index-notequal"><span class="category">Função: </span><span><strong>notequal</strong> <em>(<var>a</var>, <var>b</var>)</em><a href='#index-notequal' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Represents the negation of <code>equal(<var>a</var>, <var>b</var>)</code>.
</p>
<p>Exemplos:
</p>
<div class="example">
<pre class="example">(%i1) equal (a, b);
(%o1)                      equal(a, b)
(%i2) maybe (equal (a, b));
(%o2)                        unknown
(%i3) notequal (a, b);
(%o3)                    notequal(a, b)
(%i4) not equal (a, b);
(%o4)                    notequal(a, b)
(%i5) maybe (notequal (a, b));
(%o5)                        unknown
(%i6) assume (a &gt; b);
(%o6)                        [a &gt; b]
(%i7) equal (a, b);
(%o7)                      equal(a, b)
(%i8) maybe (equal (a, b));
(%o8)                         false
(%i9) notequal (a, b);
(%o9)                    notequal(a, b)
(%i10) maybe (notequal (a, b));
(%o10)                        true
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002feval"></span><dl class="def">
<dt id="index-eval"><span class="category">Operador: </span><span><strong>eval</strong><a href='#index-eval' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Como um argumento em uma chamada a <code>ev (<var>expr</var>)</code>,
<code>eval</code> causa uma avaliação extra de <var>expr</var>.
Veja <code>ev</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fevenp"></span><dl class="def">
<dt id="index-evenp"><span class="category">Função: </span><span><strong>evenp</strong> <em>(<var>expr</var>)</em><a href='#index-evenp' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Retorna <code>true</code> se <var>expr</var> for um inteiro sempre.
<code>false</code> é retornado em todos os outros casos.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002ffix"></span><dl class="def">
<dt id="index-fix"><span class="category">Função: </span><span><strong>fix</strong> <em>(<var>x</var>)</em><a href='#index-fix' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Um sinônimo para <code>entier (<var>x</var>)</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002ffullmap"></span><dl class="def">
<dt id="index-fullmap"><span class="category">Função: </span><span><strong>fullmap</strong> <em>(<var>f</var>, <var>expr_1</var>, ...)</em><a href='#index-fullmap' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Similar a <code>map</code>, mas <code>fullmap</code> mantém mapeadas para
baixo todas as subexpressões até que os operadores principais não mais sejam os
mesmos.
</p>
<p><code>fullmap</code> é usada pelo simplificador do
Maxima para certas manipulações de matrizes; dessa forma, Maxima algumas vezes gera
uma mensagem de erro concernente a <code>fullmap</code> mesmo apesar de <code>fullmap</code> não ter sido
explicitamente chamada pelo usuário.
</p>
<p>Exemplos:
</p>
<div class="example">
<pre class="example">(%i1) a + b * c;
(%o1)                        b c + a
(%i2) fullmap (g, %);
(%o2)                   g(b) g(c) + g(a)
(%i3) map (g, %th(2));
(%o3)                     g(b c) + g(a)
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002ffullmapl"></span><dl class="def">
<dt id="index-fullmapl"><span class="category">Função: </span><span><strong>fullmapl</strong> <em>(<var>f</var>, <var>list_1</var>, ...)</em><a href='#index-fullmapl' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Similar a <code>fullmap</code>, mas <code>fullmapl</code> somente mapeia sobre
listas e matrizes.
</p>
<p>Exemplo:
</p>
<div class="example">
<pre class="example">(%i1) fullmapl (&quot;+&quot;, [3, [4, 5]], [[a, 1], [0, -1.5]]);
(%o1)                [[a + 3, 4], [4, 3.5]]
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fis"></span><dl class="def">
<dt id="index-is"><span class="category">Função: </span><span><strong>is</strong> <em>(<var>expr</var>)</em><a href='#index-is' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Tenta determinar se a <var>expr</var> predicada (expressões que avaliam para <code>true</code>
ou <code>false</code>) é dedutível de fatos localizados na base de dados de <code>assume</code>.
</p>
<p>Se a dedutibilidade do predicado for <code>true</code> ou <code>false</code>,
<code>is</code> retorna <code>true</code> ou <code>false</code>, respectivamente.
De outra forma, o valor de retorno é governado através do sinalizador global <code>prederror</code>.
Quando <code>prederror</code> for <code>true</code>,
<code>is</code> reclama com uma mensagem de erro.
De outra forma, <code>is</code> retorna <code>unknown</code>.
</p>
<p><code>ev(<var>expr</var>, pred)</code>
(que pode ser escrita da forma  <code><var>expr</var>, pred</code> na linha de comando interativa)
é equivalente a <code>is(<var>expr</var>)</code>.
</p>
<p>Veja também <code>assume</code>, <code>facts</code>, e <code>maybe</code>.
</p>
<p>Exemplos:
</p>
<p><code>is</code> causa avaliação de predicados.
</p>
<div class="example">
<pre class="example">(%i1) %pi &gt; %e;
(%o1)                       %pi &gt; %e
(%i2) é (%pi &gt; %e);
(%o2)                         true
</pre></div>

<p><code>is</code> tenta derivar predicados da base de dados do <code>assume</code>.
</p>
<div class="example">
<pre class="example">(%i1) assume (a &gt; b);
(%o1)                        [a &gt; b]
(%i2) assume (b &gt; c);
(%o2)                        [b &gt; c]
(%i3) é (a &lt; b);
(%o3)                         false
(%i4) é (a &gt; c);
(%o4)                         true
(%i5) é (equal (a, c));
(%o5)                         false
</pre></div>

<p>Se <code>is</code> não puder nem comprovar nem refutar uma forma predicada a partir da base de dados de <code>assume</code>,
o sinalizador global <code>prederror</code> governa o comportamento de <code>is</code>.
</p>
<div class="example">
<pre class="example">(%i1) assume (a &gt; b);
(%o1)                        [a &gt; b]
(%i2) prederror: true$
(%i3) é (a &gt; 0);
Maxima was unable to evaluate the predicate:
a &gt; 0
 -- an error.  Quitting.  To debug this try debugmode(true);
(%i4) prederror: false$
(%i5) é (a &gt; 0);
(%o5)                        unknown
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fmaybe"></span><dl class="def">
<dt id="index-maybe"><span class="category">Função: </span><span><strong>maybe</strong> <em>(<var>expr</var>)</em><a href='#index-maybe' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Tenta determinar se a <var>expr</var> predicada
é dedutível dos fatos na base de dados de <code>assume</code>.
</p>
<p>Se a dedutibilidade do predicado for <code>true</code> ou <code>false</code>,
<code>maybe</code> retorna <code>true</code> ou <code>false</code>, respectivamente.
De outra forma, <code>maybe</code> retorna <code>unknown</code>.
</p>
<p><code>maybe</code> é funcinalmente equivalente a <code>is</code> com <code>prederror: false</code>,
mas o resultado é computado sem atualmente atribuir um valor a <code>prederror</code>.
</p>
<p>Veja também <code>assume</code>, <code>facts</code>, e <code>is</code>.
</p>
<p>Exemplos:
</p>
<div class="example">
<pre class="example">(%i1) maybe (x &gt; 0);
(%o1)                        unknown
(%i2) assume (x &gt; 1);
(%o2)                        [x &gt; 1]
(%i3) maybe (x &gt; 0);
(%o3)                         true
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fisqrt"></span><dl class="def">
<dt id="index-isqrt"><span class="category">Função: </span><span><strong>isqrt</strong> <em>(<var>x</var>)</em><a href='#index-isqrt' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Retorna o &quot;inteiro raíz quadrada&quot;
do valor absoluto de <var>x</var>,
que é um inteiro.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002flmax"></span><dl class="def">
<dt id="index-lmax"><span class="category">Função: </span><span><strong>lmax</strong> <em>(<var>L</var>)</em><a href='#index-lmax' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Quando <var>L</var> for uma lista ou um conjunto, retorna <code>apply ('max, args (<var>L</var>))</code>.  Quando <var>L</var> não for uma
lista ou também não for um conjunto, sinaliza um erro.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002flmin"></span><dl class="def">
<dt id="index-lmin"><span class="category">Função: </span><span><strong>lmin</strong> <em>(<var>L</var>)</em><a href='#index-lmin' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Quando <var>L</var> for uma lista ou um conjunto, retorna <code>apply ('min, args (<var>L</var>))</code>. Quando <var>L</var> não for uma
lista ou ou também não for um conjunto, sinaliza um erro.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fmax"></span><dl class="def">
<dt id="index-max"><span class="category">Função: </span><span><strong>max</strong> <em>(<var>x_1</var>, ..., <var>x_n</var>)</em><a href='#index-max' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Retorna um valor simplificado para o máximo entre as expressões <var>x_1</var> a <var>x_n</var>.
Quando <code>get (trylevel, maxmin)</code>, for dois ou mais, <code>max</code> usa a simplificação 
<code>max (e, -e) --&gt; |e|</code>.  Quando <code>get (trylevel, maxmin)</code> for 3 ou mais, <var>max</var> tenta
eliminar expressões que estiverem entre dois outros argumentos; por exemplo,
<code>max (x, 2*x, 3*x) --&gt; max (x, 3*x)</code>. Para escolher o valor de <code>trylevel</code> para 2, use
<code>put (trylevel, 2, maxmin)</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fmin"></span><dl class="def">
<dt id="index-min"><span class="category">Função: </span><span><strong>min</strong> <em>(<var>x_1</var>, ..., <var>x_n</var>)</em><a href='#index-min' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Retorna um valor simplificado para o mínimo entre as expressões <code>x_1</code> até <code>x_n</code>.
Quando <code>get (trylevel, maxmin)</code>, for 2 ou mais, <code>min</code> usa a simplificação 
<code>min (e, -e) --&gt; -|e|</code>.  Quando <code>get (trylevel, maxmin)</code> for 3 ou mais, <code>min</code> tenta
eliminar expressões que estiverem entre dois outros argumentos; por exemplo,
<code>min (x, 2*x, 3*x) --&gt; min (x, 3*x)</code>. Para escolher o valor de <code>trylevel</code> para 2, use
<code>put (trylevel, 2, maxmin)</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fpolymod"></span><dl class="def">
<dt id="index-polymod"><span class="category">Função: </span><span><strong>polymod</strong> <em>(<var>p</var>)</em><a href='#index-polymod' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-polymod-1"><span class="category">Função: </span><span><strong>polymod</strong> <em>(<var>p</var>, <var>m</var>)</em><a href='#index-polymod-1' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Converte o polinômio <var>p</var> para uma representação modular
com relação ao módulo corrente que é o valor da variável
<code>modulus</code>.  
</p>
<p><code>polymod (<var>p</var>, <var>m</var>)</code> especifica um módulo <var>m</var> para ser usado 
em lugar do valor corrente de <code>modulus</code>.
</p>
<p>Veja <code>modulus</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fmod"></span><dl class="def">
<dt id="index-mod"><span class="category">Função: </span><span><strong>mod</strong> <em>(<var>x</var>, <var>y</var>)</em><a href='#index-mod' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Se <var>x</var> e <var>y</var> forem números reais e <var>y</var> for não nulo,
retorna <code><var>x</var> - <var>y</var> * floor(<var>x</var> / <var>y</var>)</code>.
Adicionalmente para todo real <var>x</var>, nós temos <code>mod (<var>x</var>, 0) = <var>x</var></code>. Para uma discursão da
definição <code>mod (<var>x</var>, 0) = <var>x</var></code>, veja a Seção 3.4, de &quot;Concrete Mathematics,&quot; 
por Graham, Knuth, e Patashnik. A função <code>mod (<var>x</var>, 1)</code> 
é uma função dente de serra com período 1 e com <code>mod (1, 1) = 0</code> e 
<code>mod (0, 1) = 0</code>.
</p>
<p>Para encontrar o argumento (um número no intervalo <code>(-%pi, %pi]</code>) de um 
número complexo, use a função <code><var>x</var> |-&gt; %pi - mod (%pi - <var>x</var>, 2*%pi)</code>, onde 
<var>x</var> é um argumento.
</p>
<p>Quando <var>x</var> e <var>y</var> forem expressões constantes (<code>10 * %pi</code>, por exemplo), <code>mod</code>
usa o mesmo esquema de avaliação em ponto flutuante que <code>floor</code> e <code>ceiling</code> usam.
Novamente, é possível, embora improvável, que <code>mod</code> possa retornar um
valor errôneo nesses casos.
</p>
<p>Para argumentos não numéricos <var>x</var> ou <var>y</var>, <code>mod </code>conhece muitas regras de
simplificação:
</p>
<div class="example">
<pre class="example">(%i1) mod (x, 0);
(%o1)                           x
(%i2) mod (a*x, a*y);
(%o2)                      a mod(x, y)
(%i3) mod (0, x);
(%o3)                           0
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002foddp"></span><dl class="def">
<dt id="index-oddp"><span class="category">Função: </span><span><strong>oddp</strong> <em>(<var>expr</var>)</em><a href='#index-oddp' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>é <code>true</code> se <var>expr</var> for um inteiro ímpar.
<code>false</code> é retornado em todos os outros casos.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fpred"></span><dl class="def">
<dt id="index-pred"><span class="category">Operador: </span><span><strong>pred</strong><a href='#index-pred' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Como um argumento em uma chamada a <code>ev (<var>expr</var>)</code>,
<code>pred</code> faz com que predicados (expressões que avaliam para <code>true</code>
ou <code>false</code>) sejam avaliados.
Veja <code>ev</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fmake_005frandom_005fstate"></span><dl class="def">
<dt id="index-make_005frandom_005fstate"><span class="category">Função: </span><span><strong>make_random_state</strong> <em>(<var>n</var>)</em><a href='#index-make_005frandom_005fstate' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-make_005frandom_005fstate-1"><span class="category">Função: </span><span><strong>make_random_state</strong> <em>(<var>s</var>)</em><a href='#index-make_005frandom_005fstate-1' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-make_005frandom_005fstate-2"><span class="category">Função: </span><span><strong>make_random_state</strong> <em>(true)</em><a href='#index-make_005frandom_005fstate-2' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-make_005frandom_005fstate-3"><span class="category">Função: </span><span><strong>make_random_state</strong> <em>(false)</em><a href='#index-make_005frandom_005fstate-3' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Um objeto de estado randômico representa o estado do gerador de números randômicos (aleatórios).
O estado compreende 627 palavras de 32 bits.
</p>
<p><code>make_random_state (<var>n</var>)</code> retorna um novo objeto de estado randômico
criado de um valor inteiro semente igual a <var>n</var> modulo 2^32.  
<var>n</var> pode ser negativo.
</p>

<p><code>make_random_state (<var>s</var>)</code> retorna uma copia do estado randômico <var>s</var>.
</p>
<p><code>make_random_state (true)</code> retorna um novo objeto de estado randômico,
usando a hora corrente  do relógio do computador como semente.
</p>
<p><code>make_random_state (false)</code> retorna uma cópia do estado corrente
do gerador de números randômicos.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fset_005frandom_005fstate"></span><dl class="def">
<dt id="index-set_005frandom_005fstate"><span class="category">Função: </span><span><strong>set_random_state</strong> <em>(<var>s</var>)</em><a href='#index-set_005frandom_005fstate' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Copia <var>s</var> para o estado do gerador de números randômicos.
</p>
<p><code>set_random_state</code> sempre retorna <code>done</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002frandom"></span><dl class="def">
<dt id="index-random"><span class="category">Função: </span><span><strong>random</strong> <em>(<var>x</var>)</em><a href='#index-random' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Retorna um número pseudorandômico. Se <var>x</var> é um inteiro, <code>random (<var>x</var>)</code> retorna um
inteiro de 0 a <code><var>x</var> - 1</code> inclusive. Se <var>x</var> for um número em ponto flutuante,
<code>random (<var>x</var>)</code> retorna um número não negativo em ponto flutuante menor que <var>x</var>.
<code>random</code> reclama com um erro se <var>x</var> não for nem um inteiro nem um número em ponto flutuante,
ou se <var>x</var> não for positivo.
</p>
<p>As funções <code>make_random_state</code> e <code>set_random_state</code>
mantém o estado do gerador de números randômicos.
</p>
<p>O gerador de números randômicos do Maxima é uma implementação do algorítmo de Mersenne twister MT 19937.
</p>
<p>Exemplos:
</p>
<div class="example">
<pre class="example">(%i1) s1: make_random_state (654321)$
(%i2) set_random_state (s1);
(%o2)                         done
(%i3) random (1000);
(%o3)                          768
(%i4) random (9573684);
(%o4)                        7657880
(%i5) random (2^75);
(%o5)                11804491615036831636390
(%i6) s2: make_random_state (false)$
(%i7) random (1.0);
(%o7)                   .2310127244107132
(%i8) random (10.0);
(%o8)                   4.394553645870825
(%i9) random (100.0);
(%o9)                   32.28666704056853
(%i10) set_random_state (s2);
(%o10)                        done
(%i11) random (1.0);
(%o11)                  .2310127244107132
(%i12) random (10.0);
(%o12)                  4.394553645870825
(%i13) random (100.0);
(%o13)                  32.28666704056853
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002frationalize"></span><dl class="def">
<dt id="index-rationalize"><span class="category">Função: </span><span><strong>rationalize</strong> <em>(<var>expr</var>)</em><a href='#index-rationalize' class='copiable-anchor'> &para;</a></span></dt>
<dd>
<p>Converte todos os números em ponto flutuante de precisão dupla e grandes números em ponto flutuante na expressão do Maxima
<var>expr</var> para seus exatos equivalentes racionais. Se você não estiver faminilarizado com
a representação binária de números em ponto flutuante, você pode se
surpreender que <code>rationalize (0.1)</code> não seja igual a 1/10.  Esse comportamento
não é especial para o Maxima &ndash; o número 1/10 tem uma representação binária
repetitiva e não terminada.
</p>
<div class="example">
<pre class="example">(%i1) rationalize (0.5);
                                1
(%o1)                           -
                                2
(%i2) rationalize (0.1);
                               1
(%o2)                          --
                               10
 (%i3) fpprec : 5$
(%i4) rationalize (0.1b0);
                             209715
(%o4)                        -------
                             2097152
(%i5) fpprec : 20$
(%i6) rationalize (0.1b0);
                     236118324143482260685
(%o6)                ----------------------
                     2361183241434822606848
(%i7) rationalize (sin (0.1*x + 5.6));
                              x    28
(%o7)                     sin(-- + --)
                              10   5
</pre></div>

<p>Exemplo de utilização:
</p>
<div class="example">
<pre class="example">(%i1) unitfrac(r) := block([uf : [], q],
    if not(ratnump(r)) then error(&quot;The input to 'unitfrac' must be a rational number&quot;),
    while r # 0 do (
        uf : cons(q : 1/ceiling(1/r), uf),
        r : r - q),
    reverse(uf)); 
(%o1) unitfrac(r) := block([uf : [], q], 
if not ratnump(r) then error(&quot;The input to 'unitfrac' must be a rational number&quot;
                                     1
), while r # 0 do (uf : cons(q : ----------, uf), r : r - q), 
                                         1
                                 ceiling(-)
                                         r
reverse(uf))
(%i2) unitfrac (9/10);
                            1  1  1
(%o2)                      [-, -, --]
                            2  3  15
(%i3) apply (&quot;+&quot;, %);
                               9
(%o3)                          --
                               10
(%i4) unitfrac (-9/10);
                                  1
(%o4)                       [- 1, --]
                                  10
(%i5) apply (&quot;+&quot;, %);
                                9
(%o5)                         - --
                                10
(%i6) unitfrac (36/37);
                        1  1  1  1    1
(%o6)                  [-, -, -, --, ----]
                        2  3  8  69  6808
(%i7) apply (&quot;+&quot;, %);
                               36
(%o7)                          --
                               37
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fsign"></span><dl class="def">
<dt id="index-sign"><span class="category">Função: </span><span><strong>sign</strong> <em>(<var>expr</var>)</em><a href='#index-sign' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Tenta determinar o sinal de <var>expr</var>
a partir dos fatos na base de dados corrente.  Retorna uma das
seguintes respostar: <code>pos</code> (positivo), <code>neg</code> (negativo), <code>zero</code>, <code>pz</code>
(positivo ou zero), <code>nz</code> (negativo ou zero), <code>pn</code> (positivo ou negativo),
ou <code>pnz</code> (positivo, negativo, ou zero, i.e. nada se sabe sobre o sinal da epressão).
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fsignum"></span><dl class="def">
<dt id="index-signum"><span class="category">Função: </span><span><strong>signum</strong> <em>(<var>x</var>)</em><a href='#index-signum' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Para um <var>x</var> numérico retorna 0 se <var>x</var> for 0, de outra forma retorna -1 ou +1
à medida que <var>x</var> seja menor ou maior que 0, respectivamente.
</p>
<p>Se <var>x</var> não for numérico então uma forma simplificada mas equivalente é retornada.
Por exemplo, <code>signum(-x)</code> fornece <code>-signum(x)</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fsort"></span><dl class="def">
<dt id="index-sort"><span class="category">Função: </span><span><strong>sort</strong> <em>(<var>L</var>, <var>P</var>)</em><a href='#index-sort' class='copiable-anchor'> &para;</a></span></dt>
<dt id="index-sort-1"><span class="category">Função: </span><span><strong>sort</strong> <em>(<var>L</var>)</em><a href='#index-sort-1' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Organiza uma lista <var>L</var> coforme o predicado <code>P</code> de dois argumentos,
de forma que <code><var>P</var> (<var>L</var>[k], <var>L</var>[k + 1])</code> seja <code>true</code>
para qualquer dois elementos sucessivos.
O predicado pode ser especificado como o nome de uma função ou operador binário infixo,
ou como uma expressão <code>lambda</code>.
Se especificado como o nome de um operador,
o nome deve ser contido entre &quot;aspas duplas&quot;.
</p>
<p>A lista ordenada é retornada como novo objeto;
o argumento <var>L</var> não é modificado.
Para construir o valor de retorno,
<code>sort</code> faz uma cópia superficial dos elementos de <var>L</var>.
Se o predicado <var>P</var> não for uma ordem total sobre os elementos de <var>L</var>,
então <code>sort</code> possivelvente pode executar para concluir sem error,
mas os resultados são indefinidos.
<code>sort</code> reclama se o predicado avaliar para alguma outra coisa
que não seja <code>true</code> ou <code>false</code>.
</p>
<p><code>sort (<var>L</var>)</code> é equivalente a <code>sort (<var>L</var>, orderlessp)</code>.
Isto é, a ordem padrão de organização é ascendente,
como determinado por <code>orderlessp</code>.
Todos os átomos do Maxima e expressões são comparáveis sob <code>orderlessp</code>,
embora exista exemplos isolados de expressões para as quais <code>orderlessp</code> não é transitiva;
isso é uma falha.
</p> 
<p>Exemplos:
</p> 
<div class="example">
<pre class="example">(%i1) sort ([11, -17, 29b0, 7.55, 3, -5/2, b + a, 9 * c, 19 - 3 * x]);
               5
(%o1) [- 17, - -, 3, 7.55, 11, 2.9b1, b + a, 9 c, 19 - 3 x]
               2
(%i2) sort ([11, -17, 29b0, 7.55, 3, -5/2, b + a, 9 * c, 19 - 3 * x], ordergreatp);
                                                   5
(%o2) [19 - 3 x, 9 c, b + a, 2.9b1, 11, 7.55, 3, - -, - 17]
                                                   2
(%i3) sort ([%pi, 3, 4, %e, %gamma]);
(%o3)                [3, 4, %e, %gamma, %pi]
(%i4) sort ([%pi, 3, 4, %e, %gamma], &quot;&lt;&quot;);
(%o4)                [%gamma, %e, 3, %pi, 4]
(%i5) my_list : [[aa, hh, uu], [ee, cc], [zz, xx, mm, cc], [%pi, %e]];
(%o5) [[aa, hh, uu], [ee, cc], [zz, xx, mm, cc], [%pi, %e]]
(%i6) sort (my_list);
(%o6) [[%pi, %e], [aa, hh, uu], [ee, cc], [zz, xx, mm, cc]]
(%i7) sort (my_list, lambda ([a, b], orderlessp (reverse (a), reverse (b))));
(%o7) [[%pi, %e], [ee, cc], [zz, xx, mm, cc], [aa, hh, uu]]
</pre></div>
 
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fsqrt"></span><dl class="def">
<dt id="index-sqrt"><span class="category">Função: </span><span><strong>sqrt</strong> <em>(<var>x</var>)</em><a href='#index-sqrt' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>A raíz quadrada de <var>x</var>. É representada internamente por
<code><var>x</var>^(1/2)</code>.  Veja também <code>rootscontract</code>.
</p>
<p><code>radexpand</code> se <code>true</code> fará com que n-ésimas raízes de fatores de um produto
que forem potências de n sejam colocados fora do radical, e.g.
<code>sqrt(16*x^2)</code> retonará <code>4*x</code> somente se <code>radexpand</code> for <code>true</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdefvr_002fsqrtdispflag"></span><dl class="def">
<dt id="index-sqrtdispflag"><span class="category">Variável de opção: </span><span><strong>sqrtdispflag</strong><a href='#index-sqrtdispflag' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Valor padrão: <code>true</code>
</p>
<p>Quando <code>sqrtdispflag</code> for <code>false</code>,
faz com que <code>sqrt</code> seja mostrado como expoente 1/2.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fsublis"></span><dl class="def">
<dt id="index-sublis"><span class="category">Função: </span><span><strong>sublis</strong> <em>(<var>lista</var>, <var>expr</var>)</em><a href='#index-sublis' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Faz multiplas substituições paralelas dentro de uma expressão.
</p>
<p>A variável <code>sublis_apply_lambda</code> controla a simplificação após
<code>sublis</code>.
</p>
<p>Exemplo:
</p>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fsublist"></span><dl class="def">
<dt id="index-sublist"><span class="category">Função: </span><span><strong>sublist</strong> <em>(<var>lista</var>, <var>p</var>)</em><a href='#index-sublist' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Retorna a lista de elementos da <var>lista</var> da qual o
predicado <code>p</code> retornar <code>true</code>.
</p>
<p>Exemplo:
</p>
<div class="example">
<pre class="example">(%i1) L: [1, 2, 3, 4, 5, 6];
(%o1)                  [1, 2, 3, 4, 5, 6]
(%i2) sublist (L, evenp);
(%o2)                       [2, 4, 6]
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdefvr_002fsublis_005fapply_005flambda"></span><dl class="def">
<dt id="index-sublis_005fapply_005flambda"><span class="category">Variável de opção: </span><span><strong>sublis_apply_lambda</strong><a href='#index-sublis_005fapply_005flambda' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Valor padrão: <code>true</code> - controla se os substitutos de
<code>lambda</code> são aplicados na simplificação após as <code>sublis</code> serem usadas ou
se você tem que fazer um <code>ev</code> para pegar coisas para aplicar.  <code>true</code> significa faça a
aplicação.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fsubst"></span><dl class="def">
<dt id="index-subst"><span class="category">Função: </span><span><strong>subst</strong> <em>(<var>a</var>, <var>b</var>, <var>c</var>)</em><a href='#index-subst' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Substitue <var>a</var> por <var>b</var> em <var>c</var>.  <var>b</var> deve ser um átomo ou uma
subexpressão completa de <var>c</var>.  Por exemplo, <code>x+y+z</code> é uma subexpressão
completa de <code>2*(x+y+z)/w</code> enquanto <code>x+y</code> não é. Quando <var>b</var> não tem
essas características, pode-se algumas vezes usar <code>substpart</code> ou <code>ratsubst</code>
(veja abaixo).  Alternativamente, se <var>b</var> for da forma de <code>e/f</code> então se poderá
usar <code>subst (a*f, e, c)</code> enquanto se <var>b</var> for da forma <code>e^(1/f)</code> então se poderá
usar <code>subst (a^f, e, c)</code>.  O comando <code>subst</code> também discerne o <code>x^y</code> de <code>x^-y</code>
de modo que <code>subst (a, sqrt(x), 1/sqrt(x))</code> retorna <code>1/a</code>.  <var>a</var> e <var>b</var> podem também ser
operadores de uma expressão contida entre aspas duplas <code>&quot;</code> ou eles podem ser nomes de
função.  Se se desejar substituir por uma variável independente em
formas derivadas então a função <code>at</code> (veja abaixo) poderá ser usada.
</p>
<p><code>subst</code> é um álias para <code>substitute</code>.
</p>
<p><code>subst (<var>eq_1</var>, <var>expr</var>)</code> ou <code>subst ([<var>eq_1</var>, ..., <var>eq_k</var>], <var>expr</var>)</code>
são outras formas
permitidas.  As <var>eq_i</var> são equações indicando substituições a serem feitas.
Para cada equação, o lado direito será substituído pelo lado esquerdo na
expressão <var>expr</var>.
</p>
<p><code>exptsubst</code> se <code>true</code> permite que substituições
como <code>y</code> por <code>%e^x</code> em <code>%e^(a*x)</code> ocorram.
</p>
<p>Quando <code>opsubst</code> for <code>false</code>,
<code>subst</code> tentará substituir dentro do operador de uma expressão.
E.g. <code>(opsubst: false, subst (x^2, r, r+r[0]))</code> trabalhará.
</p>
<p>Exemplos:
</p>
<div class="example">
<pre class="example">(%i1) subst (a, x+y, x + (x+y)^2 + y);
                                    2
(%o1)                      y + x + a
(%i2) subst (-%i, %i, a + b*%i);
(%o2)                       a - %i b
</pre></div>

<p>Para exemplos adicionais, faça <code>example (subst)</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fsubstinpart"></span><dl class="def">
<dt id="index-substinpart"><span class="category">Função: </span><span><strong>substinpart</strong> <em>(<var>x</var>, <var>expr</var>, <var>n_1</var>, ..., <var>n_k</var>)</em><a href='#index-substinpart' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Similar a <code>substpart</code>, mas <code>substinpart</code> trabalha sobre a
representação interna de <var>expr</var>.
</p>
<p>Exemplos:
</p>
<div class="example">
<pre class="example">(%i1) x . 'diff (f(x), x, 2);
                              2
                             d
(%o1)                   x . (--- (f(x)))
                               2
                             dx
(%i2) substinpart (d^2, %, 2);
                                  2
(%o2)                        x . d
(%i3) substinpart (f1, f[1](x + 1), 0);
(%o3)                       f1(x + 1)
</pre></div>

<p>Se o último argumento para a função <code>part</code> for uma lista de índices então
muitas subexpressões são escolhidas, cada uma correspondendo a um
índice da lista.  Dessa forma
</p>
<div class="example">
<pre class="example">(%i1) part (x + y + z, [1, 3]);
(%o1)                         z + x
</pre></div>

<p><code>piece</code> recebe o valor da última expressão selecionada quando usando as
funções <code>part</code>.  <code>piece</code> é escolhida durante a execução da função e
dessa forma pode ser referenciada para a própria função como mostrado abaixo.
Se <code>partswitch</code> for escolhida para <code>true</code> então <code>end</code> é retornado quando uma
parte selecionada de uma expressão não existir, de outra forma uma mensagem
de erro é fornecida.
</p>
<div class="example">
<pre class="example">(%i1) expr: 27*y^3 + 54*x*y^2 + 36*x^2*y + y + 8*x^3 + x + 1;
              3         2       2            3
(%o1)     27 y  + 54 x y  + 36 x  y + y + 8 x  + x + 1
(%i2) part (expr, 2, [1, 3]);
                                  2
(%o2)                         54 y
(%i3) sqrt (piece/54);
(%o3)                        abs(y)
(%i4) substpart (factor (piece), expr, [1, 2, 3, 5]);
                               3
(%o4)               (3 y + 2 x)  + y + x + 1
(%i5) expr: 1/x + y/x - 1/z;
                             1   y   1
(%o5)                      - - + - + -
                             z   x   x
(%i6) substpart (xthru (piece), expr, [2, 3]);
                            y + 1   1
(%o6)                       ----- - -
                              x     z
</pre></div>

<p>Também, escolhendo a opção <code>inflag</code> para <code>true</code> e chamando <code>part</code> ou <code>substpart</code> é
o mesmo que chamando <code>inpart</code> ou <code>substinpart</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fsubstpart"></span><dl class="def">
<dt id="index-substpart"><span class="category">Função: </span><span><strong>substpart</strong> <em>(<var>x</var>, <var>expr</var>, <var>n_1</var>, ..., <var>n_k</var>)</em><a href='#index-substpart' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Substitue <var>x</var> para a subexpressão
selecionada pelo resto dos argumentos como em <code>part</code>.  Isso retorna o
novo valor de <var>expr</var>.  <var>x</var> pode ser algum operador a ser substituído por um
operador de <var>expr</var>.  Em alguns casos <var>x</var> precisa ser contido em aspas duplas <code>&quot;</code>
(e.g.  <code>substpart (&quot;+&quot;, a*b, 0)</code> retorna <code>b + a</code>).
</p>
<div class="example">
<pre class="example">(%i1) 1/(x^2 + 2);
                               1
(%o1)                        ------
                              2
                             x  + 2
(%i2) substpart (3/2, %, 2, 1, 2);
                               1
(%o2)                       --------
                             3/2
                            x    + 2
(%i3) a*x + f (b, y);
(%o3)                     a x + f(b, y)
(%i4) substpart (&quot;+&quot;, %, 1, 0);
(%o4)                    x + f(b, y) + a
</pre></div>

<p>Também, escolhendo a opção <code>inflag</code> para <code>true</code> e chamando <code>part</code> ou <code>substpart</code> é
o mesmo que chamando <code>inpart</code> ou <code>substinpart</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fsubvarp"></span><dl class="def">
<dt id="index-subvarp"><span class="category">Função: </span><span><strong>subvarp</strong> <em>(<var>expr</var>)</em><a href='#index-subvarp' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Retorna <code>true</code> se <var>expr</var> for uma variável subscrita (i.e. que possui índice ou subscrito em sua grafia), por exemplo
<code>a[i]</code>.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fsymbolp"></span><dl class="def">
<dt id="index-symbolp"><span class="category">Função: </span><span><strong>symbolp</strong> <em>(<var>expr</var>)</em><a href='#index-symbolp' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Retorna <code>true</code> se <var>expr</var> for um símbolo, de outra forma retorna <code>false</code>.
com efeito, <code>symbolp(x)</code> é equivalente ao predicado <code>atom(x) and not numberp(x)</code>.
</p>
<p>Veja também <a href="maxima_23.html">Identificadores</a>
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002funorder"></span><dl class="def">
<dt id="index-unorder"><span class="category">Função: </span><span><strong>unorder</strong> <em>()</em><a href='#index-unorder' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Disabilita a ação de alias criada pelo último uso dos comandos
de ordenação <code>ordergreat</code> e <code>orderless</code>. <code>ordergreat</code> e <code>orderless</code> não podem
ser usados mais que uma vez cada sem chamar <code>unorder</code>. 
Veja também <code>ordergreat</code> e <code>orderless</code>.
</p>
<p>Exemplos:
</p>
<div class="example">
<pre class="example">(%i1) unorder();
(%o1)                          []
(%i2) b*x + a^2;
                                   2
(%o2)                       b x + a
(%i3) ordergreat (a);
(%o3)                         done
(%i4) b*x + a^2;
 %th(1) - %th(3);
                             2
(%o4)                       a  + b x
(%i5) unorder();
                              2    2
(%o5)                        a  - a
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fvectorpotential"></span><dl class="def">
<dt id="index-vectorpotential"><span class="category">Função: </span><span><strong>vectorpotential</strong> <em>(<var>givencurl</var>)</em><a href='#index-vectorpotential' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Retorna o potencial do vetor de um dado
vetor de torção, no sistema de coordenadas corrente.
<code>potentialzeroloc</code> tem um papel similar ao de <code>potential</code>, mas a ordem dos
lados esquerdos das equações deve ser uma permutação cíclica das
variáveis de coordenadas.
</p>
</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fxthru"></span><dl class="def">
<dt id="index-xthru"><span class="category">Função: </span><span><strong>xthru</strong> <em>(<var>expr</var>)</em><a href='#index-xthru' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Combina todos os termos de <var>expr</var> (o qual pode ser uma adição) sobre um
denominador comum sem produtos e somas exponenciadas
como <code>ratsimp</code> faz.  <code>xthru</code> cancela fatores comuns no numerador e
denominador de expressões racionais mas somente se os fatores são
explícitos.
</p>
<p>Algumas vezes é melhor usar <code>xthru</code> antes de <code>ratsimp</code> em uma
expressão com o objetivo de fazer com que fatores explicitos do máximo divisor comum entre o
numerador e o denominador seja cancelado simplificando dessa forma a
expressão a ser aplicado o <code>ratsimp</code>.
</p>
<div class="example">
<pre class="example">(%i1) ((x+2)^20 - 2*y)/(x+y)^20 + (x+y)^(-19) - x/(x+y)^20;
                                20
                 1       (x + 2)   - 2 y       x
(%o1)        --------- + --------------- - ---------
                    19             20             20
             (y + x)        (y + x)        (y + x)
(%i2) xthru (%);
                                 20
                          (x + 2)   - y
(%o2)                     -------------
                                   20
                            (y + x)
</pre></div>

</dd></dl>

<span id="Item_003a-Operators_002fdeffn_002fzeroequiv"></span><dl class="def">
<dt id="index-zeroequiv"><span class="category">Função: </span><span><strong>zeroequiv</strong> <em>(<var>expr</var>, <var>v</var>)</em><a href='#index-zeroequiv' class='copiable-anchor'> &para;</a></span></dt>
<dd><p>Testa se a expressão <var>expr</var> na variável
<var>v</var> é equivalente a zero, retornando <code>true</code>, <code>false</code>, ou
<code>dontknow</code> (não sei).
</p>
<p><code>zeroequiv</code> Tem essas restrições:
</p><ol>
<li> Não use funções que o Maxima não sabe como
diferenciar e avaliar.
</li><li> Se a expressão tem postes sobre o eixo real, podem existir erros
no resultado (mas isso é improvável ocorrer).
</li><li> Se a expressão contem funções que não são soluções para
equações diferenciais de primeira ordem (e.g.  funções de Bessel) pode ocorrer
resultados incorretos.
</li><li> O algorítmo usa avaliação em pontos aleatóriamente escolhidos para
subexpressões selecionadas cuidadosamente.  Isso é sempre negócio um tanto
quanto perigoso, embora o algorítmo tente minimizar o
potencial de erro.
</li></ol>

<p>Por exemplo
 <code>zeroequiv (sin(2*x) - 2*sin(x)*cos(x), x)</code> retorna
<code>true</code> e <code>zeroequiv (%e^x + x, x)</code> retorna <code>false</code>.
Por outro lado <code>zeroequiv (log(a*b) - log(a) - log(b), a)</code> retorna <code>dontknow</code> devido à
presença de um parâmetro extra <code>b</code>.
</p>
</dd></dl>


</div>
<hr>
<div class="header">
<p>
Anterior: <a href="maxima_17.html" accesskey="p" rel="prev">Operadores Relacionais</a>, Acima: <a href="maxima_11.html" accesskey="u" rel="up">Operadores</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Sum&aacute;rio" rel="contents">Conte&uacute;do</a>][<a href="maxima_231.html" title="&Iacute;ndice" rel="index">&Iacute;ndice</a>]</p>
</div>



</body>
</html>
